
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.0   Copyright 1985-2015 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 4-core Stata perpetual license:
       Serial number:  501406216891
         Licensed to:  Solomon Hsiang
                       Goldman School of Public Policy

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do table_lags_fun 

. 
. ***
. /* 
> Objective: The objective of this program is to create a dataset for municipal
> ities and brazil for the year 2009
> for all categories
> 
> Structure:
> 1. Insheet all data and get ready for merge
> 2. Merge
> 3. Rename and change characters
> 4. Save
> */
. *****************************************************************************
> ******
. 
. log using table_lags_fun, replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/solomon/Dropbox/GCP/WORKSHOP_STUDENT_FOLDERS/Viaene_Mortalit
> yHospAdmBrazil/Analysis/table_lags_fun.smcl
  log type:  smcl
 opened on:  11 Aug 2015, 21:24:44

. set matsize 800

. 
. ********* Preliminaries path and insheet *********
. *local path_raw /Users/arvidviaene/Dropbox/Viaene_MortalityHospAdmBrazil/Data
> /Raw/Data/Population_age/
. *local path_intermediate /Users/arvidviaene/Dropbox/Viaene_MortalityHospAdmBr
> azil/Data/Intermediate/
. *local path_intermediate /home/aviaene/Viaene_MortalityHospAdmBrazil/Analysis
> /Data/Intermediate/
. *set matsize 500
. *use "`path_intermediate'merged_monthly_97_09.dta", clear
. *xtset fips_month year
. use "/home/aviaene/Viaene_MortalityHospAdmBrazil/Data/Intermediate/merged_mon
> thly_97_09.dta"

. 
. 
. ********* locals temp and precip *********
. * 3-bins, lags and leads
. local three tavg_bin_0C_10C_ tavg_bin_10C_13C_ tavg_bin_13C_16C_ tavg_bin_16C
> _19C_ tavg_bin_19C_22C_ tavg_bin_25C_28C_ tavg_bin_28C_31C_ tavg_bin_31C_Inf_

. local three_2 tavg_bin_10C_13C_ tavg_bin_13C_16C_ tavg_bin_16C_19C_ tavg_bin_
> 19C_22C_ tavg_bin_25C_28C_ tavg_bin_28C_31C_ tavg_bin_31C_Inf_

. local three_l1 l1_tavg_bin_0C_10C_ l1_tavg_bin_10C_13C_ l1_tavg_bin_13C_16C_ 
> l1_tavg_bin_16C_19C_ l1_tavg_bin_19C_22C_ l1_tavg_bin_25C_28C_ l1_tavg_bin_28
> C_31C_ l1_tavg_bin_31C_Inf_

. local three_l2 l2_tavg_bin_0C_10C_ l2_tavg_bin_10C_13C_ l2_tavg_bin_13C_16C_ 
> l2_tavg_bin_16C_19C_ l2_tavg_bin_19C_22C_ l2_tavg_bin_25C_28C_ l2_tavg_bin_28
> C_31C_ l2_tavg_bin_31C_Inf_

. local three_l3 l3_tavg_bin_0C_10C_ l3_tavg_bin_10C_13C_ l3_tavg_bin_13C_16C_ 
> l3_tavg_bin_16C_19C_ l3_tavg_bin_19C_22C_ l3_tavg_bin_25C_28C_ l3_tavg_bin_28
> C_31C_ l3_tavg_bin_31C_Inf_

. 
. local precip precip_ precip_sq

. 
. local three_f1 f1_tavg_bin_0C_10C_ f1_tavg_bin_10C_13C_ f1_tavg_bin_13C_16C_ 
> f1_tavg_bin_16C_19C_ f1_tavg_bin_19C_22C_ f1_tavg_bin_25C_28C_ f1_tavg_bin_28
> C_31C_ f1_tavg_bin_31C_Inf_

. local three_f2 f2_tavg_bin_0C_10C_ f2_tavg_bin_10C_13C_ f2_tavg_bin_13C_16C_ 
> f2_tavg_bin_16C_19C_ f2_tavg_bin_19C_22C_ f2_tavg_bin_25C_28C_ f2_tavg_bin_28
> C_31C_ f2_tavg_bin_31C_Inf_

. local three_f3 f3_tavg_bin_0C_10C_ f3_tavg_bin_10C_13C_ f3_tavg_bin_13C_16C_ 
> f3_tavg_bin_16C_19C_ f3_tavg_bin_19C_22C_ f3_tavg_bin_25C_28C_ f3_tavg_bin_28
> C_31C_ f3_tavg_bin_31C_Inf_

. // Table Preliminaries
. local name monthly_three_fun

. local title Impact of Temperature on Mortality in Brazil; Omitted bin is 22-2
> 5C

. local three tavg_bin_0C_10C_ tavg_bin_10C_13C_ tavg_bin_13C_16C_ tavg_bin_16C
> _19C_ tavg_bin_19C_22C_ tavg_bin_25C_28C_ tavg_bin_28C_31C_ tavg_bin_31C_Inf_

. 
. timer on 1

. timer on 2

. **********************
. ** start
. local three tavg_bin_0C_10C_ tavg_bin_10C_13C_ tavg_bin_13C_16C_ tavg_bin_16C
> _19C_ tavg_bin_19C_22C_ tavg_bin_25C_28C_ tavg_bin_28C_31C_ tavg_bin_31C_Inf_

. *reg mrate_tot `three'
. areg mrate_tot `three' `precip' i.month#i.year i.state_fips#i.year [aw=pop_to
> t_weights], absorb(fips_month) vce(cluster fips)
(sum of wgt is   1.5329e+02)
note: 53.state_fips#1998.year omitted because of collinearity
note: 53.state_fips#1999.year omitted because of collinearity
note: 53.state_fips#2000.year omitted because of collinearity
note: 53.state_fips#2001.year omitted because of collinearity
note: 53.state_fips#2002.year omitted because of collinearity
note: 53.state_fips#2003.year omitted because of collinearity
note: 53.state_fips#2004.year omitted because of collinearity
note: 53.state_fips#2005.year omitted because of collinearity
note: 53.state_fips#2006.year omitted because of collinearity
note: 53.state_fips#2007.year omitted because of collinearity
note: 53.state_fips#2008.year omitted because of collinearity
note: 53.state_fips#2009.year omitted because of collinearity
note: 2.month#2002.year omitted because of collinearity
note: 3.month#1997b.year omitted because of collinearity
note: 4.month#2001.year omitted because of collinearity
note: 5.month#2009.year omitted because of collinearity
note: 6.month#2003.year omitted because of collinearity
note: 7.month#2000.year omitted because of collinearity
note: 8.month#2003.year omitted because of collinearity
note: 9.month#2004.year omitted because of collinearity
note: 10.month#1999.year omitted because of collinearity
note: 11.month#2009.year omitted because of collinearity
note: 12.month#1998.year omitted because of collinearity
note: 12.state_fips#1997b.year omitted because of collinearity
note: 12.state_fips#1999.year omitted because of collinearity
note: 13.state_fips#1998.year omitted because of collinearity
note: 14.state_fips#1998.year omitted because of collinearity
note: 15.state_fips#1998.year omitted because of collinearity
note: 16.state_fips#1998.year omitted because of collinearity
note: 17.state_fips#2008.year omitted because of collinearity
note: 21.state_fips#2007.year omitted because of collinearity
note: 22.state_fips#2006.year omitted because of collinearity
note: 23.state_fips#1998.year omitted because of collinearity
note: 24.state_fips#1998.year omitted because of collinearity
note: 25.state_fips#2006.year omitted because of collinearity
note: 26.state_fips#2006.year omitted because of collinearity
note: 27.state_fips#2007.year omitted because of collinearity
note: 28.state_fips#1997b.year omitted because of collinearity
note: 29.state_fips#2007.year omitted because of collinearity
note: 31.state_fips#2006.year omitted because of collinearity
note: 32.state_fips#2009.year omitted because of collinearity
note: 33.state_fips#2005.year omitted because of collinearity
note: 35.state_fips#2002.year omitted because of collinearity
note: 41.state_fips#1999.year omitted because of collinearity
note: 42.state_fips#2002.year omitted because of collinearity
note: 43.state_fips#2008.year omitted because of collinearity
note: 50.state_fips#2002.year omitted because of collinearity
note: 51.state_fips#1997b.year omitted because of collinearity
note: 52.state_fips#1997b.year omitted because of collinearity

Linear regression, absorbing indicators         Number of obs     =    820,020
                                                F( 453,   5256)   =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5209
                                                Adj R-squared     =     0.4807
                                                Root MSE          =    12.9678

                               (Std. Err. adjusted for 5,257 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
   mrate_tot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
tavg~0C_10C_ |   .6876847   .0413002    16.65   0.000     .6067192    .7686503
tav~10C_13C_ |   .4797729   .0268062    17.90   0.000     .4272216    .5323242
tavg~3C_16C_ |   .2057181   .0191719    10.73   0.000     .1681333     .243303
tavg~6C_19C_ |   .1313363   .0122549    10.72   0.000     .1073116     .155361
tavg~9C_22C_ |   .0019285   .0088694     0.22   0.828    -.0154593    .0193163
tavg~5C_28C_ |   .0317175   .0064058     4.95   0.000     .0191595    .0442755
tavg~8C_31C_ |   .0923263   .0138579     6.66   0.000     .0651591    .1194935
tavg~1C_Inf_ |   .5950902   .1426942     4.17   0.000     .3153504      .87483
     precip_ |   .0022008   .0009408     2.34   0.019     .0003564    .0040451
   precip_sq |  -5.05e-06   2.06e-06    -2.45   0.015    -9.09e-06   -1.00e-06
             |
  month#year |
     1 1998  |  -4.405452    1.93436    -2.28   0.023      -8.1976   -.6133033
     1 1999  |  -3.250778   1.926788    -1.69   0.092    -7.028084    .5265281
     1 2000  |  -5.365101   1.934592    -2.77   0.006    -9.157704   -1.572497
     1 2001  |  -5.360633   1.927742    -2.78   0.005    -9.139808   -1.581458
     1 2002  |  -3.905553   1.944199    -2.01   0.045    -7.716992   -.0941147
     1 2003  |  -6.415182   1.926756    -3.33   0.001    -10.19243   -2.637939
     1 2004  |  -6.205377   1.930127    -3.22   0.001    -9.989229   -2.421525
     1 2005  |  -6.733307    1.92661    -3.49   0.000    -10.51026   -2.956351
     1 2006  |  -7.028463   1.936079    -3.63   0.000    -10.82398   -3.232944
     1 2007  |  -8.436868   1.922811    -4.39   0.000    -12.20638   -4.667359
     1 2008  |  -7.871427   1.935836    -4.07   0.000    -11.66647   -4.076385
     1 2009  |  -7.809035   1.926635    -4.05   0.000    -11.58604    -4.03203
     2 1997  |   3.739128   1.924505     1.94   0.052    -.0337027    7.511958
     2 1998  |  -.0996983   .4746877    -0.21   0.834    -1.030283    .8308868
     2 1999  |  -.6458965   .2619357    -2.47   0.014    -1.159399   -.1323937
     2 2000  |  -.6176932   .3119493    -1.98   0.048    -1.229243   -.0061431
     2 2001  |  -1.950578   .3126422    -6.24   0.000    -2.563486   -1.337669
     2 2002  |          0  (omitted)
     2 2003  |  -1.137383   .4056224    -2.80   0.005    -1.932572    -.342195
     2 2004  |   1.191426   .2796576     4.26   0.000     .6431811    1.739671
     2 2005  |  -2.171053   .3344061    -6.49   0.000    -2.826628   -1.515478
     2 2006  |  -4.539643   .2996586   -15.15   0.000    -5.127098   -3.952187
     2 2007  |  -3.689027    .288494   -12.79   0.000    -4.254595   -3.123458
     2 2008  |  -2.163083   .2648062    -8.17   0.000    -2.682214   -1.643953
     2 2009  |  -3.761906   .2961987   -12.70   0.000    -4.342579   -3.181234
     3 1997  |          0  (omitted)
     3 1998  |  -4.083885   1.970883    -2.07   0.038    -7.947634   -.2201367
     3 1999  |  -2.929745   1.946019    -1.51   0.132     -6.74475    .8852602
     3 2000  |  -5.506378   1.935317    -2.85   0.004    -9.300404   -1.712352
     3 2001  |  -6.050672   1.925219    -3.14   0.002    -9.824901   -2.276444
     3 2002  |  -2.594584   1.965285    -1.32   0.187    -6.447359    1.258191
     3 2003  |   -5.09181   1.917147    -2.66   0.008    -8.850215   -1.333406
     3 2004  |  -1.759086   1.930603    -0.91   0.362    -5.543871    2.025699
     3 2005  |  -5.407054    1.93458    -2.79   0.005    -9.199634   -1.614474
     3 2006  |  -7.715511   1.927671    -4.00   0.000    -11.49455   -3.936475
     3 2007  |  -6.362067   1.929437    -3.30   0.001    -10.14457   -2.579569
     3 2008  |  -6.687684   1.924998    -3.47   0.001    -10.46148   -2.913888
     3 2009  |  -5.796076   1.932322    -3.00   0.003     -9.58423   -2.007922
     4 1997  |   6.011324   1.929506     3.12   0.002      2.22869    9.793958
     4 1998  |   1.262666   .2970673     4.25   0.000     .6802903    1.845041
     4 1999  |   2.534485   .3112927     8.14   0.000     1.924222    3.144748
     4 2000  |   .6149073   .2613442     2.35   0.019     .1025642     1.12725
     4 2001  |          0  (omitted)
     4 2002  |   .2980364   .2647074     1.13   0.260    -.2209001     .816973
     4 2003  |   1.137552   .3236202     3.52   0.000     .5031217    1.771982
     4 2004  |   2.108414   .2454535     8.59   0.000     1.627223    2.589604
     4 2005  |  -.7841795   .2618572    -2.99   0.003    -1.297528   -.2708306
     4 2006  |  -1.167438   .3117512    -3.74   0.000      -1.7786   -.5562764
     4 2007  |  -1.090565   .3161588    -3.45   0.001    -1.710368   -.4707627
     4 2008  |   -.730438   .2263535    -3.23   0.001    -1.174185   -.2866912
     4 2009  |  -.8354804   .2675287    -3.12   0.002    -1.359948    -.311013
     5 1997  |   5.628853   1.928319     2.92   0.004     1.848547    9.409159
     5 1998  |   2.587197   .3948195     6.55   0.000     1.813187    3.361207
     5 1999  |   3.361344   .3379616     9.95   0.000     2.698799     4.02389
     5 2000  |   .8421969   .3808663     2.21   0.027     .0955408    1.588853
     5 2001  |   .3395613   .3200644     1.06   0.289    -.2878979    .9670206
     5 2002  |  -.6925678   .3088697    -2.24   0.025    -1.298081   -.0870548
     5 2003  |   .7104665    .300845     2.36   0.018     .1206852    1.300248
     5 2004  |   1.021264    .287888     3.55   0.000     .4568835    1.585644
     5 2005  |   .5638977     .30581     1.84   0.065    -.0356169    1.163412
     5 2006  |   1.341832   .3757243     3.57   0.000     .6052559    2.078407
     5 2007  |  -.8361921   .2539393    -3.29   0.001    -1.334019   -.3383656
     5 2008  |  -.1339439   .3181666    -0.42   0.674    -.7576827    .4897949
     5 2009  |          0  (omitted)
     6 1997  |   8.540358   1.981874     4.31   0.000     4.655061    12.42566
     6 1998  |   5.541655   .4403368    12.59   0.000     4.678412    6.404898
     6 1999  |   2.507927   .3450741     7.27   0.000     1.831438    3.184416
     6 2000  |   -.024777   .3693886    -0.07   0.947    -.7489322    .6993781
     6 2001  |  -1.186997   .2568752    -4.62   0.000    -1.690579    -.683415
     6 2002  |  -.6433432   .2681351    -2.40   0.016    -1.168999    -.117687
     6 2003  |          0  (omitted)
     6 2004  |   1.532332   .2718585     5.64   0.000     .9993765    2.065288
     6 2005  |  -1.248048    .251442    -4.96   0.000    -1.740978   -.7551167
     6 2006  |  -.1406613   .2861042    -0.49   0.623    -.7015445    .4202218
     6 2007  |   .3413415   .2990238     1.14   0.254    -.2448695    .9275524
     6 2008  |  -1.667914    .266587    -6.26   0.000    -2.190536   -1.145293
     6 2009  |  -1.788334   .2621417    -6.82   0.000    -2.302241   -1.274427
     7 1997  |   6.990963   1.934789     3.61   0.000     3.197973    10.78395
     7 1998  |   4.707597   .3052387    15.42   0.000     4.109203    5.305992
     7 1999  |   1.392646   .3277956     4.25   0.000     .7500308    2.035262
     7 2000  |          0  (omitted)
     7 2001  |   .6415757   .3716596     1.73   0.084    -.0870316    1.370183
     7 2002  |   .2789274   .3318716     0.84   0.401    -.3716787    .9295335
     7 2003  |   .9697644   .3015936     3.22   0.001     .3785157    1.561013
     7 2004  |  -.6760646   .3447639    -1.96   0.050    -1.351945   -.0001841
     7 2005  |  -.5509238     .30037    -1.83   0.067    -1.139774    .0379263
     7 2006  |  -.0779712   .3165692    -0.25   0.805    -.6985783    .5426359
     7 2007  |    -1.5865   .2934301    -5.41   0.000    -2.161744   -1.011255
     7 2008  |  -.7196023    .301405    -2.39   0.017    -1.310481   -.1287232
     7 2009  |  -.3544452   .4402338    -0.81   0.421    -1.217486    .5085959
     8 1997  |   7.307581   1.918169     3.81   0.000     3.547172    11.06799
     8 1998  |   1.874847   .3059023     6.13   0.000     1.275152    2.474543
     8 1999  |   1.688088   .2857578     5.91   0.000     1.127884    2.248293
     8 2000  |   2.158204   .2647033     8.15   0.000     1.639276    2.677133
     8 2001  |   1.810339   .3148501     5.75   0.000     1.193102    2.427576
     8 2002  |   1.236025   .3416951     3.62   0.000     .5661602    1.905889
     8 2003  |          0  (omitted)
     8 2004  |   2.110041   .2428048     8.69   0.000     1.634042    2.586039
     8 2005  |   .0824902   .2648381     0.31   0.755    -.4367025    .6016828
     8 2006  |  -.6237965   .2821969    -2.21   0.027     -1.17702   -.0705732
     8 2007  |   .1323221   .2558846     0.52   0.605    -.3693181    .6339623
     8 2008  |  -.6973612   .2756879    -2.53   0.011    -1.237824   -.1568985
     8 2009  |   1.740102    .315695     5.51   0.000     1.121209    2.358995
     9 1997  |   4.357746   1.928331     2.26   0.024     .5774169    8.138075
     9 1998  |  -1.017161   .2902684    -3.50   0.000    -1.586208   -.4481141
     9 1999  |  -1.082528   .2769287    -3.91   0.000    -1.625423   -.5396327
     9 2000  |  -.9595822   .2678903    -3.58   0.000    -1.484758    -.434406
     9 2001  |  -.3969571     .27263    -1.46   0.145    -.9314251    .1375109
     9 2002  |  -.0541702   .2631158    -0.21   0.837    -.5699865    .4616462
     9 2003  |    .029602   .3311561     0.09   0.929    -.6196015    .6788055
     9 2004  |          0  (omitted)
     9 2005  |  -3.218928   .2436976   -13.21   0.000    -3.696676   -2.741179
     9 2006  |  -2.331114   .2484521    -9.38   0.000    -2.818183   -1.844045
     9 2007  |  -2.275796   .2602923    -8.74   0.000    -2.786077   -1.765515
     9 2008  |  -2.407539   .2785635    -8.64   0.000    -2.953639   -1.861439
     9 2009  |  -1.820433   .2847135    -6.39   0.000     -2.37859   -1.262276
    10 1997  |   5.414576   1.931755     2.80   0.005     1.627533    9.201619
    10 1998  |   .5887446   .3113017     1.89   0.059     -.021536    1.199025
    10 1999  |          0  (omitted)
    10 2000  |   1.015526   .2862713     3.55   0.000     .4543155    1.576737
    10 2001  |   1.672263    .291299     5.74   0.000     1.101196     2.24333
    10 2002  |   2.258059   .3273858     6.90   0.000     1.616247    2.899871
    10 2003  |   .2405701   .2611097     0.92   0.357    -.2713135    .7524537
    10 2004  |   .3797433   .2820174     1.35   0.178     -.173128    .9326146
    10 2005  |  -.1364635   .2588118    -0.53   0.598    -.6438421    .3709151
    10 2006  |  -1.688756   .2950477    -5.72   0.000    -2.267172    -1.11034
    10 2007  |  -.9991175   .2626688    -3.80   0.000    -1.514058   -.4841775
    10 2008  |   .6778852   .2972076     2.28   0.023     .0952348    1.260536
    10 2009  |  -.3931594   .2985083    -1.32   0.188    -.9783598    .1920409
    11 1997  |   4.618607   1.941766     2.38   0.017     .8119387    8.425276
    11 1998  |   .5133941   .3095018     1.66   0.097     -.093358    1.120146
    11 1999  |  -.6888017   .3292652    -2.09   0.036    -1.334298   -.0433051
    11 2000  |  -1.686693   .2924468    -5.77   0.000     -2.26001   -1.113375
    11 2001  |   .2809442   .2856162     0.98   0.325    -.2789823    .8408706
    11 2002  |  -.8303605   .2892458    -2.87   0.004    -1.397402   -.2633185
    11 2003  |  -.9747548   .3097776    -3.15   0.002    -1.582048    -.367462
    11 2004  |  -1.351382   .2991629    -4.52   0.000    -1.937865   -.7648985
    11 2005  |  -2.029356   .3174369    -6.39   0.000    -2.651664   -1.407048
    11 2006  |  -2.305914   .2788028    -8.27   0.000    -2.852483   -1.759344
    11 2007  |   -2.49766   .3102071    -8.05   0.000    -3.105795   -1.889525
    11 2008  |  -1.756224   .3118894    -5.63   0.000    -2.367657   -1.144791
    11 2009  |          0  (omitted)
    12 1997  |   6.164996   1.977653     3.12   0.002     2.287974    10.04202
    12 1998  |          0  (omitted)
    12 1999  |  -2.210538   .3090485    -7.15   0.000    -2.816401   -1.604674
    12 2000  |  -1.095392   .3382178    -3.24   0.001     -1.75844   -.4323451
    12 2001  |   .0369587   .2913658     0.13   0.899    -.5342392    .6081567
    12 2002  |  -.9337794    .341571    -2.73   0.006    -1.603401   -.2641583
    12 2003  |  -1.902577   .2697344    -7.05   0.000    -2.431368   -1.373785
    12 2004  |  -2.179248   .3054081    -7.14   0.000    -2.777974   -1.580521
    12 2005  |  -2.476055   .2687155    -9.21   0.000    -3.002849   -1.949261
    12 2006  |  -2.309373   .2805778    -8.23   0.000    -2.859422   -1.759324
    12 2007  |  -1.426584   .3156293    -4.52   0.000    -2.045348   -.8078194
    12 2008  |  -1.722983   .2779049    -6.20   0.000    -2.267792   -1.178174
    12 2009  |  -.7211266   .2596495    -2.78   0.006    -1.230147   -.2121058
             |
  state_fips#|
        year |
    11 1998  |    6.51413   2.213311     2.94   0.003     2.175122    10.85314
    11 1999  |   8.204267    3.61641     2.27   0.023     1.114601    15.29393
    11 2000  |   9.182676   4.469321     2.05   0.040     .4209501     17.9444
    11 2001  |   10.83842   3.841843     2.82   0.005     3.306811    18.37003
    11 2002  |   9.988888   4.204923     2.38   0.018     1.745492    18.23228
    11 2003  |   11.64303   3.517161     3.31   0.001      4.74793    18.53812
    11 2004  |   10.13421   3.641194     2.78   0.005     2.995956    17.27246
    11 2005  |   10.42189   3.662439     2.85   0.004     3.241984    17.60179
    11 2006  |   9.439073   2.485482     3.80   0.000     4.566495    14.31165
    11 2007  |   7.255357   2.904891     2.50   0.013     1.560565    12.95015
    11 2008  |   11.41505   2.477519     4.61   0.000     6.558084    16.27202
    11 2009  |   13.91114   2.195291     6.34   0.000     9.607456    18.21482
    12 1997  |          0  (omitted)
    12 1998  |   5.040028   2.381453     2.12   0.034       .37139    9.708666
    12 1999  |          0  (omitted)
    12 2000  |   6.886537   1.889731     3.64   0.000     3.181879     10.5912
    12 2001  |   4.723366   2.216207     2.13   0.033     .3786797    9.068053
    12 2002  |   3.395526   1.876566     1.81   0.070    -.2833223    7.074375
    12 2003  |   3.546698   1.913002     1.85   0.064    -.2035813    7.296977
    12 2004  |   3.114692   3.031942     1.03   0.304    -2.829174    9.058559
    12 2005  |   4.274082   3.210784     1.33   0.183    -2.020388    10.56855
    12 2006  |   2.956502     3.3432     0.88   0.377    -3.597559    9.510563
    12 2007  |   4.013463   3.029435     1.32   0.185    -1.925489    9.952415
    12 2008  |   5.025187   3.235492     1.55   0.120     -1.31772    11.36809
    12 2009  |   4.366548   2.235591     1.95   0.051    -.0161387    8.749235
    13 1997  |  -5.722845   2.336267    -2.45   0.014     -10.3029   -1.142791
    13 1998  |          0  (omitted)
    13 1999  |   5.276108   .8629565     6.11   0.000     3.584355    6.967861
    13 2000  |    9.80786   1.368159     7.17   0.000       7.1257    12.49002
    13 2001  |    10.7309   1.456471     7.37   0.000     7.875614    13.58619
    13 2002  |   10.97471   1.610474     6.81   0.000     7.817514    14.13191
    13 2003  |   10.85517   1.597893     6.79   0.000     7.722636     13.9877
    13 2004  |    10.3406   1.453015     7.12   0.000     7.492087    13.18911
    13 2005  |   11.85758   1.596924     7.43   0.000     8.726949    14.98822
    13 2006  |   13.06176   1.526685     8.56   0.000     10.06882     16.0547
    13 2007  |   12.68108   1.760776     7.20   0.000     9.229224    16.13293
    13 2008  |   13.91934   1.690192     8.24   0.000     10.60586    17.23282
    13 2009  |   14.24409   1.728569     8.24   0.000     10.85538    17.63281
    14 1997  |  -6.569103     2.0385    -3.22   0.001    -10.56541   -2.572796
    14 1998  |          0  (omitted)
    14 1999  |   4.263102   4.911272     0.87   0.385    -5.365032    13.89124
    14 2000  |   3.620449   3.608388     1.00   0.316    -3.453491    10.69439
    14 2001  |  -.8352088   1.782307    -0.47   0.639    -4.329272    2.658854
    14 2002  |  -.6629472   2.186839    -0.30   0.762    -4.950061    3.624167
    14 2003  |   1.071075   3.090719     0.35   0.729    -4.988017    7.130168
    14 2004  |   .2141053   3.402527     0.06   0.950    -6.456261    6.884471
    14 2005  |   1.251561   4.210641     0.30   0.766    -7.003045    9.506168
    14 2006  |   2.369176   4.432193     0.53   0.593    -6.319764    11.05812
    14 2007  |   1.632168   3.248057     0.50   0.615    -4.735373    7.999709
    14 2008  |   .8619755   3.417173     0.25   0.801    -5.837102    7.561053
    14 2009  |   .9357227   3.932721     0.24   0.812    -6.774044    8.645489
    15 1997  |  -5.846749   2.027009    -2.88   0.004    -9.820528   -1.872971
    15 1998  |          0  (omitted)
    15 1999  |   1.416789   .8615189     1.64   0.100    -.2721462    3.105723
    15 2000  |   1.976392   1.148946     1.72   0.085    -.2760207    4.228804
    15 2001  |   4.055205   1.162374     3.49   0.000      1.77647     6.33394
    15 2002  |   2.393897   1.856319     1.29   0.197    -1.245259    6.033053
    15 2003  |   4.945696    1.97982     2.50   0.013     1.064426    8.826967
    15 2004  |   4.246873   2.396798     1.77   0.076     -.451848    8.945593
    15 2005  |   5.595599   2.189492     2.56   0.011     1.303286    9.887912
    15 2006  |   6.120957    2.59233     2.36   0.018     1.038913      11.203
    15 2007  |   6.192317   2.394762     2.59   0.010     1.497589    10.88704
    15 2008  |   8.042897   1.981702     4.06   0.000     4.157938    11.92786
    15 2009  |   8.288084   2.100137     3.95   0.000     4.170942    12.40523
    16 1997  |   .0346547   2.265447     0.02   0.988    -4.406562    4.475871
    16 1998  |          0  (omitted)
    16 1999  |   1.976587   2.501331     0.79   0.429    -2.927061    6.880235
    16 2000  |   1.279536   1.156919     1.11   0.269    -.9885053    3.547577
    16 2001  |   3.895149   2.506143     1.55   0.120    -1.017933    8.808231
    16 2002  |   3.098211   2.929157     1.06   0.290    -2.644153    8.840576
    16 2003  |   .7459875    3.22767     0.23   0.817    -5.581587    7.073562
    16 2004  |  -.6779127   3.542023    -0.19   0.848    -7.621749    6.265924
    16 2005  |  -3.147262   4.694599    -0.67   0.503    -12.35063    6.056102
    16 2006  |  -3.202129    4.27435    -0.75   0.454    -11.58163    5.177372
    16 2007  |  -1.689497   3.241951    -0.52   0.602    -8.045068    4.666074
    16 2008  |   1.773474   3.009209     0.59   0.556    -4.125827    7.672774
    16 2009  |   1.362028    3.05613     0.45   0.656    -4.629258    7.353313
    17 1997  |   -17.8472    2.38335    -7.49   0.000    -22.51956   -13.17485
    17 1998  |  -13.36033   1.279125   -10.44   0.000    -15.86795   -10.85272
    17 1999  |  -10.43627   1.208788    -8.63   0.000      -12.806   -8.066545
    17 2000  |  -8.615437   1.282242    -6.72   0.000    -11.12916   -6.101711
    17 2001  |  -6.212139   .9514642    -6.53   0.000    -8.077404   -4.346874
    17 2002  |  -6.950094   1.148122    -6.05   0.000    -9.200891   -4.699297
    17 2003  |  -5.780861   1.013662    -5.70   0.000    -7.768059   -3.793663
    17 2004  |   -6.51102   1.093119    -5.96   0.000    -8.653987   -4.368052
    17 2005  |  -6.165128     .98035    -6.29   0.000    -8.087021   -4.243234
    17 2006  |  -5.972619    1.14509    -5.22   0.000    -8.217471   -3.727766
    17 2007  |  -2.219122   .7947372    -2.79   0.005    -3.777137   -.6611068
    17 2008  |          0  (omitted)
    17 2009  |   .8667333   .7192935     1.20   0.228    -.5433808    2.276847
    21 1997  |  -20.27558   2.163054    -9.37   0.000    -24.51606   -16.03509
    21 1998  |   -13.6229   .9369657   -14.54   0.000    -15.45974   -11.78605
    21 1999  |   -14.8265   2.214417    -6.70   0.000    -19.16767   -10.48532
    21 2000  |  -10.45923   .9507582   -11.00   0.000    -12.32311   -8.595348
    21 2001  |  -5.391332   .8279801    -6.51   0.000    -7.014517   -3.768147
    21 2002  |  -2.978819   .6842625    -4.35   0.000    -4.320258   -1.637381
    21 2003  |  -1.162715   .7180828    -1.62   0.105    -2.570456    .2450258
    21 2004  |  -1.818185   .6640952    -2.74   0.006    -3.120088   -.5162826
    21 2005  |   1.241091   .5828622     2.13   0.033     .0984392    2.383743
    21 2006  |  -.7268108   .5644011    -1.29   0.198    -1.833272    .3796499
    21 2007  |          0  (omitted)
    21 2008  |    1.63912   .4474207     3.66   0.000     .7619896    2.516251
    21 2009  |   1.400804   .5773683     2.43   0.015     .2689219    2.532685
    22 1997  |  -22.44583   3.396983    -6.61   0.000    -29.10532   -15.78633
    22 1998  |  -16.98535   2.728342    -6.23   0.000    -22.33403   -11.63666
    22 1999  |  -15.65956   2.913878    -5.37   0.000    -21.37197   -9.947148
    22 2000  |  -6.641744   1.793581    -3.70   0.000    -10.15791   -3.125581
    22 2001  |  -4.561438   .7746919    -5.89   0.000    -6.080156    -3.04272
    22 2002  |   -4.11553   .9259487    -4.44   0.000    -5.930774   -2.300286
    22 2003  |  -1.485416   .5246995    -2.83   0.005    -2.514045   -.4567872
    22 2004  |  -3.777737   .5526536    -6.84   0.000    -4.861168   -2.694307
    22 2005  |  -.7328251   .4554537    -1.61   0.108    -1.625704    .1600534
    22 2006  |          0  (omitted)
    22 2007  |   .3943991   .4601908     0.86   0.391     -.507766    1.296564
    22 2008  |   1.647865   .5773775     2.85   0.004     .5159652    2.779765
    22 2009  |   1.356999   .5464193     2.48   0.013     .2857903    2.428208
    23 1997  |  -5.018796    1.99671    -2.51   0.012    -8.933177   -1.104416
    23 1998  |          0  (omitted)
    23 1999  |   3.033419   .7798372     3.89   0.000     1.504614    4.562224
    23 2000  |   2.049861   1.683054     1.22   0.223    -1.249623    5.349346
    23 2001  |   3.492329   1.999535     1.75   0.081    -.4275904    7.412249
    23 2002  |   6.307084    1.15014     5.48   0.000     4.052332    8.561837
    23 2003  |   8.200587    1.18712     6.91   0.000     5.873339    10.52784
    23 2004  |   5.536495   2.422847     2.29   0.022     .7867083    10.28628
    23 2005  |   6.127284    1.60602     3.82   0.000     2.978817     9.27575
    23 2006  |   6.842525   2.333866     2.93   0.003     2.267177    11.41787
    23 2007  |   6.016884   2.423566     2.48   0.013     1.265687    10.76808
    23 2008  |   8.055181   2.748698     2.93   0.003     2.666591    13.44377
    23 2009  |   8.627956   2.609662     3.31   0.001     3.511934    13.74398
    24 1997  |  -5.383143   2.159833    -2.49   0.013    -9.617313   -1.148973
    24 1998  |          0  (omitted)
    24 1999  |   .4111317   .7632621     0.54   0.590    -1.085179    1.907443
    24 2000  |   1.345802   1.092484     1.23   0.218    -.7959199    3.487523
    24 2001  |   1.914126   .9723936     1.97   0.049      .007831    3.820422
    24 2002  |   3.567782   1.062204     3.36   0.001     1.485421    5.650144
    24 2003  |    1.91193   .9929398     1.93   0.054    -.0346442    3.858505
    24 2004  |   2.836809   1.137643     2.49   0.013     .6065551    5.067062
    24 2005  |   3.118515   1.089678     2.86   0.004     .9822945    5.254736
    24 2006  |   1.456377   .9406218     1.55   0.122    -.3876328    3.300386
    24 2007  |   3.705216   1.050696     3.53   0.000     1.645416    5.765016
    24 2008  |   5.797312   1.016837     5.70   0.000      3.80389    7.790734
    24 2009  |   6.883617    1.32496     5.20   0.000     4.286145     9.48109
    25 1997  |  -9.953334   3.167936    -3.14   0.002     -16.1638   -3.742863
    25 1998  |  -4.531939   2.604271    -1.74   0.082    -9.637392    .5735146
    25 1999  |  -7.953562   2.777152    -2.86   0.004    -13.39793    -2.50919
    25 2000  |  -3.865108   1.523252    -2.54   0.011    -6.851314    -.878902
    25 2001  |  -2.870155   1.163917    -2.47   0.014    -5.151916   -.5883944
    25 2002  |  -1.482276   1.390037    -1.07   0.286    -4.207325    1.242774
    25 2003  |  -.3575718   .8304302    -0.43   0.667     -1.98556    1.270416
    25 2004  |   .4790039   .7936068     0.60   0.546    -1.076795    2.034803
    25 2005  |   .5805715   .6741846     0.86   0.389    -.7411104    1.902253
    25 2006  |          0  (omitted)
    25 2007  |   1.395384   .9375551     1.49   0.137    -.4426136    3.233381
    25 2008  |   3.450809   .8830363     3.91   0.000     1.719691    5.181927
    25 2009  |   3.405029   .9491284     3.59   0.000     1.544343    5.265715
    26 1997  |  -3.141137   2.145289    -1.46   0.143    -7.346794     1.06452
    26 1998  |   3.283511   .8556497     3.84   0.000     1.606082    4.960939
    26 1999  |   2.548193   .7170369     3.55   0.000     1.142503    3.953883
    26 2000  |   2.719025   .5739119     4.74   0.000     1.593919     3.84413
    26 2001  |   1.501413   .5093422     2.95   0.003     .5028902    2.499935
    26 2002  |   1.090707   .4029845     2.71   0.007     .3006905    1.880724
    26 2003  |   1.605144    .519937     3.09   0.002     .5858517    2.624437
    26 2004  |   .8426563   .5836038     1.44   0.149    -.3014497    1.986762
    26 2005  |   .5821106   .3796887     1.53   0.125     -.162237    1.326458
    26 2006  |          0  (omitted)
    26 2007  |   .8291988   .5141139     1.61   0.107    -.1786779    1.837076
    26 2008  |   .8052685   .5759271     1.40   0.162    -.3237879    1.934325
    26 2009  |   .6847192    .455667     1.50   0.133    -.2085774    1.578016
    27 1997  |  -7.655081   2.491704    -3.07   0.002    -12.53986   -2.770306
    27 1998  |   3.238656    1.41003     2.30   0.022     .4744114      6.0029
    27 1999  |   -4.04411   .8070625    -5.01   0.000    -5.626288   -2.461932
    27 2000  |   -3.83394   1.128691    -3.40   0.001    -6.046644   -1.621237
    27 2001  |  -1.091162   1.156583    -0.94   0.346    -3.358545    1.176222
    27 2002  |  -.7958059   .6005707    -1.33   0.185    -1.973174    .3815621
    27 2003  |  -2.726325   .6652175    -4.10   0.000    -4.030427   -1.422222
    27 2004  |  -2.742354   .6962766    -3.94   0.000    -4.107345   -1.377362
    27 2005  |  -2.936398   .7865823    -3.73   0.000    -4.478426    -1.39437
    27 2006  |  -2.593629   .5599421    -4.63   0.000    -3.691348    -1.49591
    27 2007  |          0  (omitted)
    27 2008  |  -1.235397   .8436128    -1.46   0.143    -2.889228    .4184348
    27 2009  |  -.1420548   .6112111    -0.23   0.816    -1.340283    1.056173
    28 1997  |          0  (omitted)
    28 1998  |   8.080826   2.133351     3.79   0.000     3.898572    12.26308
    28 1999  |   9.910599   2.207295     4.49   0.000     5.583382    14.23781
    28 2000  |   10.11189   2.613663     3.87   0.000     4.988022    15.23575
    28 2001  |   10.45032   2.594932     4.03   0.000     5.363178    15.53747
    28 2002  |   9.962426   2.688801     3.71   0.000     4.691258    15.23359
    28 2003  |   8.638095   2.880449     3.00   0.003     2.991219    14.28497
    28 2004  |   6.758863   2.586675     2.61   0.009     1.687905    11.82982
    28 2005  |   8.372494   2.679746     3.12   0.002     3.119079    13.62591
    28 2006  |   7.519306   2.649744     2.84   0.005     2.324707     12.7139
    28 2007  |   8.199049      2.807     2.92   0.004     2.696164    13.70193
    28 2008  |    9.87461   3.384245     2.92   0.004     3.240083    16.50914
    28 2009  |   11.02942   3.258581     3.38   0.001     4.641247    17.41759
    29 1997  |  -12.78921   2.765306    -4.62   0.000    -18.21036   -7.368065
    29 1998  |  -7.023495   2.124846    -3.31   0.001    -11.18908   -2.857914
    29 1999  |  -4.766509   1.522952    -3.13   0.002    -7.752128    -1.78089
    29 2000  |  -3.039479   .8772084    -3.46   0.001    -4.759172   -1.319786
    29 2001  |  -2.741259   .8585223    -3.19   0.001    -4.424319   -1.058199
    29 2002  |  -1.958293   .8365307    -2.34   0.019     -3.59824    -.318345
    29 2003  |  -1.424308   .4540808    -3.14   0.002    -2.314495   -.5341213
    29 2004  |  -2.123624   .3873526    -5.48   0.000    -2.882996   -1.364252
    29 2005  |   -.933346   .3577642    -2.61   0.009    -1.634712   -.2319795
    29 2006  |   .8567372   .4256236     2.01   0.044     .0223381    1.691136
    29 2007  |          0  (omitted)
    29 2008  |    .652033   .4775001     1.37   0.172    -.2840656    1.588132
    29 2009  |   1.373464    .463237     2.96   0.003     .4653269    2.281601
    31 1997  |  -7.478111   2.096385    -3.57   0.000     -11.5879   -3.368325
    31 1998  |  -3.289313   .8502418    -3.87   0.000     -4.95614   -1.622486
    31 1999  |  -3.521006   .8352967    -4.22   0.000    -5.158535   -1.883478
    31 2000  |  -4.926219   .5334433    -9.23   0.000    -5.971989   -3.880449
    31 2001  |  -4.315735   .4381365    -9.85   0.000    -5.174665   -3.456806
    31 2002  |   -5.10863   .4449572   -11.48   0.000    -5.980931   -4.236329
    31 2003  |  -2.015242   .3656969    -5.51   0.000     -2.73216   -1.298324
    31 2004  |  -2.670577   .3659324    -7.30   0.000    -3.387956   -1.953197
    31 2005  |  -2.089207   .2898685    -7.21   0.000    -2.657469   -1.520944
    31 2006  |          0  (omitted)
    31 2007  |  -.3903207   .2474313    -1.58   0.115    -.8753888    .0947473
    31 2008  |  -.5500497   .2887122    -1.91   0.057    -1.116046    .0159461
    31 2009  |  -.4429843   .3655751    -1.21   0.226    -1.159663    .2736949
    32 1997  |  -11.27615   2.346348    -4.81   0.000    -15.87597   -6.676338
    32 1998  |  -2.667229   1.237559    -2.16   0.031    -5.093359   -.2410982
    32 1999  |   -3.17302   1.046287    -3.03   0.002    -5.224177   -1.121863
    32 2000  |  -2.608409   1.019341    -2.56   0.011    -4.606741   -.6100767
    32 2001  |  -3.218985   .9568303    -3.36   0.001     -5.09477     -1.3432
    32 2002  |  -4.435859   .8393429    -5.28   0.000     -6.08132   -2.790398
    32 2003  |  -2.538495   .7387916    -3.44   0.001    -3.986834   -1.090157
    32 2004  |  -3.918544   .7014139    -5.59   0.000    -5.293607   -2.543482
    32 2005  |  -3.093745   .7122901    -4.34   0.000     -4.49013   -1.697361
    32 2006  |  -1.274675   .7473009    -1.71   0.088    -2.739695    .1903456
    32 2007  |  -1.037104   .5737067    -1.81   0.071    -2.161807    .0875998
    32 2008  |    .800869   .6352727     1.26   0.207    -.4445295    2.046267
    32 2009  |          0  (omitted)
    33 1997  |  -.8942117    2.24347    -0.40   0.690    -5.292345    3.503922
    33 1998  |    4.15043   1.323446     3.14   0.002     1.555925    6.744934
    33 1999  |   1.819271   .6613813     2.75   0.006     .5226892    3.115853
    33 2000  |   .2526351   .5714336     0.44   0.658    -.8676121    1.372882
    33 2001  |   1.221384   .3164264     3.86   0.000     .6010573    1.841712
    33 2002  |   2.104676   .4043492     5.21   0.000     1.311983    2.897368
    33 2003  |    1.68319   .2519661     6.68   0.000     1.189232    2.177149
    33 2004  |   .5362753   .2419441     2.22   0.027     .0619642    1.010586
    33 2005  |          0  (omitted)
    33 2006  |   1.302355   .4127581     3.16   0.002     .4931781    2.111533
    33 2007  |   2.004007    .412204     4.86   0.000     1.195916    2.812098
    33 2008  |   2.466598   .3839242     6.42   0.000     1.713947    3.219249
    33 2009  |   2.466709   .5547379     4.45   0.000     1.379192    3.554226
    35 1997  |  -1.650893    2.01225    -0.82   0.412    -5.595739    2.293954
    35 1998  |   1.400611   .4132431     3.39   0.001     .5904832     2.21074
    35 1999  |   1.596068     .45446     3.51   0.000     .7051372    2.486998
    35 2000  |   1.208764   .2034882     5.94   0.000     .8098428    1.607686
    35 2001  |   .0986271   .1543705     0.64   0.523    -.2040032    .4012574
    35 2002  |          0  (omitted)
    35 2003  |  -.0467956   .1820817    -0.26   0.797    -.4037513      .31016
    35 2004  |  -1.074656   .2114388    -5.08   0.000    -1.489164    -.660148
    35 2005  |   -1.60373   .3291272    -4.87   0.000    -2.248956   -.9585043
    35 2006  |  -.4374604   .3219055    -1.36   0.174    -1.068529    .1936082
    35 2007  |  -.0711665   .2987228    -0.24   0.812    -.6567874    .5144544
    35 2008  |   .6974416   .4273465     1.63   0.103    -.1403351    1.535218
    35 2009  |   1.479489   .4334206     3.41   0.001     .6298041    2.329173
    41 1997  |  -3.875011   1.979848    -1.96   0.050    -7.756335    .0063127
    41 1998  |   1.698292   .3478414     4.88   0.000     1.016378    2.380206
    41 1999  |          0  (omitted)
    41 2000  |   1.418215   .3234259     4.38   0.000     .7841657    2.052264
    41 2001  |   .5114363   .3897386     1.31   0.189    -.2526133    1.275486
    41 2002  |   1.494134   .4364603     3.42   0.001     .6384908    2.349778
    41 2003  |   1.834428   .4189237     4.38   0.000     1.013163    2.655692
    41 2004  |   2.450581   .5708163     4.29   0.000     1.331544    3.569618
    41 2005  |   2.526846   .6185775     4.08   0.000     1.314177    3.739515
    41 2006  |   3.896121   .6370133     6.12   0.000      2.64731    5.144931
    41 2007  |   3.870636   .6776183     5.71   0.000     2.542223     5.19905
    41 2008  |   4.718124   .6488064     7.27   0.000     3.446194    5.990054
    41 2009  |   4.898919   1.280564     3.83   0.000     2.388481    7.409357
    42 1997  |  -3.235309   1.977799    -1.64   0.102    -7.112615    .6419983
    42 1998  |   .8875198   .5647369     1.57   0.116    -.2195991    1.994639
    42 1999  |  -.5343105   .4411741    -1.21   0.226    -1.399195     .330574
    42 2000  |   .1259939   .4358915     0.29   0.773    -.7285345    .9805224
    42 2001  |   .1114014    .378883     0.29   0.769    -.6313666    .8541695
    42 2002  |          0  (omitted)
    42 2003  |   .6744527   .4329297     1.56   0.119    -.1742693    1.523175
    42 2004  |   .3516687   .3993774     0.88   0.379    -.4312768    1.134614
    42 2005  |   .7063443   .4477318     1.58   0.115     -.171396    1.584085
    42 2006  |   .9296305   .5106873     1.82   0.069    -.0715286     1.93079
    42 2007  |   2.476038   .4513908     5.49   0.000     1.591124    3.360951
    42 2008  |    1.95121   .5134084     3.80   0.000     .9447159    2.957704
    42 2009  |   3.742575   .6024142     6.21   0.000     2.561593    4.923557
    43 1997  |  -9.101207   2.003411    -4.54   0.000    -13.02873    -5.17369
    43 1998  |  -1.281433   .5933314    -2.16   0.031    -2.444609   -.1182567
    43 1999  |   -4.17342   .5400592    -7.73   0.000     -5.23216   -3.114679
    43 2000  |  -3.079027   .3777452    -8.15   0.000    -3.819564   -2.338489
    43 2001  |  -2.404085   .3765906    -6.38   0.000    -3.142359   -1.665811
    43 2002  |  -2.951391   .4067085    -7.26   0.000    -3.748708   -2.154073
    43 2003  |  -1.965193   .3553582    -5.53   0.000    -2.661843   -1.268543
    43 2004  |  -2.466762   .3315122    -7.44   0.000    -3.116663    -1.81686
    43 2005  |  -1.845723   .3734362    -4.94   0.000    -2.577813   -1.113633
    43 2006  |  -1.271419    .383555    -3.31   0.001    -2.023346   -.5194917
    43 2007  |   .3925564   .3867568     1.01   0.310    -.3656477     1.15076
    43 2008  |          0  (omitted)
    43 2009  |   1.273027   .3004222     4.24   0.000     .6840748    1.861979
    50 1997  |  -2.862027   2.031906    -1.41   0.159    -6.845406    1.121352
    50 1998  |   .4038615   1.052276     0.38   0.701    -1.659037     2.46676
    50 1999  |   2.221448   .7443335     2.98   0.003      .762245    3.680651
    50 2000  |   .5162054   .6867082     0.75   0.452     -.830028    1.862439
    50 2001  |   .5256987   .4940546     1.06   0.287    -.4428536    1.494251
    50 2002  |          0  (omitted)
    50 2003  |   3.351283   .8372693     4.00   0.000     1.709887    4.992678
    50 2004  |   2.823334   1.156673     2.44   0.015     .5557743    5.090893
    50 2005  |   3.477687   .8398337     4.14   0.000     1.831264    5.124109
    50 2006  |   4.664651   1.076013     4.34   0.000     2.555219    6.774083
    50 2007  |   5.587968    .596739     9.36   0.000     4.418112    6.757825
    50 2008  |    5.41367   .6851577     7.90   0.000     4.070476    6.756864
    50 2009  |   5.976868   .5702429    10.48   0.000     4.858955    7.094781
    51 1997  |          0  (omitted)
    51 1998  |   7.557392   1.973627     3.83   0.000     3.688264    11.42652
    51 1999  |   9.272639   2.070521     4.48   0.000     5.213557    13.33172
    51 2000  |   11.77042   2.290448     5.14   0.000     7.280192    16.26065
    51 2001  |   11.37994   2.213063     5.14   0.000     7.041412    15.71846
    51 2002  |    11.7241   2.461965     4.76   0.000      6.89763    16.55058
    51 2003  |   12.21389   2.564548     4.76   0.000      7.18631    17.24147
    51 2004  |   12.42697   2.482092     5.01   0.000     7.561041     17.2929
    51 2005  |   13.20115   2.667243     4.95   0.000     7.972247    18.43005
    51 2006  |   13.31308   2.947098     4.52   0.000     7.535539    19.09061
    51 2007  |    11.8926   2.666674     4.46   0.000     6.664809    17.12039
    51 2008  |   14.60544   2.446963     5.97   0.000     9.808374     19.4025
    51 2009  |   14.99236   2.530119     5.93   0.000     10.03227    19.95244
    52 1997  |          0  (omitted)
    52 1998  |   3.294874   2.125387     1.55   0.121    -.8717681    7.461515
    52 1999  |   4.457689   2.149379     2.07   0.038     .2440129    8.671364
    52 2000  |   4.030579   2.241712     1.80   0.072    -.3641073    8.425265
    52 2001  |    4.64177   2.228893     2.08   0.037     .2722136    9.011326
    52 2002  |   6.171035   2.187941     2.82   0.005     1.881762    10.46031
    52 2003  |   6.423427     2.1919     2.93   0.003     2.126392    10.72046
    52 2004  |   7.274346   2.276159     3.20   0.001      2.81213    11.73656
    52 2005  |   6.989045    2.21905     3.15   0.002     2.638784    11.33931
    52 2006  |   7.251614   2.346314     3.09   0.002     2.651863    11.85137
    52 2007  |   7.947792   2.301147     3.45   0.001     3.436589      12.459
    52 2008  |   10.16839    2.38537     4.26   0.000     5.492071     14.8447
    52 2009  |   10.02401   2.508561     4.00   0.000     5.106189    14.94183
    53 1997  |  -3.561766   1.904623    -1.87   0.062    -7.295618    .1720856
    53 1998  |          0  (omitted)
    53 1999  |          0  (omitted)
    53 2000  |          0  (omitted)
    53 2001  |          0  (omitted)
    53 2002  |          0  (omitted)
    53 2003  |          0  (omitted)
    53 2004  |          0  (omitted)
    53 2005  |          0  (omitted)
    53 2006  |          0  (omitted)
    53 2007  |          0  (omitted)
    53 2008  |          0  (omitted)
    53 2009  |          0  (omitted)
             |
       _cons |   45.43168   .2882816   157.59   0.000     44.86653    45.99683
-------------+----------------------------------------------------------------
  fips_month |   absorbed                                   (63084 categories)

. 
. timer off 1

. timer list 1
   1:    496.56 /        1 =     496.5630

. 
. local holder

. lincom tavg_bin_ 0C_10C_ 

 ( 1)  tavg_bin_0C_10C_ = 0

------------------------------------------------------------------------------
   mrate_tot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6876847   .0413002    16.65   0.000     .6067192    .7686503
------------------------------------------------------------------------------

. local reg_c_010_cont = r(estimate)

. local reg_se_010_cont = r(se)

. local reg_se_010_left = `reg_c_010_cont' - 1.96 * `reg_se_010_cont'

. local reg_se_010_right = `reg_c_010_cont'+ 1.96 * `reg_se_010_cont'

. local holder "`holder' `reg_c_010_cont' , `reg_se_010_cont' , `reg_se_010_lef
> t' , `reg_se_010_right'  "

. di "`holder'"
 .6876847282426068 , .0413002102731099 , .6067363161073115 , .7686331403779022 
>  

. 
. local bins 10C_13C_ 13C_16C_ 16C_19C_ 19C_22C_ 

. foreach i of local bins{
  2. lincom tavg_bin_`i' 
  3. local reg_c_010_cont = r(estimate)
  4. local reg_se_010_cont = r(se)
  5. local reg_se_010_left = `reg_c_010_cont' - 1.96 * `reg_se_010_cont'
  6. local reg_se_010_right = `reg_c_010_cont'+ 1.96 * `reg_se_010_cont'
  7. local holder "`holder' \  `reg_c_010_cont' , `reg_se_010_cont' , `reg_se_0
> 10_left' , `reg_se_010_right'"
  8. di "`holder'"
  9. }

 ( 1)  tavg_bin_10C_13C_ = 0

------------------------------------------------------------------------------
   mrate_tot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .4797729   .0268062    17.90   0.000     .4272216    .5323242
------------------------------------------------------------------------------
 .6876847282426068 , .0413002102731099 , .6067363161073115 , .7686331403779022 
>   \  .4797729297891425 , .0268062001087311 , .4272327775760295 , .53231308200
> 22555

 ( 1)  tavg_bin_13C_16C_ = 0

------------------------------------------------------------------------------
   mrate_tot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .2057181   .0191719    10.73   0.000     .1681333     .243303
------------------------------------------------------------------------------
 .6876847282426068 , .0413002102731099 , .6067363161073115 , .7686331403779022 
>   \  .4797729297891425 , .0268062001087311 , .4272327775760295 , .53231308200
> 22555 \  .2057181479354918 , .0191718608936929 , .1681413005838537 , .2432949
> 952871299

 ( 1)  tavg_bin_16C_19C_ = 0

------------------------------------------------------------------------------
   mrate_tot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1313363   .0122549    10.72   0.000     .1073116     .155361
------------------------------------------------------------------------------
 .6876847282426068 , .0413002102731099 , .6067363161073115 , .7686331403779022 
>   \  .4797729297891425 , .0268062001087311 , .4272327775760295 , .53231308200
> 22555 \  .2057181479354918 , .0191718608936929 , .1681413005838537 , .2432949
> 952871299 \  .1313362842153272 , .0122548987706367 , .1073166826248793 , .155
> 3558858057751

 ( 1)  tavg_bin_19C_22C_ = 0

------------------------------------------------------------------------------
   mrate_tot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0019285   .0088694     0.22   0.828    -.0154593    .0193163
------------------------------------------------------------------------------
 .6876847282426068 , .0413002102731099 , .6067363161073115 , .7686331403779022 
>   \  .4797729297891425 , .0268062001087311 , .4272327775760295 , .53231308200
> 22555 \  .2057181479354918 , .0191718608936929 , .1681413005838537 , .2432949
> 952871299 \  .1313362842153272 , .0122548987706367 , .1073166826248793 , .155
> 3558858057751 \  .0019285026946308 , .0088694317468338 , -.0154555835291634 ,
>  .019312588918425

. local holder "`holder' \  0 , 0 , 0 , 0 "

. 
. local bins 25C_28C_ 28C_31C_ 31C_Inf_ 

. foreach i of local bins{
  2. lincom tavg_bin_`i' 
  3. local reg_c_010_cont = r(estimate)
  4. local reg_se_010_cont = r(se)
  5. local reg_se_010_left = `reg_c_010_cont' - 1.96 * `reg_se_010_cont'
  6. local reg_se_010_right = `reg_c_010_cont'+ 1.96 * `reg_se_010_cont'
  7. local holder "`holder' \  `reg_c_010_cont' , `reg_se_010_cont' , `reg_se_0
> 10_left' , `reg_se_010_right'"
  8. di "`holder'"
  9. }

 ( 1)  tavg_bin_25C_28C_ = 0

------------------------------------------------------------------------------
   mrate_tot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0317175   .0064058     4.95   0.000     .0191595    .0442755
------------------------------------------------------------------------------
 .6876847282426068 , .0413002102731099 , .6067363161073115 , .7686331403779022 
>   \  .4797729297891425 , .0268062001087311 , .4272327775760295 , .53231308200
> 22555 \  .2057181479354918 , .0191718608936929 , .1681413005838537 , .2432949
> 952871299 \  .1313362842153272 , .0122548987706367 , .1073166826248793 , .155
> 3558858057751 \  .0019285026946308 , .0088694317468338 , -.0154555835291634 ,
>  .019312588918425 \  0 , 0 , 0 , 0  \  .0317175277998533 , .0064057828203072 
> , .0191621934720512 , .0442728621276554

 ( 1)  tavg_bin_28C_31C_ = 0

------------------------------------------------------------------------------
   mrate_tot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0923263   .0138579     6.66   0.000     .0651591    .1194935
------------------------------------------------------------------------------
 .6876847282426068 , .0413002102731099 , .6067363161073115 , .7686331403779022 
>   \  .4797729297891425 , .0268062001087311 , .4272327775760295 , .53231308200
> 22555 \  .2057181479354918 , .0191718608936929 , .1681413005838537 , .2432949
> 952871299 \  .1313362842153272 , .0122548987706367 , .1073166826248793 , .155
> 3558858057751 \  .0019285026946308 , .0088694317468338 , -.0154555835291634 ,
>  .019312588918425 \  0 , 0 , 0 , 0  \  .0317175277998533 , .0064057828203072 
> , .0191621934720512 , .0442728621276554 \  .09232629362663 , .013857886079504
> 2 , .0651648369108018 , .1194877503424582

 ( 1)  tavg_bin_31C_Inf_ = 0

------------------------------------------------------------------------------
   mrate_tot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5950902   .1426942     4.17   0.000     .3153504      .87483
------------------------------------------------------------------------------
 .6876847282426068 , .0413002102731099 , .6067363161073115 , .7686331403779022 
>   \  .4797729297891425 , .0268062001087311 , .4272327775760295 , .53231308200
> 22555 \  .2057181479354918 , .0191718608936929 , .1681413005838537 , .2432949
> 952871299 \  .1313362842153272 , .0122548987706367 , .1073166826248793 , .155
> 3558858057751 \  .0019285026946308 , .0088694317468338 , -.0154555835291634 ,
>  .019312588918425 \  0 , 0 , 0 , 0  \  .0317175277998533 , .0064057828203072 
> , .0191621934720512 , .0442728621276554 \  .09232629362663 , .013857886079504
> 2 , .0651648369108018 , .1194877503424582 \  .5950902258643048 , .14269415379
> 36431 , .3154096844287643 , .8747707672998453

. 
. *drop b1 b2 b3 b4
. matrix b = (`holder')

. matrix list b

b[9,4]
            c1          c2          c3          c4
r1   .68768473   .04130021   .60673632   .76863314
r2   .47977293    .0268062   .42723278   .53231308
r3   .20571815   .01917186    .1681413     .243295
r4   .13133628    .0122549   .10731668   .15535589
r5    .0019285   .00886943  -.01545558   .01931259
r6           0           0           0           0
r7   .03171753   .00640578   .01916219   .04427286
r8   .09232629   .01385789   .06516484   .11948775
r9   .59509023   .14269415   .31540968   .87477077

. 
. ************
. ** 1-lag ***
. ************
. areg mrate_tot `three' `three_l1' `precip'  i.month#i.year i.state_fips#i.yea
> r [aw=pop_tot_weights], absorb(fips_month) vce(cluster fips)
(sum of wgt is   1.5231e+02)
note: 1.month#1997.year identifies no observations in the sample
note: 12.month#2009.year omitted because of collinearity
note: 53.state_fips#1998.year omitted because of collinearity
note: 53.state_fips#1999.year omitted because of collinearity
note: 53.state_fips#2000.year omitted because of collinearity
note: 53.state_fips#2001.year omitted because of collinearity
note: 53.state_fips#2002.year omitted because of collinearity
note: 53.state_fips#2003.year omitted because of collinearity
note: 53.state_fips#2004.year omitted because of collinearity
note: 53.state_fips#2005.year omitted because of collinearity
note: 53.state_fips#2006.year omitted because of collinearity
note: 53.state_fips#2007.year omitted because of collinearity
note: 53.state_fips#2008.year omitted because of collinearity
note: 53.state_fips#2009.year omitted because of collinearity
note: 1b.month#2003.year omitted because of collinearity
note: 2.month#2003.year omitted because of collinearity
note: 3.month#1997b.year omitted because of collinearity
note: 4.month#2001.year omitted because of collinearity
note: 5.month#2006.year omitted because of collinearity
note: 6.month#2009.year omitted because of collinearity
note: 7.month#2009.year omitted because of collinearity
note: 8.month#2006.year omitted because of collinearity
note: 9.month#2002.year omitted because of collinearity
note: 10.month#2002.year omitted because of collinearity
note: 11.month#1998.year omitted because of collinearity
note: 12.state_fips#1997b.year omitted because of collinearity
note: 13.state_fips#1997b.year omitted because of collinearity
note: 14.state_fips#1997b.year omitted because of collinearity
note: 14.state_fips#1998.year omitted because of collinearity
note: 15.state_fips#2001.year omitted because of collinearity
note: 16.state_fips#1997b.year omitted because of collinearity
note: 17.state_fips#1997b.year omitted because of collinearity
note: 21.state_fips#1997b.year omitted because of collinearity
note: 22.state_fips#2006.year omitted because of collinearity
note: 23.state_fips#1997b.year omitted because of collinearity
note: 24.state_fips#2004.year omitted because of collinearity
note: 25.state_fips#2005.year omitted because of collinearity
note: 26.state_fips#2006.year omitted because of collinearity
note: 27.state_fips#2006.year omitted because of collinearity
note: 28.state_fips#1997b.year omitted because of collinearity
note: 29.state_fips#1997b.year omitted because of collinearity
note: 31.state_fips#1997b.year omitted because of collinearity
note: 32.state_fips#2009.year omitted because of collinearity
note: 33.state_fips#1997b.year omitted because of collinearity
note: 35.state_fips#1999.year omitted because of collinearity
note: 41.state_fips#2008.year omitted because of collinearity
note: 42.state_fips#1999.year omitted because of collinearity
note: 43.state_fips#2007.year omitted because of collinearity
note: 50.state_fips#1999.year omitted because of collinearity
note: 51.state_fips#2000.year omitted because of collinearity
note: 52.state_fips#1998.year omitted because of collinearity

Linear regression, absorbing indicators         Number of obs     =    814,763
                                                F( 463,   5256)   =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5213
                                                Adj R-squared     =     0.4808
                                                Root MSE          =    12.9536

                               (Std. Err. adjusted for 5,257 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
   mrate_tot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
tavg~0C_10C_ |   .7333519   .0422441    17.36   0.000      .650536    .8161679
tav~10C_13C_ |   .4639434   .0267874    17.32   0.000     .4114289    .5164578
tavg~3C_16C_ |   .2014986     .01863    10.82   0.000     .1649761    .2380212
tavg~6C_19C_ |   .1280042   .0120136    10.65   0.000     .1044526    .1515558
tavg~9C_22C_ |    .000206   .0088828     0.02   0.982     -.017208      .01762
tavg~5C_28C_ |   .0368126   .0062546     5.89   0.000      .024551    .0490742
tavg~8C_31C_ |   .1249234   .0120892    10.33   0.000     .1012236    .1486233
tavg~1C_Inf_ |   .6138883   .1399664     4.39   0.000     .3394961    .8882806
l1_tavg_~0C_ |   .2573029   .0405285     6.35   0.000     .1778503    .3367556
l1_~10C_13C_ |   .1959325   .0261206     7.50   0.000     .1447253    .2471397
l1_tavg_~6C_ |   .1385935   .0181163     7.65   0.000     .1030781     .174109
l1_tavg_~9C_ |    .046533   .0123968     3.75   0.000     .0222302    .0708359
l1_tavg_~2C_ |   .0089989   .0080024     1.12   0.261    -.0066891    .0246869
l1_tavg_~8C_ |  -.0297495   .0065743    -4.53   0.000    -.0426379    -.016861
l1_tavg_~1C_ |  -.1087157   .0117262    -9.27   0.000     -.131704   -.0857275
l1_t~1C_Inf_ |   .0553343   .1205341     0.46   0.646    -.1809626    .2916313
     precip_ |    .002688   .0009725     2.76   0.006     .0007816    .0045944
   precip_sq |  -5.39e-06   2.15e-06    -2.51   0.012    -9.60e-06   -1.18e-06
             |
  month#year |
     1 1997  |          0  (empty)
     1 1998  |   2.184518   .3701615     5.90   0.000     1.458847    2.910188
     1 1999  |   2.946689   .3241016     9.09   0.000     2.311315    3.582063
     1 2000  |   1.059976   .3177138     3.34   0.001     .4371253    1.682827
     1 2001  |   .9128365   .2591645     3.52   0.000     .4047664    1.420907
     1 2002  |   2.471181   .3534023     6.99   0.000     1.778366    3.163996
     1 2003  |          0  (omitted)
     1 2004  |   .4583499   .3088373     1.48   0.138    -.1470996    1.063799
     1 2005  |  -.4515914   .2811424    -1.61   0.108    -1.002747    .0995646
     1 2006  |   -.914752   .2631891    -3.48   0.001    -1.430712    -.398792
     1 2007  |  -1.947624   .2579929    -7.55   0.000    -2.453398   -1.441851
     1 2008  |  -1.371897    .320531    -4.28   0.000    -2.000271   -.7435229
     1 2009  |  -1.517658   .2530286    -6.00   0.000    -2.013699   -1.021617
     2 1997  |   -1.98772   1.096702    -1.81   0.070    -4.137711    .1622711
     2 1998  |   1.206233   .4102647     2.94   0.003     .4019441    2.010523
     2 1999  |   .6906666   .3449008     2.00   0.045     .0145177    1.366816
     2 2000  |   .5539219   .3340838     1.66   0.097    -.1010212    1.208865
     2 2001  |  -.9396086   .3552954    -2.64   0.008    -1.636135   -.2430822
     2 2002  |   1.009893   .3979619     2.54   0.011     .2297219    1.790063
     2 2003  |          0  (omitted)
     2 2004  |   2.316168   .3449564     6.71   0.000     1.639911    2.992426
     2 2005  |  -1.003906   .3073587    -3.27   0.001    -1.606457   -.4013556
     2 2006  |  -3.374195   .3391203    -9.95   0.000    -4.039011   -2.709378
     2 2007  |  -2.449792   .3377717    -7.25   0.000    -3.111965   -1.787619
     2 2008  |  -1.151083    .347549    -3.31   0.001    -1.832423   -.4697426
     2 2009  |   -2.69743    .338578    -7.97   0.000    -3.361183   -2.033676
     3 1997  |          0  (omitted)
     3 1998  |   3.031682   1.125077     2.69   0.007     .8260631    5.237301
     3 1999  |   4.001783   1.103489     3.63   0.000     1.838486    6.165079
     3 2000  |   1.278109   1.072886     1.19   0.234    -.8251937    3.381412
     3 2001  |   .7821713   1.055528     0.74   0.459    -1.287101    2.851444
     3 2002  |   3.984575   1.111947     3.58   0.000     1.804697    6.164453
     3 2003  |   1.835076    1.04181     1.76   0.078    -.2073053    3.877457
     3 2004  |   4.990466   1.064698     4.69   0.000     2.903216    7.077715
     3 2005  |   1.275889   1.073697     1.19   0.235    -.8290038    3.380781
     3 2006  |  -.9653325    1.05899    -0.91   0.362    -3.041393    1.110728
     3 2007  |   .3487279   1.054814     0.33   0.741    -1.719146    2.416602
     3 2008  |   .0352762   1.048335     0.03   0.973    -2.019895    2.090448
     3 2009  |   .9810362   1.057114     0.93   0.353    -1.091347    3.053419
     4 1997  |  -1.012475    1.05958    -0.96   0.339    -3.089691    1.064741
     4 1998  |    1.48154   .3082178     4.81   0.000     .8773054    2.085775
     4 1999  |   2.665635   .3067176     8.69   0.000     2.064341    3.266929
     4 2000  |   .5694345   .2657054     2.14   0.032     .0485416    1.090327
     4 2001  |          0  (omitted)
     4 2002  |   .4046599   .2626838     1.54   0.124    -.1103095    .9196293
     4 2003  |   1.027896   .3225479     3.19   0.001     .3955683    1.660224
     4 2004  |   2.084801   .2479769     8.41   0.000     1.598663    2.570939
     4 2005  |  -.8919968   .2697756    -3.31   0.001    -1.420869   -.3631245
     4 2006  |  -1.215706   .3173405    -3.83   0.000    -1.837825    -.593587
     4 2007  |  -1.040687   .3122956    -3.33   0.001    -1.652916   -.4284579
     4 2008  |  -.8130895   .2330279    -3.49   0.000    -1.269921    -.356258
     4 2009  |  -.7805839   .2704566    -2.89   0.004    -1.310791   -.2503767
     5 1997  |  -2.497793   1.073714    -2.33   0.020    -4.602719    -.392867
     5 1998  |   1.713265   .3524515     4.86   0.000     1.022314    2.404216
     5 1999  |   2.192107   .2705158     8.10   0.000     1.661784    2.722431
     5 2000  |  -.2662958   .3432035    -0.78   0.438    -.9391173    .4065257
     5 2001  |  -.7919434   .2831788    -2.80   0.005    -1.347091   -.2367954
     5 2002  |  -1.748861   .4022987    -4.35   0.000    -2.537534   -.9601887
     5 2003  |  -.5407996   .2946235    -1.84   0.066    -1.118384    .0367848
     5 2004  |   .0453816   .3657584     0.12   0.901    -.6716569    .7624201
     5 2005  |  -.6175051   .2897388    -2.13   0.033    -1.185514   -.0494966
     5 2006  |          0  (omitted)
     5 2007  |  -1.864316   .3264707    -5.71   0.000    -2.504334   -1.224297
     5 2008  |  -1.346906   .3323169    -4.05   0.000    -1.998385   -.6954265
     5 2009  |  -1.195671   .3713044    -3.22   0.001    -1.923582   -.4677598
     6 1997  |   3.225268   1.140264     2.83   0.005     .9898772     5.46066
     6 1998  |   7.404976   .4224714    17.53   0.000     6.576757    8.233196
     6 1999  |   3.960643   .3335531    11.87   0.000      3.30674    4.614545
     6 2000  |   1.598605    .333701     4.79   0.000     .9444127    2.252798
     6 2001  |   .3265268   .2598316     1.26   0.209    -.1828511    .8359047
     6 2002  |   1.308302    .269142     4.86   0.000     .7806722    1.835932
     6 2003  |   1.564037   .2640094     5.92   0.000     1.046469    2.081605
     6 2004  |   3.093302   .2666278    11.60   0.000     2.570601    3.616004
     6 2005  |   .5962195   .2493766     2.39   0.017     .1073378    1.085101
     6 2006  |   1.101747   .2789216     3.95   0.000     .5549453     1.64855
     6 2007  |   1.810109   .2849235     6.35   0.000      1.25154    2.368677
     6 2008  |  -.1440665   .2591303    -0.56   0.578    -.6520695    .3639366
     6 2009  |          0  (omitted)
     7 1997  |   .8397232   1.093094     0.77   0.442    -1.303194    2.982641
     7 1998  |   5.375647   .5034307    10.68   0.000     4.388713     6.36258
     7 1999  |   2.196126   .4890122     4.49   0.000     1.237459    3.154793
     7 2000  |   1.174097   .4218982     2.78   0.005     .3470014    2.001193
     7 2001  |   1.484342   .2731339     5.43   0.000     .9488862    2.019798
     7 2002  |   1.511339   .3350305     4.51   0.000     .8545401    2.168138
     7 2003  |   2.315598   .3127122     7.40   0.000     1.702552    2.928643
     7 2004  |    .285714   .3012928     0.95   0.343    -.3049451     .876373
     7 2005  |    .777473   .3462154     2.25   0.025     .0987469    1.456199
     7 2006  |   .8483874   .3153153     2.69   0.007     .2302386    1.466536
     7 2007  |  -.4802288   .3490549    -1.38   0.169    -1.164521    .2040637
     7 2008  |   .0507247   .3515325     0.14   0.885    -.6384249    .7398744
     7 2009  |          0  (omitted)
     8 1997  |   1.177399   1.063583     1.11   0.268    -.9076658    3.262465
     8 1998  |   2.374387   .2938644     8.08   0.000     1.798291    2.950483
     8 1999  |   2.212389    .278676     7.94   0.000     1.666068     2.75871
     8 2000  |   1.891795   .3261758     5.80   0.000     1.252355    2.531235
     8 2001  |   2.228044   .2959039     7.53   0.000     1.647949    2.808139
     8 2002  |   1.534439   .2567348     5.98   0.000     1.031133    2.037746
     8 2003  |   .5051405   .2795911     1.81   0.071    -.0429741    1.053255
     8 2004  |   2.281171   .2798548     8.15   0.000     1.732539    2.829803
     8 2005  |   .2259792   .3155944     0.72   0.474    -.3927169    .8446753
     8 2006  |          0  (omitted)
     8 2007  |   .3505933   .2773792     1.26   0.206    -.1931852    .8943718
     8 2008  |   -.099573   .2443468    -0.41   0.684    -.5785942    .3794481
     8 2009  |     1.9922   .2365788     8.42   0.000     1.528407    2.455993
     9 1997  |  -2.849594   1.078647    -2.64   0.008     -4.96419   -.7349985
     9 1998  |  -1.091655   .2890743    -3.78   0.000    -1.658361   -.5249497
     9 1999  |  -1.537468   .2992133    -5.14   0.000     -2.12405   -.9508855
     9 2000  |   -1.41074   .3257823    -4.33   0.000    -2.049408   -.7720712
     9 2001  |   -.514459   .2944045    -1.75   0.081    -1.091614    .0626962
     9 2002  |          0  (omitted)
     9 2003  |  -.7765184   .3439081    -2.26   0.024    -1.450721   -.1023157
     9 2004  |  -.3514704    .275974    -1.27   0.203     -.892494    .1895533
     9 2005  |  -3.325631    .272548   -12.20   0.000    -3.859938   -2.791324
     9 2006  |  -2.678359   .2674395   -10.01   0.000    -3.202652   -2.154066
     9 2007  |  -2.593246   .3024603    -8.57   0.000    -3.186194   -2.000299
     9 2008  |  -2.535878   .3374923    -7.51   0.000    -3.197503   -1.874253
     9 2009  |  -2.173347   .3058866    -7.11   0.000    -2.773012   -1.573682
    10 1997  |  -3.037902   1.056717    -2.87   0.004    -5.109506    -.966297
    10 1998  |  -1.359343   .2682206    -5.07   0.000    -1.885167   -.8335196
    10 1999  |  -1.712483   .3114938    -5.50   0.000     -2.32314   -1.101826
    10 2000  |  -1.145332   .2724693    -4.20   0.000    -1.679485    -.611179
    10 2001  |  -.3389989   .3031081    -1.12   0.263    -.9332167     .255219
    10 2002  |          0  (omitted)
    10 2003  |  -1.769609   .2722133    -6.50   0.000     -2.30326   -1.235958
    10 2004  |  -.9864042   .3126274    -3.16   0.002    -1.599284   -.3735247
    10 2005  |   -2.38973   .2839803    -8.42   0.000    -2.946449    -1.83301
    10 2006  |  -3.776507   .3098342   -12.19   0.000     -4.38391   -3.169103
    10 2007  |  -2.579134   .2613476    -9.87   0.000    -3.091484   -2.066784
    10 2008  |  -1.434814   .2643646    -5.43   0.000    -1.953078   -.9165494
    10 2009  |  -2.146002   .2771523    -7.74   0.000    -2.689335   -1.602668
    11 1997  |  -2.651459    1.05964    -2.50   0.012    -4.728794    -.574124
    11 1998  |          0  (omitted)
    11 1999  |  -1.434881   .2759843    -5.20   0.000    -1.975925   -.8938373
    11 2000  |  -1.925446      .2573    -7.48   0.000    -2.429861   -1.421031
    11 2001  |   -.369971   .2451094    -1.51   0.131    -.8504872    .1105453
    11 2002  |  -1.007184   .2945745    -3.42   0.001    -1.584673   -.4296959
    11 2003  |  -1.647084   .2560957    -6.43   0.000    -2.149138    -1.14503
    11 2004  |  -1.909848   .2711435    -7.04   0.000    -2.441402   -1.378294
    11 2005  |  -2.505709   .2466106   -10.16   0.000    -2.989168    -2.02225
    11 2006  |  -2.981024   .2464585   -12.10   0.000    -3.464185   -2.497863
    11 2007  |  -2.829849   .2400881   -11.79   0.000    -3.300521   -2.359176
    11 2008  |  -2.125851   .2564374    -8.29   0.000    -2.628575   -1.623127
    11 2009  |  -.6709018   .3024686    -2.22   0.027    -1.263866   -.0779377
    12 1997  |  -.1553871   1.177788    -0.13   0.895    -2.464342    2.153567
    12 1998  |  -.0851371   .2811111    -0.30   0.762    -.6362316    .4659575
    12 1999  |  -2.030276   .2986997    -6.80   0.000    -2.615852   -1.444701
    12 2000  |  -.7834057   .2986386    -2.62   0.009    -1.368861   -.1979501
    12 2001  |     .31331   .2680121     1.17   0.242    -.2121051    .8387251
    12 2002  |  -.5901606   .3175264    -1.86   0.063    -1.212644    .0323231
    12 2003  |   -1.66465   .2479072    -6.71   0.000    -2.150651   -1.178649
    12 2004  |  -1.700086   .2867718    -5.93   0.000    -2.262277   -1.137894
    12 2005  |  -2.290238    .243555    -9.40   0.000    -2.767707   -1.812769
    12 2006  |  -2.162999   .2389996    -9.05   0.000    -2.631537    -1.69446
    12 2007  |  -1.070351   .2759993    -3.88   0.000    -1.611424   -.5292775
    12 2008  |  -1.344293   .2442017    -5.50   0.000    -1.823029   -.8655558
    12 2009  |          0  (omitted)
             |
  state_fips#|
        year |
    11 1998  |  -.5942904   1.413061    -0.42   0.674    -3.364477    2.175896
    11 1999  |   1.010649   3.047509     0.33   0.740    -4.963734    6.985033
    11 2000  |   1.937915   3.958721     0.49   0.624    -5.822823    9.698652
    11 2001  |   3.613096   3.285633     1.10   0.272     -2.82811     10.0543
    11 2002  |   2.817458   3.665695     0.77   0.442    -4.368828    10.00374
    11 2003  |   4.433476   2.928462     1.51   0.130    -1.307527    10.17448
    11 2004  |   2.858185   3.064318     0.93   0.351    -3.149152    8.865522
    11 2005  |   3.332498   3.105158     1.07   0.283    -2.754901    9.419897
    11 2006  |   2.353198   1.777019     1.32   0.185    -1.130497    5.836892
    11 2007  |   .0021062   2.312046     0.00   0.999    -4.530464    4.534676
    11 2008  |   4.235388   1.873686     2.26   0.024      .562186    7.908591
    11 2009  |   6.835489   1.510744     4.52   0.000     3.873803    9.797174
    12 1997  |          0  (omitted)
    12 1998  |  -1.788249   3.036164    -0.59   0.556    -7.740391    4.163893
    12 1999  |  -6.930041    2.20005    -3.15   0.002    -11.24305   -2.617028
    12 2000  |  -.0743199   3.305642    -0.02   0.982    -6.554752    6.406112
    12 2001  |  -2.107718   3.035949    -0.69   0.488    -8.059439    3.844003
    12 2002  |  -3.470166   3.032225    -1.14   0.252    -9.414587    2.474254
    12 2003  |  -3.270992   3.263919    -1.00   0.316    -9.669628    3.127645
    12 2004  |  -3.884646   4.116479    -0.94   0.345    -11.95466    4.185364
    12 2005  |  -2.525058   4.188166    -0.60   0.547     -10.7356    5.685487
    12 2006  |  -3.812564   4.206303    -0.91   0.365    -12.05867    4.433538
    12 2007  |  -2.941528   3.844745    -0.77   0.444    -10.47882    4.595769
    12 2008  |  -1.887361   4.047061    -0.47   0.641    -9.821282    6.046559
    12 2009  |    -2.4126   3.279353    -0.74   0.462    -8.841493    4.016294
    13 1997  |          0  (omitted)
    13 1998  |  -1.189037   1.704352    -0.70   0.485    -4.530275    2.152201
    13 1999  |   3.903749   1.696544     2.30   0.021     .5778178     7.22968
    13 2000  |   8.416407   2.049504     4.11   0.000     4.398527    12.43429
    13 2001  |   9.447386    2.22507     4.25   0.000     5.085325    13.80945
    13 2002  |   9.621474   2.130554     4.52   0.000     5.444703    13.79824
    13 2003  |   9.593696   1.944876     4.93   0.000     5.780931    13.40646
    13 2004  |    8.98644   1.898849     4.73   0.000     5.263907    12.70897
    13 2005  |   10.78683   1.820559     5.93   0.000     7.217775    14.35588
    13 2006  |   11.86224   1.825417     6.50   0.000     8.283661    15.44081
    13 2007  |   11.38027   2.037464     5.59   0.000     7.385991    15.37454
    13 2008  |   12.53922   2.073655     6.05   0.000     8.473996    16.60445
    13 2009  |   13.08016   2.034322     6.43   0.000     9.092044    17.06828
    14 1997  |          0  (omitted)
    14 1998  |          0  (omitted)
    14 1999  |   3.959266    4.94359     0.80   0.423    -5.732224    13.65076
    14 2000  |   3.395617   3.631591     0.94   0.350    -3.723811    10.51504
    14 2001  |  -1.006749   1.807198    -0.56   0.577    -4.549608    2.536109
    14 2002  |  -.8852071   2.208304    -0.40   0.689    -5.214401    3.443987
    14 2003  |   1.098644   3.096461     0.35   0.723    -4.971706    7.168995
    14 2004  |   .1899365   3.405744     0.06   0.956    -6.486736    6.866609
    14 2005  |   1.433288   4.206234     0.34   0.733    -6.812679    9.679255
    14 2006  |   2.327177   4.453552     0.52   0.601    -6.403634    11.05799
    14 2007  |   1.558494   3.252108     0.48   0.632    -4.816989    7.933977
    14 2008  |   .6359773    3.44079     0.18   0.853    -6.109401    7.381356
    14 2009  |     1.1059    3.93396     0.28   0.779    -6.606297    8.818096
    15 1997  |  -3.001064    1.92477    -1.56   0.119    -6.774413    .7722856
    15 1998  |  -3.728486   1.176564    -3.17   0.002     -6.03504   -1.421932
    15 1999  |  -2.611654   .6991899    -3.74   0.000    -3.982356   -1.240951
    15 2000  |  -2.071561   .4610753    -4.49   0.000     -2.97546   -1.167662
    15 2001  |          0  (omitted)
    15 2002  |  -1.618031    .981677    -1.65   0.099    -3.542525    .3064642
    15 2003  |   .9396359    1.11624     0.84   0.400    -1.248658     3.12793
    15 2004  |   .1836538   1.537363     0.12   0.905    -2.830217    3.197525
    15 2005  |   1.709723   1.333817     1.28   0.200     -.905113    4.324559
    15 2006  |   2.186851   1.739096     1.26   0.209    -1.222499    5.596202
    15 2007  |   2.334914   1.540717     1.52   0.130    -.6855303    5.355359
    15 2008  |   3.990002   1.259237     3.17   0.002     1.521374    6.458629
    15 2009  |   4.386911   1.352152     3.24   0.001     1.736132    7.037689
    16 1997  |          0  (omitted)
    16 1998  |  -7.155233   1.702995    -4.20   0.000    -10.49381   -3.816655
    16 1999  |  -5.359391    2.05772    -2.60   0.009    -9.393376   -1.325405
    16 2000  |  -6.168384   2.620477    -2.35   0.019    -11.30561   -1.031161
    16 2001  |  -3.543157   3.918933    -0.90   0.366    -11.22589    4.139579
    16 2002  |  -4.234409   4.150352    -1.02   0.308    -12.37082    3.902005
    16 2003  |  -6.577613   4.544564    -1.45   0.148    -15.48685    2.331619
    16 2004  |   -8.08414   4.841654    -1.67   0.095    -17.57579    1.407513
    16 2005  |  -10.27352   6.001522    -1.71   0.087      -22.039    1.491955
    16 2006  |  -10.41802   5.601471    -1.86   0.063    -21.39923     .563194
    16 2007  |  -8.962274   4.493838    -1.99   0.046    -17.77206   -.1524844
    16 2008  |  -5.556329   4.259106    -1.30   0.192    -13.90595    2.793287
    16 2009  |  -5.832748   4.411237    -1.32   0.186     -14.4806    2.815109
    17 1997  |          0  (omitted)
    17 1998  |  -2.187924   1.423764    -1.54   0.124    -4.979093    .6032448
    17 1999  |   .5443418   1.469518     0.37   0.711    -2.336523    3.425207
    17 2000  |   2.324368   1.686877     1.38   0.168    -.9826125    5.631349
    17 2001  |   4.740718   1.766744     2.68   0.007     1.277167    8.204269
    17 2002  |   4.041843   1.851556     2.18   0.029     .4120249    7.671662
    17 2003  |   5.201547   1.786632     2.91   0.004     1.699006    8.704089
    17 2004  |   4.519109   2.076147     2.18   0.030     .4489975    8.589221
    17 2005  |   4.937332    1.93031     2.56   0.011     1.153123     8.72154
    17 2006  |   5.025364   2.124914     2.36   0.018     .8596489    9.191078
    17 2007  |    8.78409   1.923119     4.57   0.000     5.013978     12.5542
    17 2008  |   10.95349   1.755203     6.24   0.000     7.512561    14.39442
    17 2009  |   11.84371   1.696732     6.98   0.000     8.517414    15.17001
    21 1997  |          0  (omitted)
    21 1998  |   .1804047   1.285306     0.14   0.888    -2.339329    2.700138
    21 1999  |  -1.395162   2.734671    -0.51   0.610    -6.756254    3.965929
    21 2000  |   2.940397   1.551239     1.90   0.058    -.1006758    5.981471
    21 2001  |   8.100731   1.602252     5.06   0.000     4.959652    11.24181
    21 2002  |   10.59226   1.439057     7.36   0.000     7.771115    13.41341
    21 2003  |   12.43504   1.484829     8.37   0.000     9.524156    15.34592
    21 2004  |    11.6755   1.530833     7.63   0.000     8.674436    14.67657
    21 2005  |   14.96293   1.471952    10.17   0.000     12.07729    17.84857
    21 2006  |   12.89047   1.423859     9.05   0.000     10.09912    15.68183
    21 2007  |   13.61639   1.399376     9.73   0.000     10.87304    16.35975
    21 2008  |   15.13321   1.409026    10.74   0.000     12.37093    17.89548
    21 2009  |   14.96153   1.419575    10.54   0.000     12.17857    17.74448
    22 1997  |  -15.67244   3.008692    -5.21   0.000    -21.57073   -9.774156
    22 1998  |  -16.90099   2.710137    -6.24   0.000    -22.21398   -11.58799
    22 1999  |  -15.97401   2.905669    -5.50   0.000    -21.67033   -10.27769
    22 2000  |  -6.828759   1.792778    -3.81   0.000    -10.34335   -3.314169
    22 2001  |  -4.702842   .7702447    -6.11   0.000    -6.212842   -3.192842
    22 2002  |  -4.216307    .922962    -4.57   0.000    -6.025696   -2.406918
    22 2003  |  -1.479258   .5244388    -2.82   0.005    -2.507376   -.4511405
    22 2004  |  -3.897738   .5539482    -7.04   0.000    -4.983706   -2.811769
    22 2005  |  -.6261979    .458678    -1.37   0.172    -1.525397    .2730014
    22 2006  |          0  (omitted)
    22 2007  |   .3625616    .460863     0.79   0.431    -.5409215    1.266045
    22 2008  |   1.521706   .5726847     2.66   0.008     .3990066    2.644406
    22 2009  |   1.251601   .5440685     2.30   0.021     .1850005    2.318201
    23 1997  |          0  (omitted)
    23 1998  |  -1.476256    1.16102    -1.27   0.204    -3.752337    .7998257
    23 1999  |   .9991886   1.440407     0.69   0.488    -1.824607    3.822984
    23 2000  |   .1016851   2.111456     0.05   0.962    -4.037646    4.241016
    23 2001  |   1.776751   2.365786     0.75   0.453    -2.861171    6.414674
    23 2002  |   4.556559   1.656606     2.75   0.006     1.308924    7.804194
    23 2003  |   6.616029   1.656663     3.99   0.000     3.368281    9.863776
    23 2004  |    3.86791   2.741797     1.41   0.158    -1.507152    9.242971
    23 2005  |   4.617925   2.027045     2.28   0.023     .6440745    8.591776
    23 2006  |   5.393074   2.633947     2.05   0.041      .229444     10.5567
    23 2007  |   4.322595   2.747957     1.57   0.116    -1.064541    9.709732
    23 2008  |   6.266346     3.0659     2.04   0.041     .2559089    12.27678
    23 2009  |   6.744718   2.972214     2.27   0.023     .9179442    12.57149
    24 1997  |  -2.009047   1.882026    -1.07   0.286    -5.698599    1.680505
    24 1998  |  -3.140511   1.120113    -2.80   0.005    -5.336398   -.9446231
    24 1999  |  -2.992602   .9173206    -3.26   0.001    -4.790931   -1.194272
    24 2000  |  -2.062652   .8089992    -2.55   0.011    -3.648627   -.4766779
    24 2001  |  -1.383405   .7641306    -1.81   0.070    -2.881418    .1146087
    24 2002  |   .2240722    .551516     0.41   0.685    -.8571282    1.305273
    24 2003  |  -1.117853   .5339356    -2.09   0.036    -2.164589   -.0711176
    24 2004  |          0  (omitted)
    24 2005  |   .0591505   .9497446     0.06   0.950    -1.802743    1.921044
    24 2006  |  -1.530972   .6474828    -2.36   0.018    -2.800307   -.2616365
    24 2007  |   .3844691   .7726293     0.50   0.619    -1.130205    1.899144
    24 2008  |   2.508536   .7054845     3.56   0.000     1.125493    3.891579
    24 2009  |   3.556968    .710918     5.00   0.000     2.163273    4.950663
    25 1997  |  -4.393335   2.597284    -1.69   0.091    -9.485089    .6984201
    25 1998  |  -5.119138   2.432112    -2.10   0.035    -9.887087   -.3511886
    25 1999  |  -8.842377   3.075301    -2.88   0.004    -14.87124    -2.81351
    25 2000  |  -4.715566   1.382146    -3.41   0.001    -7.425146   -2.005986
    25 2001  |  -3.600767   .9058315    -3.98   0.000    -5.376573   -1.824961
    25 2002  |   -2.30097   1.169996    -1.97   0.049    -4.594649   -.0072911
    25 2003  |  -.9081184   .7010431    -1.30   0.195    -2.282454    .4662172
    25 2004  |  -.0822393     .74749    -0.11   0.912     -1.54763    1.383152
    25 2005  |          0  (omitted)
    25 2006  |   -.615257   .6741912    -0.91   0.362    -1.936952    .7064379
    25 2007  |   .5742447   .8551048     0.67   0.502    -1.102116    2.250605
    25 2008  |   2.663671   .9381768     2.84   0.005      .824455    4.502887
    25 2009  |   2.669311   .9502973     2.81   0.005     .8063336    4.532289
    26 1997  |   3.304567   1.419198     2.33   0.020     .5223501    6.086785
    26 1998  |   3.306684   .8530998     3.88   0.000     1.634254    4.979114
    26 1999  |   2.343168   .7189723     3.26   0.001     .9336832    3.752652
    26 2000  |   2.532653   .5754108     4.40   0.000     1.404609    3.660698
    26 2001  |   1.441535    .508573     2.83   0.005     .4445204    2.438549
    26 2002  |   .9371195    .403259     2.32   0.020     .1465643    1.727675
    26 2003  |   1.644333   .5267156     3.12   0.002     .6117513    2.676914
    26 2004  |   .8255709   .5769491     1.43   0.153     -.305489    1.956631
    26 2005  |   .6083859   .3775552     1.61   0.107    -.1317793    1.348551
    26 2006  |          0  (omitted)
    26 2007  |   .6396011   .5188132     1.23   0.218    -.3774882     1.65669
    26 2008  |    .685995   .5812475     1.18   0.238    -.4534916    1.825482
    26 2009  |   .6314887   .4568005     1.38   0.167      -.26403    1.527007
    27 1997  |   1.744781   1.992661     0.88   0.381    -2.161663    5.651226
    27 1998  |   5.927507   1.382549     4.29   0.000     3.217136    8.637877
    27 1999  |  -1.685144    .754219    -2.23   0.026    -3.163727   -.2065616
    27 2000  |  -1.373547   1.086751    -1.26   0.206     -3.50403    .7569362
    27 2001  |   1.463742    1.22194     1.20   0.231    -.9317686    3.859252
    27 2002  |   1.654286   .5980247     2.77   0.006     .4819092    2.826663
    27 2003  |  -.0299736    .666347    -0.04   0.964    -1.336291    1.276343
    27 2004  |  -.1854921     .64121    -0.29   0.772     -1.44253    1.071546
    27 2005  |  -.2801234   .7465962    -0.38   0.708    -1.743762    1.183515
    27 2006  |          0  (omitted)
    27 2007  |   2.408064   .5604682     4.30   0.000     1.309314    3.506815
    27 2008  |   1.247446   .9820408     1.27   0.204     -.677762    3.172654
    27 2009  |    2.46526   .7303583     3.38   0.001     1.033454    3.897066
    28 1997  |          0  (omitted)
    28 1998  |    1.52275   1.398366     1.09   0.276    -1.218628    4.264128
    28 1999  |   2.749057   1.534165     1.79   0.073    -.2585433    5.756658
    28 2000  |   3.138403   2.032928     1.54   0.123    -.8469798    7.123787
    28 2001  |   3.517173   2.026417     1.74   0.083    -.4554458    7.489791
    28 2002  |   2.938287   2.104149     1.40   0.163     -1.18672    7.063294
    28 2003  |   2.044862   2.342963     0.87   0.383    -2.548318    6.638043
    28 2004  |  -.0644533   1.987867    -0.03   0.974    -3.961498    3.832592
    28 2005  |    1.72595   2.107869     0.82   0.413     -2.40635    5.858249
    28 2006  |   .6361155    2.07065     0.31   0.759    -3.423218    4.695449
    28 2007  |   1.179102   2.258984     0.52   0.602    -3.249444    5.607648
    28 2008  |   2.926845   2.917604     1.00   0.316    -2.792871    8.646561
    28 2009  |   4.275902   2.784579     1.54   0.125    -1.183031    9.734834
    29 1997  |          0  (omitted)
    29 1998  |  -.7669677   1.101523    -0.70   0.486     -2.92641    1.392474
    29 1999  |   1.251547   1.237463     1.01   0.312    -1.174394    3.677488
    29 2000  |   3.021162   1.658862     1.82   0.069    -.2308961     6.27322
    29 2001  |   3.372226   1.647891     2.05   0.041     .1416746    6.602777
    29 2002  |   4.062711   1.651558     2.46   0.014     .8249723    7.300451
    29 2003  |   4.738922   2.237761     2.12   0.034     .3519818    9.125863
    29 2004  |   3.919265   2.314513     1.69   0.090     -.618143    8.456673
    29 2005  |   5.194454   2.135843     2.43   0.015     1.007315    9.381594
    29 2006  |   6.964109   2.290744     3.04   0.002       2.4733    11.45492
    29 2007  |   6.011357    2.25476     2.67   0.008     1.591091    10.43162
    29 2008  |   6.768758   2.512957     2.69   0.007     1.842318     11.6952
    29 2009  |   7.550289   2.391881     3.16   0.002     2.861208    12.23937
    31 1997  |          0  (omitted)
    31 1998  |  -2.425712   1.125405    -2.16   0.031    -4.631972   -.2194512
    31 1999  |  -2.722045   1.261323    -2.16   0.031    -5.194762   -.2493285
    31 2000  |  -4.158607   1.254124    -3.32   0.001    -6.617211   -1.700002
    31 2001  |  -3.417589   1.285296    -2.66   0.008    -5.937302   -.8978751
    31 2002  |  -4.239405   1.306348    -3.25   0.001    -6.800391    -1.67842
    31 2003  |  -1.114571   1.292893    -0.86   0.389    -3.649179    1.420036
    31 2004  |  -2.011593   1.328152    -1.51   0.130    -4.615323    .5921358
    31 2005  |  -1.249347   1.356577    -0.92   0.357    -3.908801    1.410108
    31 2006  |   .9283143   1.378029     0.67   0.501    -1.773194    3.629823
    31 2007  |   .4597439   1.338874     0.34   0.731    -2.165005    3.084493
    31 2008  |   .3251866   1.361803     0.24   0.811    -2.344513    2.994886
    31 2009  |   .4648105   1.450922     0.32   0.749      -2.3796    3.309221
    32 1997  |  -4.659973   1.724376    -2.70   0.007    -8.040467   -1.279478
    32 1998  |   -2.70563   1.235517    -2.19   0.029    -5.127757   -.2835027
    32 1999  |  -3.264633   1.045625    -3.12   0.002    -5.314492   -1.214774
    32 2000  |  -2.741332   1.018406    -2.69   0.007    -4.737831   -.7448329
    32 2001  |  -3.250005    .957164    -3.40   0.001    -5.126444   -1.373566
    32 2002  |  -4.517099   .8411214    -5.37   0.000    -6.166046   -2.868151
    32 2003  |  -2.553043    .738872    -3.46   0.001    -4.001539   -1.104547
    32 2004  |  -4.207336   .7009378    -6.00   0.000    -5.581466   -2.833207
    32 2005  |  -3.215208   .7120992    -4.52   0.000    -4.611218   -1.819198
    32 2006  |  -1.249172    .746899    -1.67   0.094    -2.713405    .2150599
    32 2007  |  -1.190398   .5735542    -2.08   0.038    -2.314803   -.0659936
    32 2008  |   .7181564   .6341738     1.13   0.258    -.5250877      1.9614
    32 2009  |          0  (omitted)
    33 1997  |          0  (omitted)
    33 1998  |  -1.671181   1.085556    -1.54   0.124    -3.799321    .4569596
    33 1999  |  -4.142107   1.204426    -3.44   0.001    -6.503282   -1.780932
    33 2000  |  -5.780041   1.562383    -3.70   0.000    -8.842961   -2.717121
    33 2001  |  -4.513137   1.493298    -3.02   0.003    -7.440621   -1.585652
    33 2002  |  -3.692893   1.371063    -2.69   0.007    -6.380746    -1.00504
    33 2003  |  -4.032834   1.427399    -2.83   0.005     -6.83113   -1.234538
    33 2004  |  -5.584806   1.539086    -3.63   0.000    -8.602053   -2.567558
    33 2005  |  -5.801847   1.530842    -3.79   0.000    -8.802934    -2.80076
    33 2006  |  -4.493595   1.415017    -3.18   0.002    -7.267616   -1.719573
    33 2007  |  -3.897772   1.350911    -2.89   0.004     -6.54612   -1.249424
    33 2008  |  -3.482335   1.430832    -2.43   0.015     -6.28736   -.6773104
    33 2009  |  -3.349788    1.35962    -2.46   0.014    -6.015207   -.6843677
    35 1997  |   3.853816   1.063958     3.62   0.000     1.768017    5.939615
    35 1998  |  -.0056319    .185122    -0.03   0.976     -.368548    .3572841
    35 1999  |          0  (omitted)
    35 2000  |   -.306825   .4169791    -0.74   0.462    -1.124277    .5106272
    35 2001  |  -1.216945   .3758242    -3.24   0.001    -1.953717   -.4801739
    35 2002  |  -1.283023   .4275119    -3.00   0.003    -2.121124   -.4449222
    35 2003  |  -1.336409   .4862621    -2.75   0.006    -2.289685   -.3831337
    35 2004  |  -2.673243   .5298772    -5.05   0.000    -3.712022   -1.634463
    35 2005  |  -2.888815   .6665631    -4.33   0.000    -4.195556   -1.582075
    35 2006  |  -1.754168   .6698567    -2.62   0.009    -3.067365   -.4409701
    35 2007  |  -1.471739   .6209549    -2.37   0.018    -2.689068   -.2544093
    35 2008  |  -.7087673   .7844504    -0.90   0.366    -2.246616    .8290815
    35 2009  |   .0855213   .7851764     0.11   0.913    -1.453751    1.624793
    41 1997  |  -1.498382   1.404794    -1.07   0.286    -4.252363    1.255599
    41 1998  |  -3.074562   .5767517    -5.33   0.000    -4.205235   -1.943889
    41 1999  |     -4.919   .6491306    -7.58   0.000    -6.191566   -3.646435
    41 2000  |  -3.364164   .5502158    -6.11   0.000    -4.442816   -2.285513
    41 2001  |   -3.99241   .5436649    -7.34   0.000    -5.058219   -2.926601
    41 2002  |  -2.963424   .4522442    -6.55   0.000    -3.850011   -2.076838
    41 2003  |  -2.770003   .4778511    -5.80   0.000     -3.70679   -1.833216
    41 2004  |  -2.356892   .4205029    -5.60   0.000    -3.181252   -1.532531
    41 2005  |  -1.969811   .5089169    -3.87   0.000    -2.967499   -.9721222
    41 2006  |  -.5522984   .5069444    -1.09   0.276     -1.54612    .4415233
    41 2007  |  -.7533751   .4133739    -1.82   0.068     -1.56376    .0570095
    41 2008  |          0  (omitted)
    41 2009  |   .2073892   .7707372     0.27   0.788    -1.303576    1.718354
    42 1997  |   4.698951   1.117676     4.20   0.000     2.507841     6.89006
    42 1998  |   1.643796   .4590792     3.58   0.000     .7438099    2.543782
    42 1999  |          0  (omitted)
    42 2000  |   .7839196   .5012828     1.56   0.118    -.1988028    1.766642
    42 2001  |   1.283685   .4663165     2.75   0.006     .3695105    2.197859
    42 2002  |    .998357   .4454404     2.24   0.025     .1251087    1.871605
    42 2003  |   1.643742   .6095741     2.70   0.007     .4487239    2.838761
    42 2004  |   1.058712   .4081639     2.59   0.010      .258541    1.858882
    42 2005  |    1.79023   .5436569     3.29   0.001     .7244365    2.856023
    42 2006  |   2.004015   .5314442     3.77   0.000     .9621637    3.045867
    42 2007  |   3.255135   .5326304     6.11   0.000     2.210958    4.299312
    42 2008  |   2.732174   .5779743     4.73   0.000     1.599104    3.865243
    42 2009  |   4.523081    .613463     7.37   0.000     3.320439    5.725723
    43 1997  |  -2.436281   1.129427    -2.16   0.031    -4.650426   -.2221349
    43 1998  |  -1.665418   .4550071    -3.66   0.000    -2.557421   -.7734149
    43 1999  |  -4.722457   .4397344   -10.74   0.000    -5.584519   -3.860395
    43 2000  |  -3.447335   .4101459    -8.41   0.000    -4.251391   -2.643279
    43 2001  |  -2.139116   .3864375    -5.54   0.000    -2.896694   -1.381538
    43 2002  |  -3.065856    .334734    -9.16   0.000    -3.722073   -2.409638
    43 2003  |  -1.973082   .3483029    -5.66   0.000    -2.655901   -1.290264
    43 2004  |  -2.855216   .3900689    -7.32   0.000    -3.619913   -2.090519
    43 2005  |  -1.790175   .3588283    -4.99   0.000    -2.493627   -1.086722
    43 2006  |  -1.167064   .3723918    -3.13   0.002    -1.897106   -.4370209
    43 2007  |          0  (omitted)
    43 2008  |   -.292007   .3812488    -0.77   0.444    -1.039413    .4553989
    43 2009  |   .9253141   .4250621     2.18   0.030     .0920158    1.758612
    50 1997  |   1.977766   1.176529     1.68   0.093    -.3287187    4.284251
    50 1998  |  -1.862604    .751092    -2.48   0.013    -3.335056   -.3901513
    50 1999  |          0  (omitted)
    50 2000  |  -1.787921   .8559797    -2.09   0.037    -3.465997   -.1098449
    50 2001  |  -1.660073   .7125947    -2.33   0.020    -3.057055   -.2630913
    50 2002  |  -1.965892   .7481534    -2.63   0.009    -3.432584   -.4992008
    50 2003  |   1.308249   1.078772     1.21   0.225    -.8065924     3.42309
    50 2004  |   .6733807   1.479875     0.46   0.649     -2.22779    3.574551
    50 2005  |   1.360698   1.185603     1.15   0.251    -.9635765    3.684973
    50 2006  |   2.707415   1.394761     1.94   0.052    -.0268957    5.441726
    50 2007  |   3.438909    .913929     3.76   0.000     1.647229     5.23059
    50 2008  |   3.245266    1.00507     3.23   0.001      1.27491    5.215621
    50 2009  |   3.968043     .78801     5.04   0.000     2.423216     5.51287
    51 1997  |  -5.012841   1.601129    -3.13   0.002     -8.15172   -1.873963
    51 1998  |  -4.042219   1.429496    -2.83   0.005    -6.844625   -1.239813
    51 1999  |  -2.357099   .8912216    -2.64   0.008    -4.104263   -.6099339
    51 2000  |          0  (omitted)
    51 2001  |  -.2302534   .5520775    -0.42   0.677    -1.312555    .8520478
    51 2002  |   .1908466   .7483803     0.26   0.799     -1.27629    1.657983
    51 2003  |   .5217973   .8811707     0.59   0.554    -1.205663    2.249258
    51 2004  |   .7880434   .8831424     0.89   0.372    -.9432826    2.519369
    51 2005  |    1.60806   .9511674     1.69   0.091    -.2566229    3.472744
    51 2006  |   1.740379   1.325374     1.31   0.189    -.8579056    4.338663
    51 2007  |   .3378289   .9383686     0.36   0.719    -1.501763    2.177421
    51 2008  |   2.903862    .832695     3.49   0.000     1.271434     4.53629
    51 2009  |   3.352406   .8494486     3.95   0.000     1.687134    5.017679
    52 1997  |   3.385575   1.382363     2.45   0.014     .6755678    6.095581
    52 1998  |          0  (omitted)
    52 1999  |   1.152395   .4788786     2.41   0.016     .2135938    2.091196
    52 2000  |   .6538847   .6427028     1.02   0.309    -.6060798    1.913849
    52 2001  |   1.300174   .5791298     2.25   0.025     .1648392    2.435509
    52 2002  |   2.935717   .5064627     5.80   0.000      1.94284    3.928594
    52 2003  |   3.097382   .5112017     6.06   0.000     2.095215     4.09955
    52 2004  |   3.983519   .7073565     5.63   0.000     2.596806    5.370232
    52 2005  |   3.679997   .5958925     6.18   0.000     2.511801    4.848194
    52 2006  |   3.930676    .947763     4.15   0.000     2.072667    5.788685
    52 2007  |   4.656883   .7616418     6.11   0.000     3.163748    6.150017
    52 2008  |   6.859303   .8146289     8.42   0.000     5.262292    8.456314
    52 2009  |   6.682433    1.06054     6.30   0.000     4.603334    8.761533
    53 1997  |   3.109366   1.022109     3.04   0.002     1.105607    5.113124
    53 1998  |          0  (omitted)
    53 1999  |          0  (omitted)
    53 2000  |          0  (omitted)
    53 2001  |          0  (omitted)
    53 2002  |          0  (omitted)
    53 2003  |          0  (omitted)
    53 2004  |          0  (omitted)
    53 2005  |          0  (omitted)
    53 2006  |          0  (omitted)
    53 2007  |          0  (omitted)
    53 2008  |          0  (omitted)
    53 2009  |          0  (omitted)
             |
       _cons |   45.07002   .3943678   114.28   0.000     44.29689    45.84314
-------------+----------------------------------------------------------------
  fips_month |   absorbed                                   (63084 categories)

. //
. local holder

. lincom tavg_bin_0C_10C_ + l1_tavg_bin_0C_10C_ 

 ( 1)  tavg_bin_0C_10C_ + l1_tavg_bin_0C_10C_ = 0

------------------------------------------------------------------------------
   mrate_tot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9906549   .0574465    17.24   0.000     .8780358    1.103274
------------------------------------------------------------------------------

. local reg_c_010_cont = r(estimate)

. local reg_se_010_cont = r(se)

. local reg_se_010_left = `reg_c_010_cont' - 1.96 * `reg_se_010_cont'

. local reg_se_010_right = `reg_c_010_cont'+ 1.96 * `reg_se_010_cont'

. local holder "`holder' `reg_c_010_cont' , `reg_se_010_cont' , `reg_se_010_lef
> t' , `reg_se_010_right'  "

. di "`holder'"
 .9906548746407127 , .0574465246548202 , .8780596863172651 , 1.10325006296416  

. 
. local bins 10C_13C_ 13C_16C_ 16C_19C_ 19C_22C_ 

. foreach i of local bins{
  2. lincom tavg_bin_`i' + l1_tavg_bin_`i'
  3. local reg_c_010_cont = r(estimate)
  4. local reg_se_010_cont = r(se)
  5. local reg_se_010_left = `reg_c_010_cont' - 1.96 * `reg_se_010_cont'
  6. local reg_se_010_right = `reg_c_010_cont'+ 1.96 * `reg_se_010_cont'
  7. local holder "`holder' \  `reg_c_010_cont' , `reg_se_010_cont' , `reg_se_0
> 10_left' , `reg_se_010_right'"
  8. di "`holder'"
  9. }

 ( 1)  tavg_bin_10C_13C_ + l1_tavg_bin_10C_13C_ = 0

------------------------------------------------------------------------------
   mrate_tot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6598759   .0390517    16.90   0.000     .5833183    .7364335
------------------------------------------------------------------------------
 .9906548746407127 , .0574465246548202 , .8780596863172651 , 1.10325006296416  
>  \  .6598758781875033 , .0390517171521325 , .5833345125693236 , .736417243805
> 683

 ( 1)  tavg_bin_13C_16C_ + l1_tavg_bin_13C_16C_ = 0

------------------------------------------------------------------------------
   mrate_tot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .3400922   .0270595    12.57   0.000     .2870444      .39314
------------------------------------------------------------------------------
 .9906548746407127 , .0574465246548202 , .8780596863172651 , 1.10325006296416  
>  \  .6598758781875033 , .0390517171521325 , .5833345125693236 , .736417243805
> 683 \  .3400921625044376 , .0270594653419842 , .2870556104341486 , .393128714
> 5747266

 ( 1)  tavg_bin_16C_19C_ + l1_tavg_bin_16C_19C_ = 0

------------------------------------------------------------------------------
   mrate_tot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1745372   .0184771     9.45   0.000     .1383144      .21076
------------------------------------------------------------------------------
 .9906548746407127 , .0574465246548202 , .8780596863172651 , 1.10325006296416  
>  \  .6598758781875033 , .0390517171521325 , .5833345125693236 , .736417243805
> 683 \  .3400921625044376 , .0270594653419842 , .2870556104341486 , .393128714
> 5747266 \  .1745372086437783 , .018477113638081 , .1383220659131396 , .210752
> 3513744171

 ( 1)  tavg_bin_19C_22C_ + l1_tavg_bin_19C_22C_ = 0

------------------------------------------------------------------------------
   mrate_tot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0092049   .0117727     0.78   0.434    -.0138745    .0322842
------------------------------------------------------------------------------
 .9906548746407127 , .0574465246548202 , .8780596863172651 , 1.10325006296416  
>  \  .6598758781875033 , .0390517171521325 , .5833345125693236 , .736417243805
> 683 \  .3400921625044376 , .0270594653419842 , .2870556104341486 , .393128714
> 5747266 \  .1745372086437783 , .018477113638081 , .1383220659131396 , .210752
> 3513744171 \  .0092048670574021 , .0117726685821794 , -.0138695633636695 , .0
> 322792974784737

. 
. local holder "`holder' \  0 , 0 , 0 , 0 "

. 
. local bins 25C_28C_ 28C_31C_ 31C_Inf_  

. foreach i of local bins{
  2. lincom tavg_bin_`i' + l1_tavg_bin_`i'
  3. local reg_c_010_cont = r(estimate)
  4. local reg_se_010_cont = r(se)
  5. local reg_se_010_left = `reg_c_010_cont' - 1.96 * `reg_se_010_cont'
  6. local reg_se_010_right = `reg_c_010_cont'+ 1.96 * `reg_se_010_cont'
  7. local holder "`holder' \  `reg_c_010_cont' , `reg_se_010_cont' , `reg_se_0
> 10_left' , `reg_se_010_right'"
  8. di "`holder'"
  9. }

 ( 1)  tavg_bin_25C_28C_ + l1_tavg_bin_25C_28C_ = 0

------------------------------------------------------------------------------
   mrate_tot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0070632   .0092306     0.77   0.444    -.0110326    .0251589
------------------------------------------------------------------------------
 .9906548746407127 , .0574465246548202 , .8780596863172651 , 1.10325006296416  
>  \  .6598758781875033 , .0390517171521325 , .5833345125693236 , .736417243805
> 683 \  .3400921625044376 , .0270594653419842 , .2870556104341486 , .393128714
> 5747266 \  .1745372086437783 , .018477113638081 , .1383220659131396 , .210752
> 3513744171 \  .0092048670574021 , .0117726685821794 , -.0138695633636695 , .0
> 322792974784737 \  0 , 0 , 0 , 0  \  .0070631704625181 , .0092305779600775 , 
> -.0110287623392338 , .02515510326427

 ( 1)  tavg_bin_28C_31C_ + l1_tavg_bin_28C_31C_ = 0

------------------------------------------------------------------------------
   mrate_tot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0162077    .018394     0.88   0.378    -.0198521    .0522675
------------------------------------------------------------------------------
 .9906548746407127 , .0574465246548202 , .8780596863172651 , 1.10325006296416  
>  \  .6598758781875033 , .0390517171521325 , .5833345125693236 , .736417243805
> 683 \  .3400921625044376 , .0270594653419842 , .2870556104341486 , .393128714
> 5747266 \  .1745372086437783 , .018477113638081 , .1383220659131396 , .210752
> 3513744171 \  .0092048670574021 , .0117726685821794 , -.0138695633636695 , .0
> 322792974784737 \  0 , 0 , 0 , 0  \  .0070631704625181 , .0092305779600775 , 
> -.0110287623392338 , .02515510326427 \  .0162077260085713 , .0183939596590487
>  , -.0198444349231642 , .0522598869403068

 ( 1)  tavg_bin_31C_Inf_ + l1_tavg_bin_31C_Inf_ = 0

------------------------------------------------------------------------------
   mrate_tot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6692227   .1896382     3.53   0.000      .297453    1.040992
------------------------------------------------------------------------------
 .9906548746407127 , .0574465246548202 , .8780596863172651 , 1.10325006296416  
>  \  .6598758781875033 , .0390517171521325 , .5833345125693236 , .736417243805
> 683 \  .3400921625044376 , .0270594653419842 , .2870556104341486 , .393128714
> 5747266 \  .1745372086437783 , .018477113638081 , .1383220659131396 , .210752
> 3513744171 \  .0092048670574021 , .0117726685821794 , -.0138695633636695 , .0
> 322792974784737 \  0 , 0 , 0 , 0  \  .0070631704625181 , .0092305779600775 , 
> -.0110287623392338 , .02515510326427 \  .0162077260085713 , .0183939596590487
>  , -.0198444349231642 , .0522598869403068 \  .669222663316129 , .189638224475
> 8103 , .2975317433435408 , 1.040913583288717

. ** Adding the matris 
. matrix b1 = (`holder')

. matrix list b1

b1[9,4]
            c1          c2          c3          c4
r1   .99065487   .05744652   .87805969   1.1032501
r2   .65987588   .03905172   .58333451   .73641724
r3   .34009216   .02705947   .28705561   .39312871
r4   .17453721   .01847711   .13832207   .21075235
r5   .00920487   .01177267  -.01386956    .0322793
r6           0           0           0           0
r7   .00706317   .00923058  -.01102876    .0251551
r8   .01620773   .01839396  -.01984443   .05225989
r9   .66922266   .18963822   .29753174   1.0409136

. 
. 
. ************
. ** 2-lag ***
. ************
. areg mrate_tot `three' `three_l1' `three_l2' `precip' i.month#i.year i.state_
> fips#i.year [aw=pop_tot_weights], absorb(fips_month) vce(cluster fips)
(sum of wgt is   1.5132e+02)
note: 1.month#1997.year identifies no observations in the sample
note: 2.month#1997.year identifies no observations in the sample
note: 12.month#2009.year omitted because of collinearity
note: 53.state_fips#1998.year omitted because of collinearity
note: 53.state_fips#1999.year omitted because of collinearity
note: 53.state_fips#2000.year omitted because of collinearity
note: 53.state_fips#2001.year omitted because of collinearity
note: 53.state_fips#2002.year omitted because of collinearity
note: 53.state_fips#2003.year omitted because of collinearity
note: 53.state_fips#2004.year omitted because of collinearity
note: 53.state_fips#2005.year omitted because of collinearity
note: 53.state_fips#2006.year omitted because of collinearity
note: 53.state_fips#2007.year omitted because of collinearity
note: 53.state_fips#2008.year omitted because of collinearity
note: 53.state_fips#2009.year omitted because of collinearity
note: 1b.month#1999.year omitted because of collinearity
note: 2.month#2002.year omitted because of collinearity
note: 3.month#2002.year omitted because of collinearity
note: 4.month#2002.year omitted because of collinearity
note: 5.month#2009.year omitted because of collinearity
note: 6.month#2009.year omitted because of collinearity
note: 7.month#2000.year omitted because of collinearity
note: 8.month#2000.year omitted because of collinearity
note: 9.month#2008.year omitted because of collinearity
note: 10.month#2004.year omitted because of collinearity
note: 11.month#2009.year omitted because of collinearity
note: 12.state_fips#1997b.year omitted because of collinearity
note: 13.state_fips#1997b.year omitted because of collinearity
note: 14.state_fips#1997b.year omitted because of collinearity
note: 14.state_fips#1999.year omitted because of collinearity
note: 15.state_fips#1997b.year omitted because of collinearity
note: 16.state_fips#1997b.year omitted because of collinearity
note: 17.state_fips#1997b.year omitted because of collinearity
note: 21.state_fips#1997b.year omitted because of collinearity
note: 22.state_fips#1997b.year omitted because of collinearity
note: 23.state_fips#1997b.year omitted because of collinearity
note: 24.state_fips#1997b.year omitted because of collinearity
note: 25.state_fips#1997b.year omitted because of collinearity
note: 26.state_fips#1997b.year omitted because of collinearity
note: 27.state_fips#1997b.year omitted because of collinearity
note: 28.state_fips#1997b.year omitted because of collinearity
note: 29.state_fips#1997b.year omitted because of collinearity
note: 31.state_fips#2007.year omitted because of collinearity
note: 32.state_fips#1999.year omitted because of collinearity
note: 33.state_fips#1997b.year omitted because of collinearity
note: 35.state_fips#1997b.year omitted because of collinearity
note: 41.state_fips#2000.year omitted because of collinearity
note: 42.state_fips#1998.year omitted because of collinearity
note: 43.state_fips#2007.year omitted because of collinearity
note: 50.state_fips#2006.year omitted because of collinearity
note: 51.state_fips#1997b.year omitted because of collinearity
note: 52.state_fips#2000.year omitted because of collinearity

Linear regression, absorbing indicators         Number of obs     =    809,506
                                                F( 469,   5256)   =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5212
                                                Adj R-squared     =     0.4804
                                                Root MSE          =    12.9530

                               (Std. Err. adjusted for 5,257 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
   mrate_tot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
tavg~0C_10C_ |   .7484955   .0424985    17.61   0.000     .6651808    .8318102
tav~10C_13C_ |   .4703793   .0263831    17.83   0.000     .4186574    .5221011
tavg~3C_16C_ |   .2019269   .0188179    10.73   0.000     .1650359    .2388178
tavg~6C_19C_ |   .1301927   .0119256    10.92   0.000     .1068136    .1535718
tavg~9C_22C_ |   .0006973   .0093075     0.07   0.940    -.0175493    .0189438
tavg~5C_28C_ |   .0363692   .0065469     5.56   0.000     .0235346    .0492038
tavg~8C_31C_ |   .1238897   .0123141    10.06   0.000     .0997489    .1480304
tavg~1C_Inf_ |   .6227207   .1431476     4.35   0.000     .3420919    .9033495
l1_tavg_~0C_ |   .2792521    .040438     6.91   0.000     .1999769    .3585273
l1_~10C_13C_ |   .1869807   .0260775     7.17   0.000      .135858    .2381035
l1_tavg_~6C_ |   .1391741   .0177282     7.85   0.000     .1044195    .1739286
l1_tavg_~9C_ |   .0467317   .0120649     3.87   0.000     .0230796    .0703838
l1_tavg_~2C_ |   .0095965   .0077433     1.24   0.215    -.0055836    .0247765
l1_tavg_~8C_ |  -.0329581   .0063833    -5.16   0.000     -.045472   -.0204443
l1_tavg_~1C_ |  -.1071508   .0109315    -9.80   0.000    -.1285811   -.0857204
l1_t~1C_Inf_ |   .0474561   .1140873     0.42   0.677    -.1762024    .2711146
l2_tavg_~0C_ |   .0769639   .0425208     1.81   0.070    -.0063946    .1603223
l2_~10C_13C_ |   .0688266   .0242449     2.84   0.005     .0212965    .1163567
l2_tavg_~6C_ |   .0140256   .0160568     0.87   0.382    -.0174524    .0455036
l2_tavg_~9C_ |  -.0041356   .0140682    -0.29   0.769    -.0317152    .0234439
l2_tavg_~2C_ |  -.0012188   .0089162    -0.14   0.891    -.0186982    .0162606
l2_tavg_~8C_ |   .0102578   .0071389     1.44   0.151    -.0037373     .024253
l2_tavg_~1C_ |  -.0022461    .010935    -0.21   0.837    -.0236833     .019191
l2_t~1C_Inf_ |   .0191276   .1450072     0.13   0.895    -.2651467    .3034019
     precip_ |   .0025432   .0009752     2.61   0.009     .0006314     .004455
   precip_sq |  -5.22e-06   2.16e-06    -2.42   0.016    -9.46e-06   -9.86e-07
             |
  month#year |
     1 1997  |          0  (empty)
     1 1998  |  -.8676857   .3020781    -2.87   0.004    -1.459884    -.275487
     1 1999  |          0  (omitted)
     1 2000  |  -1.875467   .2612839    -7.18   0.000    -2.387692   -1.363242
     1 2001  |  -2.064791    .342603    -6.03   0.000    -2.736435   -1.393147
     1 2002  |  -.5400469   .3040609    -1.78   0.076    -1.136133    .0560389
     1 2003  |  -3.018573   .3224527    -9.36   0.000    -3.650714   -2.386432
     1 2004  |   -2.55135   .2869858    -8.89   0.000    -3.113961   -1.988739
     1 2005  |  -3.469261   .2651376   -13.08   0.000    -3.989041   -2.949481
     1 2006  |  -3.896726   .3401829   -11.45   0.000    -4.563625   -3.229826
     1 2007  |  -4.926809   .3449949   -14.28   0.000    -5.603142   -4.250475
     1 2008  |  -4.362293   .2740527   -15.92   0.000     -4.89955   -3.825036
     1 2009  |  -4.496246   .2761916   -16.28   0.000    -5.037697   -3.954796
     2 1997  |          0  (empty)
     2 1998  |   .1432838    .492321     0.29   0.771    -.8218698    1.108437
     2 1999  |  -.2973431   .2705006    -1.10   0.272    -.8276366    .2329504
     2 2000  |  -.4208408   .3213506    -1.31   0.190    -1.050822    .2091399
     2 2001  |  -1.939113   .3195597    -6.07   0.000    -2.565583   -1.312644
     2 2002  |          0  (omitted)
     2 2003  |  -1.040075   .3965387    -2.62   0.009    -1.817456   -.2626944
     2 2004  |   1.285369   .2934222     4.38   0.000       .71014    1.860599
     2 2005  |  -2.018931   .3261607    -6.19   0.000    -2.658341   -1.379521
     2 2006  |   -4.36734   .3064187   -14.25   0.000    -4.968048   -3.766632
     2 2007  |  -3.461502   .2895745   -11.95   0.000    -4.029189   -2.893816
     2 2008  |  -2.212162   .2616357    -8.46   0.000    -2.725077   -1.699248
     2 2009  |  -3.696579   .2942011   -12.56   0.000    -4.273335   -3.119823
     3 1997  |   -8.19862   4.198382    -1.95   0.051    -16.42919    .0319526
     3 1998  |  -.9949945   .3777029    -2.63   0.008    -1.735449     -.25454
     3 1999  |    .060529   .4139962     0.15   0.884    -.7510755    .8721335
     3 2000  |  -2.658954   .3127574    -8.50   0.000    -3.272088   -2.045819
     3 2001  |  -3.179921   .3526058    -9.02   0.000    -3.871175   -2.488667
     3 2002  |          0  (omitted)
     3 2003  |  -2.088137   .4012016    -5.20   0.000    -2.874659   -1.301615
     3 2004  |    1.05178   .3356977     3.13   0.002     .3936731    1.709887
     3 2005  |  -2.675505   .3138961    -8.52   0.000    -3.290871   -2.060138
     3 2006  |  -4.933918   .3102643   -15.90   0.000    -5.542165   -4.325671
     3 2007  |  -3.556677   .3287995   -10.82   0.000    -4.201261   -2.912094
     3 2008  |  -3.911669   .3470597   -11.27   0.000     -4.59205   -3.231288
     3 2009  |  -2.925935   .3111691    -9.40   0.000    -3.535956   -2.315915
     4 1997  |  -5.747361   4.175859    -1.38   0.169    -13.93378    2.439058
     4 1998  |   1.005867   .3058247     3.29   0.001     .4063239    1.605411
     4 1999  |   2.205693   .3302852     6.68   0.000     1.558197    2.853189
     4 2000  |   .1471371   .2720415     0.54   0.589    -.3861773    .6804516
     4 2001  |  -.4694369   .2654435    -1.77   0.077    -.9898165    .0509426
     4 2002  |          0  (omitted)
     4 2003  |   .5187706   .3466754     1.50   0.135    -.1608573    1.198398
     4 2004  |   1.629357   .2393565     6.81   0.000     1.160119    2.098595
     4 2005  |  -1.346565   .2895138    -4.65   0.000    -1.914132   -.7789976
     4 2006  |  -1.673143   .3148811    -5.31   0.000    -2.290441   -1.055845
     4 2007  |  -1.469227   .2648613    -5.55   0.000    -1.988466   -.9499893
     4 2008  |  -1.264418   .2655608    -4.76   0.000    -1.785028   -.7438087
     4 2009  |  -1.244663   .2626806    -4.74   0.000    -1.759626   -.7296994
     5 1997  |  -5.514448   4.170053    -1.32   0.186    -13.68948    2.660588
     5 1998  |   2.874966   .3992188     7.20   0.000     2.092332    3.657601
     5 1999  |   3.392881   .3472199     9.77   0.000     2.712186    4.073576
     5 2000  |   .9848761   .3906039     2.52   0.012     .2191302    1.750622
     5 2001  |   .3973492   .3340917     1.19   0.234    -.2576093    1.052308
     5 2002  |   -.589608    .332031    -1.78   0.076    -1.240527    .0613108
     5 2003  |   .6477727   .3049516     2.12   0.034      .049941    1.245604
     5 2004  |   1.259062   .3045806     4.13   0.000     .6619575    1.856167
     5 2005  |   .5911262   .3070674     1.93   0.054    -.0108534    1.193106
     5 2006  |   1.184968   .3704006     3.20   0.001     .4588285    1.911107
     5 2007  |  -.6911779   .2647809    -2.61   0.009    -1.210258   -.1720973
     5 2008  |  -.1434245   .3198379    -0.45   0.654    -.7704397    .4835907
     5 2009  |          0  (omitted)
     6 1997  |  -1.026863   4.176282    -0.25   0.806     -9.21411    7.160385
     6 1998  |   7.362078   .4210114    17.49   0.000     6.536721    8.187435
     6 1999  |   3.939408    .342111    11.51   0.000     3.268728    4.610088
     6 2000  |   1.631042   .3339432     4.88   0.000     .9763742    2.285709
     6 2001  |   .2985347   .2688839     1.11   0.267    -.2285894    .8256589
     6 2002  |   1.260871   .2769164     4.55   0.000         .718    1.803743
     6 2003  |   1.562236   .2674427     5.84   0.000     1.037937    2.086535
     6 2004  |   3.084724   .2783996    11.08   0.000     2.538945    3.630503
     6 2005  |   .5499017   .2543149     2.16   0.031     .0513388    1.048465
     6 2006  |   1.109757   .2786001     3.98   0.000     .5635853    1.655929
     6 2007  |   1.785492   .2954357     6.04   0.000     1.206315    2.364669
     6 2008  |  -.1852732   .2631511    -0.70   0.481    -.7011586    .3306122
     6 2009  |          0  (omitted)
     7 1997  |  -4.570813   4.166199    -1.10   0.273    -12.73829    3.596667
     7 1998  |    4.21595   .3208573    13.14   0.000     3.586936    4.844963
     7 1999  |    .975168   .3517808     2.77   0.006     .2855315    1.664805
     7 2000  |          0  (omitted)
     7 2001  |   .2923608   .3829395     0.76   0.445    -.4583597    1.043081
     7 2002  |   .3734684    .356788     1.05   0.295    -.3259843    1.072921
     7 2003  |   1.147455   .3087703     3.72   0.000     .5421366    1.752773
     7 2004  |  -.9374086   .3468123    -2.70   0.007    -1.617305   -.2575124
     7 2005  |  -.3888588   .3073672    -1.27   0.206    -.9914261    .2137086
     7 2006  |  -.3099148   .3144897    -0.99   0.324    -.9264453    .3066157
     7 2007  |  -1.727699   .3025981    -5.71   0.000    -2.320917   -1.134481
     7 2008  |  -1.129265   .3136514    -3.60   0.000    -1.744152   -.5143777
     7 2009  |  -1.126965    .422312    -2.67   0.008    -1.954872   -.2990577
     8 1997  |  -5.101801   4.163316    -1.23   0.220    -13.26363    3.060029
     8 1998  |   .3633066   .3420593     1.06   0.288    -.3072718    1.033885
     8 1999  |   .2292433    .344599     0.67   0.506     -.446314    .9048005
     8 2000  |          0  (omitted)
     8 2001  |   .2344649   .3397782     0.69   0.490    -.4316416    .9005714
     8 2002  |  -.3824501   .3590258    -1.07   0.287     -1.08629    .3213896
     8 2003  |  -1.346739   .2786229    -4.83   0.000    -1.892956   -.8005223
     8 2004  |    .317907   .2996401     1.06   0.289    -.2695121    .9053262
     8 2005  |  -1.639151   .2903853    -5.64   0.000    -2.208427   -1.069876
     8 2006  |   -1.87383   .3184998    -5.88   0.000    -2.498222   -1.249438
     8 2007  |  -1.581807   .2892723    -5.47   0.000    -2.148901   -1.014713
     8 2008  |  -2.104969   .3156829    -6.67   0.000    -2.723838   -1.486099
     8 2009  |  -.0703825   .3434754    -0.20   0.838    -.7437369    .6029719
     9 1997  |  -4.557456   4.165572    -1.09   0.274    -12.72371    3.608796
     9 1998  |   1.352164   .3289692     4.11   0.000     .7072473     1.99708
     9 1999  |   .9110423   .2982834     3.05   0.002     .3262828    1.495802
     9 2000  |   .8242022   .2768997     2.98   0.003     .2813638    1.367041
     9 2001  |   1.934184   .3273786     5.91   0.000     1.292386    2.575982
     9 2002  |   2.423502   .3317473     7.31   0.000      1.77314    3.073865
     9 2003  |   1.713051   .2584306     6.63   0.000      1.20642    2.219682
     9 2004  |   2.028811   .2928073     6.93   0.000     1.454787    2.602835
     9 2005  |  -.9283364   .2460852    -3.77   0.000    -1.410766   -.4459071
     9 2006  |  -.1309645   .2660467    -0.49   0.623    -.6525266    .3905976
     9 2007  |  -.2581003   .2932886    -0.88   0.379    -.8330677    .3168671
     9 2008  |          0  (omitted)
     9 2009  |   .2318359   .2764711     0.84   0.402    -.3101624    .7738341
    10 1997  |  -6.274728   4.173516    -1.50   0.133    -14.45655    1.907098
    10 1998  |   -.333116   .3566217    -0.93   0.350    -1.032243    .3660106
    10 1999  |  -.7614118   .2847117    -2.67   0.008    -1.319565   -.2032586
    10 2000  |  -.1599521   .3007236    -0.53   0.595    -.7494952    .4295911
    10 2001  |   .7879478   .2598624     3.03   0.002     .2785094    1.297386
    10 2002  |   1.043579   .3316243     3.15   0.002     .3934577      1.6937
    10 2003  |  -.8527662   .2654411    -3.21   0.001    -1.373141   -.3323914
    10 2004  |          0  (omitted)
    10 2005  |  -1.365448   .2430451    -5.62   0.000    -1.841917   -.8889785
    10 2006  |  -2.793856   .3199779    -8.73   0.000    -3.421146   -2.166567
    10 2007  |  -1.547306   .2809227    -5.51   0.000    -2.098032   -.9965809
    10 2008  |  -.4083197   .2808844    -1.45   0.146    -.9589697    .1423304
    10 2009  |  -1.096358   .3300374    -3.32   0.001    -1.743368   -.4493474
    11 1997  |  -6.230138   4.165479    -1.50   0.135    -14.39621    1.935932
    11 1998  |   .6341634   .3032423     2.09   0.037     .0396826    1.228644
    11 1999  |  -.7495464   .3185365    -2.35   0.019     -1.37401   -.1250826
    11 2000  |  -1.251064   .2945319    -4.25   0.000    -1.828469   -.6736595
    11 2001  |   .3099542   .2797917     1.11   0.268    -.2385538    .8584622
    11 2002  |  -.3767191   .3114976    -1.21   0.227    -.9873838    .2339456
    11 2003  |  -.9983219   .3032909    -3.29   0.001    -1.592898   -.4037457
    11 2004  |  -1.263771   .3106668    -4.07   0.000    -1.872807   -.6547351
    11 2005  |  -1.883471   .3132982    -6.01   0.000    -2.497666   -1.269277
    11 2006  |  -2.344945   .2741351    -8.55   0.000    -2.882364   -1.807527
    11 2007  |  -2.127139   .3209346    -6.63   0.000    -2.756304   -1.497974
    11 2008  |  -1.495743   .3129943    -4.78   0.000    -2.109342   -.8821442
    11 2009  |          0  (omitted)
    12 1997  |  -4.433309   4.181358    -1.06   0.289    -12.63051    3.763889
    12 1998  |  -.1512967   .2796972    -0.54   0.589    -.6996194    .3970259
    12 1999  |  -2.061673   .3033263    -6.80   0.000    -2.656318   -1.467027
    12 2000  |   -.833169   .3088148    -2.70   0.007    -1.438574   -.2277637
    12 2001  |   .3142481   .2693847     1.17   0.243    -.2138579    .8423541
    12 2002  |  -.6741734   .3263671    -2.07   0.039    -1.313988   -.0343584
    12 2003  |  -1.700328   .2497159    -6.81   0.000    -2.189875   -1.210781
    12 2004  |  -1.736818   .2923049    -5.94   0.000    -2.309857   -1.163779
    12 2005  |  -2.376151    .240437    -9.88   0.000    -2.847507   -1.904795
    12 2006  |  -2.169998   .2410395    -9.00   0.000    -2.642536   -1.697461
    12 2007  |  -1.108937   .2778316    -3.99   0.000    -1.653602   -.5642715
    12 2008  |  -1.415059   .2543543    -5.56   0.000    -1.913699   -.9164187
    12 2009  |          0  (omitted)
             |
  state_fips#|
        year |
    11 1998  |  -4.770103   4.316846    -1.10   0.269    -13.23291    3.692708
    11 1999  |  -3.212935   5.178961    -0.62   0.535    -13.36585     6.93998
    11 2000  |  -2.284613   5.806828    -0.39   0.694    -13.66841    9.099182
    11 2001  |  -.6115934   5.337701    -0.11   0.909    -11.07571    9.852518
    11 2002  |  -1.405593   5.598228    -0.25   0.802    -12.38045    9.569259
    11 2003  |    .206777   5.105375     0.04   0.968     -9.80188    10.21543
    11 2004  |   -1.34819   5.191345    -0.26   0.795    -11.52538    8.829003
    11 2005  |  -.8811623   5.211859    -0.17   0.866    -11.09857    9.336247
    11 2006  |  -1.885093   4.459796    -0.42   0.673    -10.62815    6.857959
    11 2007  |  -4.222394    4.71531    -0.90   0.371    -13.46636    5.021572
    11 2008  |   .0335438   4.457105     0.01   0.994    -8.704234    8.771321
    11 2009  |   2.616166   4.301672     0.61   0.543    -5.816898    11.04923
    12 1997  |          0  (omitted)
    12 1998  |  -5.916728   5.106461    -1.16   0.247    -15.92751    4.094057
    12 1999  |  -11.08706   4.652734    -2.38   0.017    -20.20835   -1.965769
    12 2000  |   -4.23387   5.266766    -0.80   0.422    -14.55892     6.09118
    12 2001  |  -6.274562   5.093455    -1.23   0.218    -16.25985    3.710727
    12 2002  |  -7.637614   5.101497    -1.50   0.134    -17.63867     2.36344
    12 2003  |  -7.441796    5.25816    -1.42   0.157    -17.74997    2.866381
    12 2004  |  -8.023682   5.844871    -1.37   0.170    -19.48206    3.434694
    12 2005  |  -6.679648   5.879733    -1.14   0.256    -18.20637    4.847072
    12 2006  |  -7.991526   5.872775    -1.36   0.174    -19.50461    3.521554
    12 2007  |  -7.102507   5.615875    -1.26   0.206    -18.11195    3.906941
    12 2008  |  -6.027484   5.755067    -1.05   0.295    -17.30981    5.254839
    12 2009  |  -6.571081   5.249434    -1.25   0.211    -16.86215     3.71999
    13 1997  |          0  (omitted)
    13 1998  |   -5.52989   4.393789    -1.26   0.208    -14.14354    3.083762
    13 1999  |  -.5044488   4.384643    -0.12   0.908     -9.10017    8.091272
    13 2000  |   4.009352   4.531231     0.88   0.376    -4.873742    12.89245
    13 2001  |   5.043818   4.631086     1.09   0.276    -4.035036    14.12267
    13 2002  |    5.23207   4.580596     1.14   0.253    -3.747801    14.21194
    13 2003  |   5.191168   4.494857     1.15   0.248    -3.620619    14.00296
    13 2004  |   4.596687   4.466023     1.03   0.303    -4.158573    13.35195
    13 2005  |   6.421354   4.438655     1.45   0.148    -2.280253    15.12296
    13 2006  |   7.450372   4.432241     1.68   0.093    -1.238663    16.13941
    13 2007  |   6.980675   4.535486     1.54   0.124    -1.910762    15.87211
    13 2008  |   8.146892    4.55673     1.79   0.074    -.7861911    17.07998
    13 2009  |   8.680174   4.533999     1.91   0.056    -.2083474    17.56869
    14 1997  |          0  (omitted)
    14 1998  |  -3.884573   4.962172    -0.78   0.434    -13.61249    5.843345
    14 1999  |          0  (omitted)
    14 2000  |  -.5779899   1.961093    -0.29   0.768    -4.422548    3.266568
    14 2001  |  -4.978906   3.493917    -1.43   0.154    -11.82843    1.870622
    14 2002  |  -4.824922    3.46107    -1.39   0.163    -11.61006    1.960214
    14 2003  |  -2.844586   3.246703    -0.88   0.381    -9.209473      3.5203
    14 2004  |  -3.734594    2.48393    -1.50   0.133    -8.604128     1.13494
    14 2005  |  -2.476046   2.650695    -0.93   0.350    -7.672509    2.720416
    14 2006  |  -1.628009   1.702544    -0.96   0.339    -4.965703    1.709685
    14 2007  |  -2.385149   2.118772    -1.13   0.260    -6.538821    1.768524
    14 2008  |  -3.310684   2.245982    -1.47   0.141    -7.713742    1.092373
    14 2009  |  -2.827837   1.683247    -1.68   0.093    -6.127702    .4720267
    15 1997  |          0  (omitted)
    15 1998  |  -4.743867   4.226814    -1.12   0.262    -13.03018    3.542445
    15 1999  |  -3.716286   4.369339    -0.85   0.395    -12.28201    4.849433
    15 2000  |  -3.185632   4.451905    -0.72   0.474    -11.91321    5.541951
    15 2001  |  -1.116734   4.469391    -0.25   0.803    -9.878597    7.645129
    15 2002  |  -2.704089   4.775439    -0.57   0.571    -12.06593    6.657755
    15 2003  |   -.167584   4.837591    -0.03   0.972    -9.651272    9.316104
    15 2004  |    -.91447   5.051858    -0.18   0.856    -10.81821    8.989271
    15 2005  |   .6262492   4.944649     0.13   0.899    -9.067318    10.31982
    15 2006  |   1.073235   5.147467     0.21   0.835     -9.01794    11.16441
    15 2007  |   1.263389    5.04302     0.25   0.802    -8.623025     11.1498
    15 2008  |   2.903017    4.82255     0.60   0.547    -6.551186    12.35722
    15 2009  |   3.283992   4.879668     0.67   0.501    -6.282185    12.85017
    16 1997  |          0  (omitted)
    16 1998  |  -11.13081   4.419538    -2.52   0.012    -19.79494   -2.466679
    16 1999  |   -9.40107   4.485944    -2.10   0.036    -18.19538   -.6067548
    16 2000  |  -10.23317   4.867796    -2.10   0.036    -19.77607   -.6902707
    16 2001  |  -7.607854   5.696517    -1.34   0.182    -18.77539    3.559686
    16 2002  |  -8.266658   5.843588    -1.41   0.157    -19.72252    3.189203
    16 2003  |  -10.63382   6.142447    -1.73   0.083    -22.67557    1.407931
    16 2004  |  -12.12117   6.373413    -1.90   0.057    -24.61571    .3733648
    16 2005  |  -14.29232   7.310333    -1.96   0.051    -28.62361    .0389744
    16 2006  |  -14.46058   6.980827    -2.07   0.038     -28.1459   -.7752609
    16 2007  |  -12.99167   6.098545    -2.13   0.033    -24.94735   -1.035989
    16 2008  |  -9.586766    5.92309    -1.62   0.106    -21.19848    2.024951
    16 2009  |  -9.867014   6.049348    -1.63   0.103    -21.72625     1.99222
    17 1997  |          0  (omitted)
    17 1998  |  -6.380134   4.297372    -1.48   0.138    -14.80477      2.0445
    17 1999  |  -3.714768   4.296375    -0.86   0.387    -12.13745    4.707911
    17 2000  |  -1.939261   4.377589    -0.44   0.658    -10.52116    6.642633
    17 2001  |   .4694426   4.421005     0.11   0.915    -8.197564    9.136449
    17 2002  |  -.2052819   4.441263    -0.05   0.963    -8.912003    8.501439
    17 2003  |   .9391036   4.413468     0.21   0.832    -7.713127    9.591334
    17 2004  |   .2734495   4.544421     0.06   0.952    -8.635504    9.182403
    17 2005  |   .6912492   4.489007     0.15   0.878     -8.10907    9.491568
    17 2006  |   .7462926   4.564243     0.16   0.870    -8.201519    9.694104
    17 2007  |   4.530595   4.487312     1.01   0.313    -4.266401    13.32759
    17 2008  |   6.716061   4.410841     1.52   0.128    -1.931019    15.36314
    17 2009  |   7.584821   4.382474     1.73   0.084    -1.006648    16.17629
    21 1997  |          0  (omitted)
    21 1998  |   -4.02903   4.237174    -0.95   0.342    -12.33565    4.277591
    21 1999  |  -5.680759   4.816849    -1.18   0.238    -15.12378    3.762266
    21 2000  |  -1.378625   4.305219    -0.32   0.749    -9.818644    7.061393
    21 2001  |   3.794058   4.336258     0.87   0.382    -4.706808    12.29493
    21 2002  |   6.317892   4.282351     1.48   0.140    -2.077295    14.71308
    21 2003  |   8.153274   4.293801     1.90   0.058    -.2643603    16.57091
    21 2004  |   7.396074   4.308972     1.72   0.086    -1.051302    15.84345
    21 2005  |   10.69381   4.287795     2.49   0.013     2.287952    19.09967
    21 2006  |   8.587963   4.280575     2.01   0.045     .1962579    16.97967
    21 2007  |   9.344499   4.272103     2.19   0.029     .9694021     17.7196
    21 2008  |   10.84844   4.271437     2.54   0.011     2.474654    19.22224
    21 2009  |   10.66409   4.271164     2.50   0.013     2.290829    19.03734
    22 1997  |          0  (omitted)
    22 1998  |  -5.091159   4.259214    -1.20   0.232    -13.44099    3.258671
    22 1999  |  -4.248869   4.305592    -0.99   0.324    -12.68962     4.19188
    22 2000  |   4.874856   4.343528     1.12   0.262    -3.640262    13.38997
    22 2001  |   7.004008   4.718063     1.48   0.138    -2.245356    16.25337
    22 2002  |   7.520915   4.654599     1.62   0.106    -1.604033    16.64586
    22 2003  |    10.2596      4.841     2.12   0.034     .7692311    19.74997
    22 2004  |   7.848029   4.972766     1.58   0.115    -1.900659    17.59672
    22 2005  |   11.13121   5.001817     2.23   0.026     1.325576    20.93685
    22 2006  |   11.71687   4.959147     2.36   0.018     1.994883    21.43886
    22 2007  |   12.10859   4.910435     2.47   0.014     2.482101    21.73508
    22 2008  |   13.25629   4.803944     2.76   0.006      3.83856    22.67401
    22 2009  |   12.97727   4.995204     2.60   0.009     3.184592    22.76994
    23 1997  |          0  (omitted)
    23 1998  |  -5.645112    4.20485    -1.34   0.179    -13.88837    2.598141
    23 1999  |  -3.273235   4.268319    -0.77   0.443    -11.64091    5.094444
    23 2000  |  -4.195895    4.52041    -0.93   0.353    -13.05778    4.665986
    23 2001  |  -2.503867   4.639811    -0.54   0.589    -11.59982     6.59209
    23 2002  |   .3073237   4.344635     0.07   0.944    -8.209966    8.824614
    23 2003  |   2.376137   4.342037     0.55   0.584     -6.13606    10.88833
    23 2004  |   -.358322   4.844362    -0.07   0.941    -9.855284     9.13864
    23 2005  |   .3916604   4.492333     0.09   0.931    -8.415178    9.198499
    23 2006  |   1.147878   4.777634     0.24   0.810    -8.218269    10.51403
    23 2007  |   .0780799   4.845439     0.02   0.987    -9.420993    9.577153
    23 2008  |   2.010454   5.028531     0.40   0.689    -7.847556    11.86846
    23 2009  |   2.465063   4.972588     0.50   0.620    -7.283275     12.2134
    24 1997  |          0  (omitted)
    24 1998  |  -5.368988   4.274359    -1.26   0.209    -13.74851    3.010531
    24 1999  |  -5.275839   4.247069    -1.24   0.214    -13.60186    3.050181
    24 2000  |  -4.378341   4.359161    -1.00   0.315    -12.92411    4.167426
    24 2001  |  -3.702146   4.451441    -0.83   0.406    -12.42882    5.024528
    24 2002  |   -2.09239   4.450712    -0.47   0.638    -10.81763    6.632854
    24 2003  |  -3.421367   4.391105    -0.78   0.436    -12.02976    5.187023
    24 2004  |  -2.226267   4.434774    -0.50   0.616    -10.92027    6.467731
    24 2005  |  -2.190652   4.296113    -0.51   0.610    -10.61282    6.231515
    24 2006  |  -3.840636   4.315703    -0.89   0.374    -12.30121    4.619934
    24 2007  |  -1.922926   4.323074    -0.44   0.656    -10.39795    6.552094
    24 2008  |   .2147778   4.341329     0.05   0.961    -8.296031    8.725587
    24 2009  |    1.23547   4.515728     0.27   0.784    -7.617233    10.08817
    25 1997  |          0  (omitted)
    25 1998  |  -4.743176   4.608803    -1.03   0.303    -13.77834    4.291993
    25 1999  |   -8.48963   6.415841    -1.32   0.186    -21.06734    4.088085
    25 2000  |  -4.402397   4.529192    -0.97   0.331    -13.28149    4.476701
    25 2001  |  -3.297142    4.70315    -0.70   0.483    -12.51727    5.922987
    25 2002  |  -1.991326    4.81717    -0.41   0.679    -11.43498    7.452327
    25 2003  |  -.6029349   4.777029    -0.13   0.900    -9.967896    8.762026
    25 2004  |   .2617549   4.947994     0.05   0.958     -9.43837     9.96188
    25 2005  |   .3593014   4.825331     0.07   0.941    -9.100352    9.818955
    25 2006  |  -.3156038    4.93225    -0.06   0.949    -9.984863    9.353655
    25 2007  |   .8981814   4.714448     0.19   0.849    -8.344096    10.14046
    25 2008  |   2.999191   4.782775     0.63   0.531    -6.377034    12.37542
    25 2009  |   2.985019   4.697829     0.64   0.525    -6.224677    12.19472
    26 1997  |          0  (omitted)
    26 1998  |  -4.253273    4.20114    -1.01   0.311    -12.48925    3.982706
    26 1999  |  -5.205095   4.276761    -1.22   0.224    -13.58932    3.179133
    26 2000  |  -5.053682   4.246513    -1.19   0.234    -13.37861    3.271248
    26 2001  |  -6.168803    4.27345    -1.44   0.149    -14.54654    2.208933
    26 2002  |  -6.657079   4.260253    -1.56   0.118    -15.00895    1.694787
    26 2003  |   -5.96069   4.316861    -1.38   0.167    -14.42353    2.502151
    26 2004  |  -6.763414   4.340915    -1.56   0.119    -15.27341    1.746583
    26 2005  |  -6.966176   4.297332    -1.62   0.105    -15.39073     1.45838
    26 2006  |  -7.609993   4.276962    -1.78   0.075    -15.99461    .7746288
    26 2007  |  -6.942061   4.324095    -1.61   0.108    -15.41908    1.534962
    26 2008  |  -6.890793   4.349887    -1.58   0.113    -15.41838    1.636792
    26 2009  |  -6.966405   4.298547    -1.62   0.105    -15.39334    1.460532
    27 1997  |          0  (omitted)
    27 1998  |  -.0041605    4.79979    -0.00   0.999    -9.413743    9.405422
    27 1999  |  -7.609479   4.425677    -1.72   0.086    -16.28564    1.066687
    27 2000  |  -7.351681   4.774145    -1.54   0.124    -16.71099    2.007627
    27 2001  |  -4.538925   4.870734    -0.93   0.351    -14.08759    5.009737
    27 2002  |   -4.33535   4.499323    -0.96   0.335    -13.15589    4.485192
    27 2003  |  -6.004257   4.560029    -1.32   0.188    -14.94381    2.935294
    27 2004  |  -6.169516   4.617222    -1.34   0.182    -15.22119    2.882157
    27 2005  |   -6.23497   4.647976    -1.34   0.180    -15.34693    2.876995
    27 2006  |  -5.997662    4.50225    -1.33   0.183    -14.82394    2.828619
    27 2007  |  -3.557414   4.493531    -0.79   0.429     -12.3666    5.251773
    27 2008  |  -4.718759   4.731255    -1.00   0.319    -13.99398    4.556466
    27 2009  |  -3.518518   4.616085    -0.76   0.446    -12.56796    5.530926
    28 1997  |          0  (omitted)
    28 1998  |  -2.621615   4.280239    -0.61   0.540    -11.01266    5.769431
    28 1999  |  -1.426306   4.320282    -0.33   0.741    -9.895854    7.043243
    28 2000  |  -1.115186    4.48275    -0.25   0.804    -9.903239    7.672866
    28 2001  |  -.7388201   4.491905    -0.16   0.869    -9.544819    8.067179
    28 2002  |  -1.315926   4.500242    -0.29   0.770    -10.13827    7.506417
    28 2003  |    -2.1548   4.625709    -0.47   0.641    -11.22311    6.913512
    28 2004  |  -4.285377   4.469784    -0.96   0.338    -13.04801    4.477257
    28 2005  |  -2.454456   4.526426    -0.54   0.588    -11.32813    6.419219
    28 2006  |  -3.610211   4.503631    -0.80   0.423     -12.4392    5.218776
    28 2007  |  -3.049087   4.579274    -0.67   0.506    -12.02637    5.928192
    28 2008  |  -1.298946   4.908358    -0.26   0.791    -10.92137    8.323475
    28 2009  |    .056191   4.842531     0.01   0.991    -9.437182    9.549564
    29 1997  |          0  (omitted)
    29 1998  |  -4.962631   4.178302    -1.19   0.235    -13.15384    3.228577
    29 1999  |  -2.957652   4.221561    -0.70   0.484    -11.23367    5.318361
    29 2000  |  -1.201105   4.372234    -0.27   0.784      -9.7725     7.37029
    29 2001  |    -.85932   4.367916    -0.20   0.844     -9.42225     7.70361
    29 2002  |  -.1614409   4.368798    -0.04   0.971    -8.726099    8.403217
    29 2003  |   .5223456   4.633643     0.11   0.910    -8.561519    9.606211
    29 2004  |  -.2915739   4.670401    -0.06   0.950      -9.4475    8.864352
    29 2005  |    .984633   4.583442     0.21   0.830    -8.000817    9.970083
    29 2006  |   2.738308   4.659785     0.59   0.557    -6.396806    11.87342
    29 2007  |   1.800921   4.641629     0.39   0.698      -7.2986    10.90044
    29 2008  |    2.55203   4.778574     0.53   0.593    -6.815961    11.92002
    29 2009  |   3.325137   4.713139     0.71   0.481    -5.914575    12.56485
    31 1997  |   3.882685   4.251931     0.91   0.361    -4.452865    12.21824
    31 1998  |  -2.898653   .7882706    -3.68   0.000    -4.443991   -1.353315
    31 1999  |  -3.192595    .810527    -3.94   0.000    -4.781564   -1.603625
    31 2000  |  -4.630413   .5077026    -9.12   0.000    -5.625721   -3.635105
    31 2001  |  -3.891335   .4029604    -9.66   0.000    -4.681305   -3.101366
    31 2002  |  -4.699962   .4035848   -11.65   0.000    -5.491156   -3.908768
    31 2003  |  -1.582651   .3519271    -4.50   0.000    -2.272574   -.8927272
    31 2004  |  -2.471337   .3450457    -7.16   0.000    -3.147769   -1.794904
    31 2005  |  -1.710675   .2783507    -6.15   0.000    -2.256358   -1.164992
    31 2006  |   .4560611   .2505762     1.82   0.069    -.0351723    .9472944
    31 2007  |          0  (omitted)
    31 2008  |  -.1379648   .2388551    -0.58   0.564      -.60622    .3302904
    31 2009  |  -.0000644   .3536377    -0.00   1.000    -.6933411    .6932124
    32 1997  |    2.68412   4.349577     0.62   0.537    -5.842859     11.2111
    32 1998  |   .5747553   .7043686     0.82   0.415    -.8060998     1.95561
    32 1999  |          0  (omitted)
    32 2000  |   .5231803   .6762914     0.77   0.439    -.8026317    1.848992
    32 2001  |  -.0040384     .64917    -0.01   0.995    -1.276681    1.268604
    32 2002  |  -1.263712   .6082908    -2.08   0.038    -2.456215   -.0712093
    32 2003  |   .6912335   .6553839     1.05   0.292    -.5935912    1.976058
    32 2004  |  -.9246563   .6897528    -1.34   0.180    -2.276858    .4275458
    32 2005  |   .0492893   .8327413     0.06   0.953     -1.58323    1.681808
    32 2006  |   2.011022   .8713095     2.31   0.021     .3028931     3.71915
    32 2007  |   2.065056   .9482778     2.18   0.029     .2060373    3.924074
    32 2008  |   3.974115   .8970049     4.43   0.000     2.215613    5.732617
    32 2009  |   3.258645    1.04576     3.12   0.002     1.208521    5.308769
    33 1997  |          0  (omitted)
    33 1998  |  -5.965355   4.172401    -1.43   0.153    -14.14499    2.214284
    33 1999  |  -8.462228   4.226026    -2.00   0.045    -16.74699   -.1774605
    33 2000  |   -10.1203   4.355857    -2.32   0.020    -18.65959   -1.581012
    33 2001  |  -8.852325   4.333055    -2.04   0.041    -17.34691    -.357736
    33 2002  |  -8.010268   4.286201    -1.87   0.062      -16.413     .392467
    33 2003  |   -8.35507   4.309583    -1.94   0.053    -16.80364    .0935039
    33 2004  |  -9.889584   4.353735    -2.27   0.023    -18.42471   -1.354455
    33 2005  |   -10.1253   4.348939    -2.33   0.020    -18.65103   -1.599577
    33 2006  |  -8.824204    4.29855    -2.05   0.040    -17.25115   -.3972616
    33 2007  |  -8.225568   4.278128    -1.92   0.055    -16.61248    .1613408
    33 2008  |  -7.789068    4.30658    -1.81   0.071    -16.23175    .6536189
    33 2009  |  -7.663233   4.277193    -1.79   0.073    -16.04831    .7218428
    35 1997  |          0  (omitted)
    35 1998  |  -8.149013   4.170994    -1.95   0.051    -16.32589    .0278685
    35 1999  |  -8.184681   4.167598    -1.96   0.050     -16.3549   -.0144589
    35 2000  |  -8.521441   4.211425    -2.02   0.043    -16.77758   -.2652984
    35 2001  |  -9.405325    4.20367    -2.24   0.025    -17.64626   -1.164386
    35 2002  |  -9.436794   4.211486    -2.24   0.025    -17.69306   -1.180531
    35 2003  |  -9.506426   4.222615    -2.25   0.024    -17.78451   -1.228346
    35 2004  |    -10.826   4.233648    -2.56   0.011    -19.12571   -2.526295
    35 2005  |  -11.02311   4.257411    -2.59   0.010    -19.36941   -2.676818
    35 2006  |  -9.923792   4.258967    -2.33   0.020    -18.27314   -1.574448
    35 2007  |  -9.647002   4.246771    -2.27   0.023    -17.97244   -1.321567
    35 2008  |  -8.847962   4.288162    -2.06   0.039    -17.25454   -.4413822
    35 2009  |  -8.072084   4.285899    -1.88   0.060    -16.47423    .3300576
    41 1997  |   6.190886   4.209075     1.47   0.141     -2.06065    14.44242
    41 1998  |   .4289425    .377788     1.14   0.256    -.3116788    1.169564
    41 1999  |   -1.54168   .3201904    -4.81   0.000    -2.169386   -.9139739
    41 2000  |          0  (omitted)
    41 2001  |  -.5593798   .3093641    -1.81   0.071    -1.165862    .0471024
    41 2002  |   .5272699   .3516644     1.50   0.134    -.1621384    1.216678
    41 2003  |   .6795692   .3403807     2.00   0.046     .0122815    1.346857
    41 2004  |   1.084989   .4817577     2.25   0.024     .1405438    2.029434
    41 2005  |   1.512806    .536191     2.82   0.005     .4616493    2.563963
    41 2006  |   2.911556   .5493523     5.30   0.000     1.834597    3.988515
    41 2007  |   2.669448   .5751665     4.64   0.000     1.541883    3.797014
    41 2008  |   3.479239    .549197     6.34   0.000     2.402584    4.555893
    41 2009  |   3.633194   1.168015     3.11   0.002       1.3434    5.922989
    42 1997  |   7.363974   4.182101     1.76   0.078    -.8346813    15.56263
    42 1998  |          0  (omitted)
    42 1999  |  -1.771723   .4608203    -3.84   0.000    -2.675122   -.8683237
    42 2000  |  -1.028378   .6501059    -1.58   0.114    -2.302855    .2460999
    42 2001  |  -.4006163   .6367108    -0.63   0.529    -1.648834    .8476013
    42 2002  |  -.6741853   .5709263    -1.18   0.238    -1.793438    .4450674
    42 2003  |  -.0603897   .7093986    -0.09   0.932    -1.451106    1.330326
    42 2004  |  -.6372741    .537521    -1.19   0.236    -1.691039    .4164903
    42 2005  |   .1411303   .6603654     0.21   0.831     -1.15346    1.435721
    42 2006  |   .3165711   .6497451     0.49   0.626    -.9571992    1.590341
    42 2007  |   1.476805   .6786701     2.18   0.030     .1463298    2.807281
    42 2008  |    1.05484   .6616335     1.59   0.111    -.2422366    2.351917
    42 2009  |   2.774962   .8012466     3.46   0.001     1.204186    4.345738
    43 1997  |    1.93552   4.181876     0.46   0.644    -6.262695    10.13374
    43 1998  |  -1.405878   .4574241    -3.07   0.002    -2.302619   -.5091365
    43 1999  |  -4.647101   .4395668   -10.57   0.000    -5.508835   -3.785368
    43 2000  |   -3.37126   .4060602    -8.30   0.000    -4.167307   -2.575214
    43 2001  |  -1.916383    .385172    -4.98   0.000     -2.67148   -1.161286
    43 2002  |  -2.873478   .3388763    -8.48   0.000    -3.537816    -2.20914
    43 2003  |  -1.762303   .3503123    -5.03   0.000    -2.449061   -1.075545
    43 2004  |  -2.680452   .3990799    -6.72   0.000    -3.462814    -1.89809
    43 2005  |  -1.567874   .3585567    -4.37   0.000    -2.270794   -.8649541
    43 2006  |  -.9568128   .3730782    -2.56   0.010    -1.688201   -.2254246
    43 2007  |          0  (omitted)
    43 2008  |  -.1378478   .3826362    -0.36   0.719    -.8879737    .6122781
    43 2009  |   .9874022   .4244342     2.33   0.020     .1553349    1.819469
    50 1997  |   3.277749   4.422773     0.74   0.459    -5.392724    11.94822
    50 1998  |  -4.501469   1.292331    -3.48   0.000    -7.034974   -1.967964
    50 1999  |  -2.707109   1.399513    -1.93   0.053    -5.450736    .0365185
    50 2000  |  -4.538487   1.020742    -4.45   0.000    -6.539565    -2.53741
    50 2001  |  -4.399682   1.047806    -4.20   0.000    -6.453818   -2.345547
    50 2002  |   -4.66711   1.084397    -4.30   0.000    -6.792979   -2.541242
    50 2003  |   -1.37386   .7865649    -1.75   0.081    -2.915854    .1681344
    50 2004  |   -2.00959   .4940374    -4.07   0.000    -2.978109   -1.041072
    50 2005  |  -1.352097   .5515297    -2.45   0.014    -2.433324   -.2708695
    50 2006  |          0  (omitted)
    50 2007  |   .7228219   .8124756     0.89   0.374    -.8699677    2.315612
    50 2008  |   .5676326   .7691374     0.74   0.461    -.9401961    2.075461
    50 2009  |   1.255917   .9534521     1.32   0.188    -.6132449     3.12508
    51 1997  |          0  (omitted)
    51 1998  |  -3.034085    4.19376    -0.72   0.469     -11.2556    5.187427
    51 1999  |   -1.39402   4.243878    -0.33   0.743    -9.713783    6.925743
    51 2000  |   .9610831   4.370802     0.22   0.826    -7.607505    9.529671
    51 2001  |   .7197743   4.317054     0.17   0.868    -7.743444    9.182993
    51 2002  |   1.164269   4.457527     0.26   0.794    -7.574337    9.902874
    51 2003  |   1.503627   4.531724     0.33   0.740    -7.380435    10.38769
    51 2004  |   1.779035    4.47317     0.40   0.691    -6.990237    10.54831
    51 2005  |   2.583313   4.588039     0.56   0.573    -6.411149    11.57778
    51 2006  |    2.69087   4.763439     0.56   0.572    -6.647449    12.02919
    51 2007  |    1.33313   4.576346     0.29   0.771    -7.638409    10.30467
    51 2008  |   3.882821    4.46376     0.87   0.384    -4.868003    12.63364
    51 2009  |    4.31105   4.509393     0.96   0.339    -4.529234    13.15133
    52 1997  |   6.892895   4.322017     1.59   0.111    -1.580054    15.36584
    52 1998  |  -.6566387   .6428928    -1.02   0.307    -1.916976    .6036983
    52 1999  |    .489818   .6104564     0.80   0.422      -.70693    1.686566
    52 2000  |          0  (omitted)
    52 2001  |   .6397536    .467523     1.37   0.171    -.2767857    1.556293
    52 2002  |   2.267629   .5754013     3.94   0.000     1.139603    3.395654
    52 2003  |   2.435367   .6570256     3.71   0.000     1.147324     3.72341
    52 2004  |   3.324268   .4864377     6.83   0.000     2.370648    4.277888
    52 2005  |   3.020564   .6958751     4.34   0.000     1.656359    4.384768
    52 2006  |   3.273417   1.150668     2.84   0.004     1.017629    5.529204
    52 2007  |   3.994307    .847354     4.71   0.000     2.333141    5.655472
    52 2008  |   6.211657   .8788538     7.07   0.000     4.488738    7.934575
    52 2009  |   6.025664   1.113286     5.41   0.000     3.843162    8.208167
    53 1997  |   7.326563   4.156165     1.76   0.078    -.8212459    15.47437
    53 1998  |          0  (omitted)
    53 1999  |          0  (omitted)
    53 2000  |          0  (omitted)
    53 2001  |          0  (omitted)
    53 2002  |          0  (omitted)
    53 2003  |          0  (omitted)
    53 2004  |          0  (omitted)
    53 2005  |          0  (omitted)
    53 2006  |          0  (omitted)
    53 2007  |          0  (omitted)
    53 2008  |          0  (omitted)
    53 2009  |          0  (omitted)
             |
       _cons |   48.72926   2.784101    17.50   0.000     43.27127    54.18726
-------------+----------------------------------------------------------------
  fips_month |   absorbed                                   (63084 categories)

. //
. local holder

. lincom tavg_bin_0C_10C_ + l1_tavg_bin_0C_10C_ + l2_tavg_bin_0C_10C_ 

 ( 1)  tavg_bin_0C_10C_ + l1_tavg_bin_0C_10C_ + l2_tavg_bin_0C_10C_ = 0

------------------------------------------------------------------------------
   mrate_tot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.104711   .0777849    14.20   0.000     .9522207    1.257202
------------------------------------------------------------------------------

. local reg_c_010_cont = r(estimate)

. local reg_se_010_cont = r(se)

. local reg_se_010_left = `reg_c_010_cont' - 1.96 * `reg_se_010_cont'

. local reg_se_010_right = `reg_c_010_cont'+ 1.96 * `reg_se_010_cont'

. local holder "`holder' `reg_c_010_cont' , `reg_se_010_cont' , `reg_se_010_lef
> t' , `reg_se_010_right'"

. 
. local bins 10C_13C_ 13C_16C_ 16C_19C_ 19C_22C_ 

. foreach i of local bins{
  2. lincom tavg_bin_`i' + l1_tavg_bin_`i' + l2_tavg_bin_`i'
  3. local reg_c_010_cont = r(estimate)
  4. local reg_se_010_cont = r(se)
  5. local reg_se_010_left = `reg_c_010_cont' - 1.96 * `reg_se_010_cont'
  6. local reg_se_010_right = `reg_c_010_cont'+ 1.96 * `reg_se_010_cont'
  7. local holder "`holder' \  `reg_c_010_cont' , `reg_se_010_cont' , `reg_se_0
> 10_left' , `reg_se_010_right'"
  8. }

 ( 1)  tavg_bin_10C_13C_ + l1_tavg_bin_10C_13C_ + l2_tavg_bin_10C_13C_ = 0

------------------------------------------------------------------------------
   mrate_tot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7261866   .0462939    15.69   0.000     .6354312     .816942
------------------------------------------------------------------------------

 ( 1)  tavg_bin_13C_16C_ + l1_tavg_bin_13C_16C_ + l2_tavg_bin_13C_16C_ = 0

------------------------------------------------------------------------------
   mrate_tot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .3551265   .0322546    11.01   0.000     .2918942    .4183588
------------------------------------------------------------------------------

 ( 1)  tavg_bin_16C_19C_ + l1_tavg_bin_16C_19C_ + l2_tavg_bin_16C_19C_ = 0

------------------------------------------------------------------------------
   mrate_tot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1727887   .0261916     6.60   0.000     .1214424    .2241351
------------------------------------------------------------------------------

 ( 1)  tavg_bin_19C_22C_ + l1_tavg_bin_19C_22C_ + l2_tavg_bin_19C_22C_ = 0

------------------------------------------------------------------------------
   mrate_tot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0090749   .0177157     0.51   0.608    -.0256551    .0438049
------------------------------------------------------------------------------

. di "`holder'"
 1.104711482273131 , .0777849478181711 , .9522529845495157 , 1.257169979996746 
> \  .7261865971610095 , .0462939408377864 , .6354504731189482 , .8169227212030
> 709 \  .3551265166805989 , .0322545516570801 , .2919075954327219 , .418345437
> 9284759 \  .1727887344111685 , .0261915660892551 , .1214532648762285 , .22412
> 42039461085 \  .0090749107591104 , .0177156505721088 , -.0256477643622229 , .
> 0437975858804436

. 
. local holder "`holder' \  0 , 0 , 0 , 0 "

. 
. local bins 25C_28C_ 28C_31C_ 31C_Inf_  

. foreach i of local bins{
  2. lincom tavg_bin_`i' + l1_tavg_bin_`i' + l2_tavg_bin_`i'
  3. local reg_c_010_cont = r(estimate)
  4. local reg_se_010_cont = r(se)
  5. local reg_se_010_left = `reg_c_010_cont' - 1.96 * `reg_se_010_cont'
  6. local reg_se_010_right = `reg_c_010_cont'+ 1.96 * `reg_se_010_cont'
  7. local holder "`holder' \  `reg_c_010_cont' , `reg_se_010_cont' , `reg_se_0
> 10_left' , `reg_se_010_right'"
  8. }

 ( 1)  tavg_bin_25C_28C_ + l1_tavg_bin_25C_28C_ + l2_tavg_bin_25C_28C_ = 0

------------------------------------------------------------------------------
   mrate_tot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0136689   .0125389     1.09   0.276    -.0109126    .0382504
------------------------------------------------------------------------------

 ( 1)  tavg_bin_28C_31C_ + l1_tavg_bin_28C_31C_ + l2_tavg_bin_28C_31C_ = 0

------------------------------------------------------------------------------
   mrate_tot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0144928   .0238338     0.61   0.543    -.0322313    .0612168
------------------------------------------------------------------------------

 ( 1)  tavg_bin_31C_Inf_ + l1_tavg_bin_31C_Inf_ + l2_tavg_bin_31C_Inf_ = 0

------------------------------------------------------------------------------
   mrate_tot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6893044   .2490312     2.77   0.006     .2010998    1.177509
------------------------------------------------------------------------------

. di "`holder'"
 1.104711482273131 , .0777849478181711 , .9522529845495157 , 1.257169979996746 
> \  .7261865971610095 , .0462939408377864 , .6354504731189482 , .8169227212030
> 709 \  .3551265166805989 , .0322545516570801 , .2919075954327219 , .418345437
> 9284759 \  .1727887344111685 , .0261915660892551 , .1214532648762285 , .22412
> 42039461085 \  .0090749107591104 , .0177156505721088 , -.0256477643622229 , .
> 0437975858804436 \  0 , 0 , 0 , 0  \  .0136689038972793 , .0125389098813237 ,
>  -.0109073594701152 , .0382451672646738 \  .0144927503182036 , .0238337522018
> 446 , -.0322214039974118 , .061206904633819 \  .6893043969677365 , .249031217
> 2725545 , .2012032111135297 , 1.177405582821943

. 
. matrix b2 = (`holder')

. matrix list b2

b2[9,4]
            c1          c2          c3          c4
r1   1.1047115   .07778495   .95225298     1.25717
r2    .7261866   .04629394   .63545047   .81692272
r3   .35512652   .03225455    .2919076   .41834544
r4   .17278873   .02619157   .12145326    .2241242
r5   .00907491   .01771565  -.02564776   .04379759
r6           0           0           0           0
r7    .0136689   .01253891  -.01090736   .03824517
r8   .01449275   .02383375   -.0322214    .0612069
r9    .6893044   .24903122   .20120321   1.1774056

. 
. 
. ************
. ** 3-lag ***
. ************
. areg mrate_tot `three' `three_l1' `three_l2' `three_l3' `precip'  i.month#i.y
> ear i.state_fips#i.year [aw=pop_tot_weights], absorb(fips_month) vce(cluster 
> fips)
(sum of wgt is   1.5034e+02)
note: 1.month#1997.year identifies no observations in the sample
note: 2.month#1997.year identifies no observations in the sample
note: 3.month#1997.year identifies no observations in the sample
note: 12.month#2009.year omitted because of collinearity
note: 53.state_fips#1998.year omitted because of collinearity
note: 53.state_fips#1999.year omitted because of collinearity
note: 53.state_fips#2000.year omitted because of collinearity
note: 53.state_fips#2001.year omitted because of collinearity
note: 53.state_fips#2002.year omitted because of collinearity
note: 53.state_fips#2003.year omitted because of collinearity
note: 53.state_fips#2004.year omitted because of collinearity
note: 53.state_fips#2005.year omitted because of collinearity
note: 53.state_fips#2006.year omitted because of collinearity
note: 53.state_fips#2007.year omitted because of collinearity
note: 53.state_fips#2008.year omitted because of collinearity
note: 53.state_fips#2009.year omitted because of collinearity
note: 1b.month#2003.year omitted because of collinearity
note: 2.month#2004.year omitted because of collinearity
note: 3.month#2003.year omitted because of collinearity
note: 4.month#2002.year omitted because of collinearity
note: 5.month#2002.year omitted because of collinearity
note: 6.month#1997b.year omitted because of collinearity
note: 7.month#2000.year omitted because of collinearity
note: 8.month#2003.year omitted because of collinearity
note: 9.month#1998.year omitted because of collinearity
note: 10.month#2002.year omitted because of collinearity
note: 11.month#2002.year omitted because of collinearity
note: 12.state_fips#2001.year omitted because of collinearity
note: 13.state_fips#1998.year omitted because of collinearity
note: 14.state_fips#1997b.year omitted because of collinearity
note: 14.state_fips#1999.year omitted because of collinearity
note: 15.state_fips#2001.year omitted because of collinearity
note: 16.state_fips#1998.year omitted because of collinearity
note: 17.state_fips#2000.year omitted because of collinearity
note: 21.state_fips#2006.year omitted because of collinearity
note: 22.state_fips#1997b.year omitted because of collinearity
note: 23.state_fips#1997b.year omitted because of collinearity
note: 24.state_fips#2004.year omitted because of collinearity
note: 25.state_fips#1997b.year omitted because of collinearity
note: 26.state_fips#1997b.year omitted because of collinearity
note: 27.state_fips#2008.year omitted because of collinearity
note: 28.state_fips#2003.year omitted because of collinearity
note: 29.state_fips#2005.year omitted because of collinearity
note: 31.state_fips#2007.year omitted because of collinearity
note: 32.state_fips#1997b.year omitted because of collinearity
note: 33.state_fips#2005.year omitted because of collinearity
note: 35.state_fips#1999.year omitted because of collinearity
note: 41.state_fips#1997b.year omitted because of collinearity
note: 42.state_fips#2000.year omitted because of collinearity
note: 43.state_fips#2007.year omitted because of collinearity
note: 50.state_fips#1997b.year omitted because of collinearity
note: 51.state_fips#2001.year omitted because of collinearity
note: 52.state_fips#1997b.year omitted because of collinearity

Linear regression, absorbing indicators         Number of obs     =    804,249
                                                F( 476,   5256)   =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5214
                                                Adj R-squared     =     0.4803
                                                Root MSE          =    12.9461

                               (Std. Err. adjusted for 5,257 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
   mrate_tot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
tavg~0C_10C_ |    .755532   .0427936    17.66   0.000     .6716388    .8394252
tav~10C_13C_ |   .4729832   .0263764    17.93   0.000     .4212746    .5246919
tavg~3C_16C_ |   .2077908   .0189358    10.97   0.000     .1706688    .2449127
tavg~6C_19C_ |   .1339708   .0120131    11.15   0.000     .1104201    .1575215
tavg~9C_22C_ |   .0028606   .0093848     0.30   0.761    -.0155375    .0212586
tavg~5C_28C_ |   .0335244   .0064758     5.18   0.000     .0208292    .0462196
tavg~8C_31C_ |   .1206571   .0116076    10.39   0.000     .0979013    .1434129
tavg~1C_Inf_ |    .616746    .144224     4.28   0.000     .3340071    .8994849
l1_tavg_~0C_ |   .2789403   .0404134     6.90   0.000     .1997133    .3581674
l1_~10C_13C_ |   .1794788   .0261251     6.87   0.000     .1282627    .2306949
l1_tavg_~6C_ |   .1394681   .0179543     7.77   0.000     .1042701     .174666
l1_tavg_~9C_ |   .0457432    .011883     3.85   0.000     .0224476    .0690389
l1_tavg_~2C_ |   .0113147   .0078232     1.45   0.148     -.004022    .0266515
l1_tavg_~8C_ |  -.0296177    .007015    -4.22   0.000      -.04337   -.0158654
l1_tavg_~1C_ |  -.1015364   .0111049    -9.14   0.000    -.1233066   -.0797661
l1_t~1C_Inf_ |    .038086   .1152741     0.33   0.741    -.1878991    .2640711
l2_tavg_~0C_ |   .0601732   .0435447     1.38   0.167    -.0251926     .145539
l2_~10C_13C_ |    .065914   .0249162     2.65   0.008      .017068    .1147601
l2_tavg_~6C_ |   .0090979   .0159906     0.57   0.569    -.0222504    .0404462
l2_tavg_~9C_ |  -.0078833   .0139518    -0.57   0.572    -.0352346    .0194681
l2_tavg_~2C_ |  -.0040893    .009127    -0.45   0.654    -.0219821    .0138034
l2_tavg_~8C_ |   .0052555   .0065877     0.80   0.425     -.007659    .0181701
l2_tavg_~1C_ |  -.0163776   .0096249    -1.70   0.089    -.0352465    .0024912
l2_t~1C_Inf_ |   .0133338   .1279443     0.10   0.917    -.2374902    .2641577
l3_tavg_~0C_ |   .0476047   .0413867     1.15   0.250    -.0335303    .1287398
l3_~10C_13C_ |  -.0146533   .0260975    -0.56   0.574    -.0658153    .0365088
l3_tavg_~6C_ |  -.0031998    .019661    -0.16   0.871    -.0417435     .035344
l3_tavg_~9C_ |   .0366334   .0113094     3.24   0.001     .0144622    .0588045
l3_tavg_~2C_ |   .0256376   .0073862     3.47   0.001     .0111576    .0401176
l3_tavg_~8C_ |   .0072351   .0078887     0.92   0.359      -.00823    .0227002
l3_tavg_~1C_ |   .0261307    .011682     2.24   0.025     .0032292    .0490322
l3_t~1C_Inf_ |   .0160689    .176774     0.09   0.928    -.3304815    .3626194
     precip_ |   .0021279   .0009802     2.17   0.030     .0002063    .0040494
   precip_sq |  -4.50e-06   2.13e-06    -2.11   0.035    -8.68e-06   -3.25e-07
             |
  month#year |
     1 1997  |          0  (empty)
     1 1998  |   2.175859   .3803779     5.72   0.000      1.43016    2.921557
     1 1999  |   2.830411   .3253611     8.70   0.000     2.192569    3.468254
     1 2000  |   1.006962   .3254513     3.09   0.002     .3689425    1.644982
     1 2001  |   .9502369   .2662133     3.57   0.000     .4283482    1.472126
     1 2002  |   2.451752   .3859439     6.35   0.000     1.695142    3.208363
     1 2003  |          0  (omitted)
     1 2004  |   .4812083   .3051486     1.58   0.115    -.1170098    1.079426
     1 2005  |  -.5364075   .2677782    -2.00   0.045    -1.061364    -.011451
     1 2006  |  -.9373807   .2701427    -3.47   0.001    -1.466973   -.4077889
     1 2007  |  -1.946907   .2521466    -7.72   0.000    -2.441219   -1.452595
     1 2008  |  -1.415314   .3142009    -4.50   0.000    -2.031278   -.7993492
     1 2009  |  -1.550072   .2561021    -6.05   0.000    -2.052138   -1.048005
     2 1997  |          0  (empty)
     2 1998  |  -1.094235   .4975712    -2.20   0.028    -2.069681   -.1187884
     2 1999  |  -1.711407   .3014107    -5.68   0.000    -2.302297   -1.120516
     2 2000  |  -1.883644   .3133172    -6.01   0.000    -2.497876   -1.269412
     2 2001  |  -3.266353   .2934097   -11.13   0.000    -3.841558   -2.691148
     2 2002  |  -1.274885   .2921417    -4.36   0.000    -1.847604   -.7021659
     2 2003  |  -2.359431   .3406909    -6.93   0.000    -3.027327   -1.691535
     2 2004  |          0  (omitted)
     2 2005  |  -3.378366   .2677805   -12.62   0.000    -3.903327   -2.853405
     2 2006  |  -5.787315   .2936019   -19.71   0.000    -6.362897   -5.211733
     2 2007  |  -4.802678   .2664426   -18.03   0.000    -5.325016    -4.28034
     2 2008  |   -3.60886   .2743862   -13.15   0.000    -4.146771   -3.070949
     2 2009  |  -5.072357   .2769878   -18.31   0.000    -5.615368   -4.529346
     3 1997  |          0  (empty)
     3 1998  |    1.18041    .444155     2.66   0.008     .3096813    2.051138
     3 1999  |   2.227732   .4519339     4.93   0.000     1.341754     3.11371
     3 2000  |  -.5450752     .31472    -1.73   0.083    -1.162057    .0719067
     3 2001  |  -1.073615   .2822747    -3.80   0.000     -1.62699    -.520239
     3 2002  |   2.160677   .4358655     4.96   0.000       1.3062    3.015154
     3 2003  |          0  (omitted)
     3 2004  |   3.177487   .3289446     9.66   0.000     2.532619    3.822355
     3 2005  |  -.5726824    .287609    -1.99   0.047    -1.136516   -.0088493
     3 2006  |  -2.851304   .3091161    -9.22   0.000      -3.4573   -2.245309
     3 2007  |  -1.403954    .277128    -5.07   0.000     -1.94724   -.8606683
     3 2008  |  -1.824977   .2485902    -7.34   0.000    -2.312317   -1.337637
     3 2009  |  -.8682467   .2898553    -3.00   0.003    -1.436484   -.3000098
     4 1997  |  -7.263764   4.143168    -1.75   0.080     -15.3861    .8585673
     4 1998  |    .999132   .3194401     3.13   0.002     .3728966    1.625367
     4 1999  |   2.106666   .3353358     6.28   0.000     1.449269    2.764064
     4 2000  |   .0773458   .2738943     0.28   0.778    -.4596008    .6142924
     4 2001  |  -.4779459   .2686783    -1.78   0.075    -1.004667    .0487752
     4 2002  |          0  (omitted)
     4 2003  |    .459439   .3462161     1.33   0.185    -.2192885    1.138166
     4 2004  |   1.634232   .2423167     6.74   0.000     1.159191    2.109273
     4 2005  |  -1.408553   .2906285    -4.85   0.000    -1.978305   -.8388002
     4 2006  |  -1.775453   .3092927    -5.74   0.000    -2.381795   -1.169111
     4 2007  |  -1.527437   .2633527    -5.80   0.000    -2.043718   -1.011156
     4 2008  |  -1.388399   .2718052    -5.11   0.000     -1.92125    -.855548
     4 2009  |  -1.343712   .2621362    -5.13   0.000    -1.857608   -.8298165
     5 1997  |   -6.46573   4.135974    -1.56   0.118    -14.57396    1.642498
     5 1998  |   3.375235   .3281654    10.29   0.000     2.731894    4.018576
     5 1999  |   3.860116   .3697541    10.44   0.000     3.135244    4.584988
     5 2000  |   1.483228   .3249365     4.56   0.000      .846218    2.120239
     5 2001  |    .897133   .3338866     2.69   0.007     .2425765     1.55169
     5 2002  |          0  (omitted)
     5 2003  |   1.113673    .273807     4.07   0.000      .576897    1.650448
     5 2004  |   1.778423   .2994547     5.94   0.000     1.191368    2.365479
     5 2005  |   1.116184   .2825741     3.95   0.000     .5622214    1.670147
     5 2006  |   1.644837   .3762962     4.37   0.000     .9071403    2.382534
     5 2007  |  -.1513031   .2898131    -0.52   0.602    -.7194572     .416851
     5 2008  |   .3290209   .2698739     1.22   0.223     -.200044    .8580858
     5 2009  |    .506997   .3226275     1.57   0.116     -.125487    1.139481
     6 1997  |          0  (omitted)
     6 1998  |     9.9016    4.16523     2.38   0.017     1.736017    18.06718
     6 1999  |   6.493011   4.162598     1.56   0.119    -1.667411    14.65343
     6 2000  |   4.160469    4.14385     1.00   0.315    -3.963198    12.28414
     6 2001  |   2.873566   4.136387     0.69   0.487    -5.235472     10.9826
     6 2002  |   3.893949   4.130118     0.94   0.346    -4.202798    11.99069
     6 2003  |   4.088589   4.148578     0.99   0.324    -4.044348    12.22153
     6 2004  |   5.634465   4.143918     1.36   0.174    -2.489336    13.75827
     6 2005  |    3.12796   4.134815     0.76   0.449    -4.977994    11.23391
     6 2006  |   3.633591   4.146548     0.88   0.381    -4.495365    11.76255
     6 2007  |   4.406628   4.139529     1.06   0.287    -3.708568    12.52182
     6 2008  |   2.327338    4.14043     0.56   0.574    -5.789624     10.4443
     6 2009  |   2.557893   4.140227     0.62   0.537    -5.558673    10.67446
     7 1997  |  -6.086608   4.132901    -1.47   0.141    -14.18881    2.015595
     7 1998  |   4.265501   .3299386    12.93   0.000     3.618685    4.912318
     7 1999  |   .8972696   .3658021     2.45   0.014     .1801456    1.614394
     7 2000  |          0  (omitted)
     7 2001  |   .4186351   .3826132     1.09   0.274    -.3314456    1.168716
     7 2002  |   .5422405   .3613449     1.50   0.134    -.1661456    1.250627
     7 2003  |   1.184853   .3069448     3.86   0.000     .5831133    1.786592
     7 2004  |  -.8102814   .3451461    -2.35   0.019    -1.486911   -.1336517
     7 2005  |  -.3483849   .3051196    -1.14   0.254    -.9465459    .2497762
     7 2006  |  -.3453068   .3118913    -1.11   0.268    -.9567434    .2661298
     7 2007  |  -1.602558   .3020408    -5.31   0.000    -2.194683   -1.010432
     7 2008  |  -1.140662   .3128178    -3.65   0.000    -1.753914   -.5274089
     7 2009  |  -1.134249     .41383    -2.74   0.006    -1.945528   -.3229703
     8 1997  |  -5.212297   4.132566    -1.26   0.207    -13.31384    2.889249
     8 1998  |   1.816285   .3211453     5.66   0.000     1.186707    2.445864
     8 1999  |   1.626699   .3033492     5.36   0.000     1.032008    2.221389
     8 2000  |   1.444971      .2807     5.15   0.000     .8946825     1.99526
     8 2001  |   1.634935    .332474     4.92   0.000     .9831476    2.286722
     8 2002  |   1.107627   .3169434     3.49   0.000     .4862868    1.728968
     8 2003  |          0  (omitted)
     8 2004  |   1.766732   .2673848     6.61   0.000     1.242547    2.290917
     8 2005  |  -.1897803   .2745758    -0.69   0.489     -.728063    .3485023
     8 2006  |  -.5361396   .2797515    -1.92   0.055    -1.084569    .0122896
     8 2007  |  -.1254077   .2529318    -0.50   0.620    -.6212592    .3704438
     8 2008  |  -.7494224   .2897681    -2.59   0.010    -1.317488   -.1813565
     8 2009  |   1.326063   .2965604     4.47   0.000     .7446814    1.907445
     9 1997  |  -7.376758   4.137174    -1.78   0.075    -15.48734    .7338208
     9 1998  |          0  (omitted)
     9 1999  |  -.5216825   .3141432    -1.66   0.097    -1.137534    .0941688
     9 2000  |  -.6137952   .3926085    -1.56   0.118    -1.383471    .1558806
     9 2001  |   .5105641   .3544419     1.44   0.150    -.1842893    1.205417
     9 2002  |   1.036311   .3011528     3.44   0.001     .4459261    1.626695
     9 2003  |   .2331387   .3809245     0.61   0.541    -.5136315    .9799088
     9 2004  |   .6718896    .307473     2.19   0.029     .0691148    1.274664
     9 2005  |  -2.390416   .3123047    -7.65   0.000    -3.002663   -1.778169
     9 2006  |  -1.681749   .3169324    -5.31   0.000    -2.303069    -1.06043
     9 2007  |   -1.66275   .3002063    -5.54   0.000    -2.251279   -1.074221
     9 2008  |  -1.419344   .3423971    -4.15   0.000    -2.090584   -.7481031
     9 2009  |  -1.095505   .2695599    -4.06   0.000    -1.623955   -.5670561
    10 1997  |  -8.991796   4.133942    -2.18   0.030    -17.09604   -.8875534
    10 1998  |  -1.390174   .2719607    -5.11   0.000     -1.92333   -.8570181
    10 1999  |  -1.915025    .337502    -5.67   0.000    -2.576669   -1.253381
    10 2000  |  -1.235424   .2886396    -4.28   0.000    -1.801278   -.6695708
    10 2001  |  -.3722288   .3188932    -1.17   0.243     -.997392    .2529344
    10 2002  |          0  (omitted)
    10 2003  |   -2.06303   .2934625    -7.03   0.000    -2.638339   -1.487722
    10 2004  |  -1.003087   .3253938    -3.08   0.002    -1.640994   -.3651802
    10 2005  |  -2.448063   .2929377    -8.36   0.000    -3.022342   -1.873783
    10 2006  |  -4.055319   .3185069   -12.73   0.000    -4.679725   -3.430913
    10 2007  |  -2.614436   .2652463    -9.86   0.000    -3.134429   -2.094443
    10 2008  |  -1.621357   .2663142    -6.09   0.000    -2.143444   -1.099271
    10 2009  |  -2.191701   .2753892    -7.96   0.000    -2.731578   -1.651824
    11 1997  |  -7.393479   4.140112    -1.79   0.074    -15.50982    .7228601
    11 1998  |   .9978769    .298239     3.35   0.001     .4132046    1.582549
    11 1999  |    -.52963   .3662557    -1.45   0.148    -1.247643    .1883833
    11 2000  |  -.9474958   .3322833    -2.85   0.004    -1.598909   -.2960825
    11 2001  |   .4933873   .3135791     1.57   0.116     -.121358    1.108133
    11 2002  |          0  (omitted)
    11 2003  |   -.709606   .3243163    -2.19   0.029    -1.345401   -.0738113
    11 2004  |  -.9222383   .2778112    -3.32   0.001    -1.466864    -.377613
    11 2005  |  -1.586207   .3018092    -5.26   0.000    -2.177878   -.9945351
    11 2006  |  -2.007482   .3267682    -6.14   0.000    -2.648084    -1.36688
    11 2007  |  -1.860532   .3149448    -5.91   0.000    -2.477955    -1.24311
    11 2008  |  -1.211757   .3485966    -3.48   0.001    -1.895151   -.5283624
    11 2009  |   .3301265   .3187335     1.04   0.300    -.2947236    .9549766
    12 1997  |  -5.873251   4.143863    -1.42   0.156    -13.99694    2.250443
    12 1998  |  -.0657295   .2827314    -0.23   0.816    -.6200005    .4885415
    12 1999  |  -2.101701   .3084715    -6.81   0.000    -2.706433   -1.496969
    12 2000  |  -.7724535   .2995065    -2.58   0.010    -1.359611   -.1852964
    12 2001  |   .2457527   .2722938     0.90   0.367    -.2880563    .7795618
    12 2002  |  -.5876618   .3240816    -1.81   0.070    -1.222996    .0476727
    12 2003  |  -1.727795   .2559826    -6.75   0.000    -2.229627   -1.225963
    12 2004  |  -1.626835    .299209    -5.44   0.000    -2.213409   -1.040261
    12 2005  |   -2.35303   .2424745    -9.70   0.000    -2.828381   -1.877679
    12 2006  |  -2.228515   .2444396    -9.12   0.000    -2.707719   -1.749312
    12 2007  |  -1.050686   .2923418    -3.59   0.000    -1.623797   -.4775743
    12 2008  |  -1.466237   .2659121    -5.51   0.000    -1.987536   -.9449392
    12 2009  |          0  (omitted)
             |
  state_fips#|
        year |
    11 1998  |  -6.243044   4.295795    -1.45   0.146    -14.66459    2.178498
    11 1999  |  -4.533076   5.175269    -0.88   0.381    -14.67875    5.612601
    11 2000  |  -3.643441    5.80959    -0.63   0.531    -15.03265     7.74577
    11 2001  |  -1.953597   5.334626    -0.37   0.714    -12.41168    8.504487
    11 2002  |  -2.834902   5.594868    -0.51   0.612    -13.80317    8.133363
    11 2003  |  -1.125996    5.10218    -0.22   0.825    -11.12839    8.876396
    11 2004  |  -2.759739   5.187661    -0.53   0.595    -12.92971    7.410231
    11 2005  |  -2.273783   5.215394    -0.44   0.663    -12.49812    7.950557
    11 2006  |  -3.187408   4.443194    -0.72   0.473    -11.89791    5.523098
    11 2007  |  -5.613983   4.707026    -1.19   0.233    -14.84171    3.613744
    11 2008  |  -1.288952   4.443412    -0.29   0.772    -9.999886    7.421983
    11 2009  |   1.262913   4.282293     0.29   0.768    -7.132161    9.657986
    12 1997  |    8.07735   5.128274     1.58   0.115    -1.976198     18.1309
    12 1998  |   .2452268   1.025875     0.24   0.811    -1.765914    2.256368
    12 1999  |  -4.780869   2.224094    -2.15   0.032    -9.141017   -.4207219
    12 2000  |   2.027436   1.395446     1.45   0.146    -.7082178     4.76309
    12 2001  |          0  (omitted)
    12 2002  |  -1.447391   .7171544    -2.02   0.044    -2.853311   -.0414705
    12 2003  |  -1.160433   1.207295    -0.96   0.337    -3.527234    1.206367
    12 2004  |  -1.832091    1.89193    -0.97   0.333     -5.54106    1.876878
    12 2005  |  -.4423622   1.999547    -0.22   0.825    -4.362305     3.47758
    12 2006  |   -1.68338   1.775279    -0.95   0.343    -5.163664    1.796904
    12 2007  |  -.8788661   1.385982    -0.63   0.526    -3.595966    1.838233
    12 2008  |   .2745073    1.43432     0.19   0.848    -2.537356    3.086371
    12 2009  |  -.3035203   1.119413    -0.27   0.786    -2.498036    1.890995
    13 1997  |   7.115055   4.362552     1.63   0.103    -1.437359    15.66747
    13 1998  |          0  (omitted)
    13 1999  |   5.194271   .8726333     5.95   0.000     3.483547    6.904994
    13 2000  |   9.682118   1.373276     7.05   0.000     6.989925    12.37431
    13 2001  |   10.70933   1.458863     7.34   0.000     7.849358    13.56931
    13 2002  |   10.79113   1.615542     6.68   0.000     7.623996    13.95826
    13 2003  |   10.85824   1.605649     6.76   0.000     7.710499    14.00598
    13 2004  |   10.18385   1.459588     6.98   0.000     7.322453    13.04525
    13 2005  |   12.02193   1.599418     7.52   0.000     8.886411    15.15746
    13 2006  |   13.14755   1.533583     8.57   0.000     10.14109    16.15401
    13 2007  |   12.57498   1.764294     7.13   0.000     9.116236    16.03373
    13 2008  |   13.84396   1.696379     8.16   0.000     10.51836    17.16957
    13 2009  |   14.32757   1.729781     8.28   0.000     10.93648    17.71866
    14 1997  |          0  (omitted)
    14 1998  |  -4.075134   4.954555    -0.82   0.411    -13.78812    5.637852
    14 1999  |          0  (omitted)
    14 2000  |  -.5957668   1.963352    -0.30   0.762    -4.444753    3.253219
    14 2001  |  -5.008397   3.495552    -1.43   0.152    -11.86113    1.844337
    14 2002  |  -4.982379   3.458817    -1.44   0.150     -11.7631     1.79834
    14 2003  |  -2.904671   3.244118    -0.90   0.371     -9.26449    3.455149
    14 2004  |  -3.904846   2.478702    -1.58   0.115    -8.764132    .9544399
    14 2005  |  -2.590163   2.649437    -0.98   0.328    -7.784161    2.603835
    14 2006  |  -1.651213   1.702321    -0.97   0.332    -4.988469    1.686042
    14 2007  |  -2.522094    2.11332    -1.19   0.233    -6.665079    1.620891
    14 2008  |  -3.306362   2.246898    -1.47   0.141    -7.711216    1.098492
    14 2009  |  -2.934847   1.678977    -1.75   0.081    -6.226339    .3566443
    15 1997  |   2.739563   4.478026     0.61   0.541    -6.039227    11.51835
    15 1998  |  -3.788056   1.193158    -3.17   0.002    -6.127141    -1.44897
    15 1999  |  -2.581594   .7016917    -3.68   0.000    -3.957201   -1.205986
    15 2000  |  -2.063487   .4608175    -4.48   0.000    -2.966881   -1.160093
    15 2001  |          0  (omitted)
    15 2002  |  -1.695705   .9828871    -1.73   0.085    -3.622572    .2311619
    15 2003  |    .960746   1.113888     0.86   0.388    -1.222937    3.144429
    15 2004  |    .132616    1.53618     0.09   0.931    -2.878935    3.144167
    15 2005  |    1.70255   1.334266     1.28   0.202    -.9131663    4.318266
    15 2006  |   2.234066   1.737711     1.29   0.199    -1.172571    5.640702
    15 2007  |   2.284369   1.544704     1.48   0.139    -.7438937    5.312631
    15 2008  |    4.04375   1.258759     3.21   0.001     1.576058    6.511441
    15 2009  |   4.383032   1.349808     3.25   0.001     1.736847    7.029218
    16 1997  |   12.74144   4.345903     2.93   0.003     4.221661    21.26121
    16 1998  |          0  (omitted)
    16 1999  |   1.881323   2.505076     0.75   0.453    -3.029666    6.792312
    16 2000  |   1.048378   1.176116     0.89   0.373    -1.257298    3.354053
    16 2001  |   3.662135   2.520417     1.45   0.146    -1.278929    8.603199
    16 2002  |   2.894777   2.932747     0.99   0.324    -2.854624    8.644179
    16 2003  |   .6400533   3.242101     0.20   0.844    -5.715811    6.995918
    16 2004  |  -.9377039   3.555626    -0.26   0.792    -7.908208    6.032801
    16 2005  |  -3.091669   4.705795    -0.66   0.511    -12.31698    6.133644
    16 2006  |   -3.16798   4.280547    -0.74   0.459    -11.55963    5.223669
    16 2007  |  -1.805172   3.245748    -0.56   0.578    -8.168186    4.557842
    16 2008  |   1.697816   3.025157     0.56   0.575    -4.232748    7.628381
    16 2009  |   1.352609   3.065458     0.44   0.659    -4.656961     7.36218
    17 1997  |   3.329637   4.338625     0.77   0.443     -5.17587    11.83515
    17 1998  |  -4.582086   1.133455    -4.04   0.000    -6.804129   -2.360043
    17 1999  |  -1.747642    .984915    -1.77   0.076    -3.678485    .1832003
    17 2000  |          0  (omitted)
    17 2001  |    2.40885   .9768788     2.47   0.014     .4937616    4.323938
    17 2002  |   1.647079   1.042934     1.58   0.114    -.3975046    3.691662
    17 2003  |   2.879399   .9598409     3.00   0.003     .9977126    4.761086
    17 2004  |   2.138158   1.533065     1.39   0.163    -.8672874    5.143603
    17 2005  |   2.600368   1.304036     1.99   0.046      .043915    5.156821
    17 2006  |   2.726242   1.709079     1.60   0.111     -.624263    6.076748
    17 2007  |   6.423378   1.493294     4.30   0.000     3.495902    9.350854
    17 2008  |   8.684387   1.297915     6.69   0.000     6.139934    11.22884
    17 2009  |   9.496342   1.289973     7.36   0.000      6.96746    12.02522
    21 1997  |  -7.020766   4.246489    -1.65   0.098    -15.34565    1.304117
    21 1998  |  -12.81121   1.002087   -12.78   0.000    -14.77571    -10.8467
    21 1999  |  -14.26528   2.408243    -5.92   0.000    -18.98644   -9.544121
    21 2000  |    -9.9768   1.033972    -9.65   0.000    -12.00382   -7.949785
    21 2001  |  -4.820778   .8197288    -5.88   0.000    -6.427787   -3.213769
    21 2002  |  -2.415716     .71417    -3.38   0.001    -3.815786   -1.015646
    21 2003  |  -.4772414   .7917722    -0.60   0.547    -2.029444    1.074961
    21 2004  |  -1.303794   .7312728    -1.78   0.075    -2.737393    .1298042
    21 2005  |   2.018696   .7093268     2.85   0.004     .6281209    3.409271
    21 2006  |          0  (omitted)
    21 2007  |   .6372906   .5685215     1.12   0.262    -.4772476    1.751829
    21 2008  |   2.257157   .6471965     3.49   0.000      .988383    3.525931
    21 2009  |   2.022759   .7154789     2.83   0.005     .6201234    3.425395
    22 1997  |          0  (omitted)
    22 1998  |  -6.816371   4.226943    -1.61   0.107    -15.10294    1.470194
    22 1999  |  -5.714339   4.275455    -1.34   0.181    -14.09601    2.667328
    22 2000  |   3.347384   4.319096     0.78   0.438    -5.119839    11.81461
    22 2001  |   5.449598    4.71114     1.16   0.247    -3.786193    14.68539
    22 2002  |   5.861698   4.640204     1.26   0.207    -3.235028    14.95843
    22 2003  |   8.691102   4.841234     1.80   0.073    -.7997269    18.18193
    22 2004  |    6.20903   4.969612     1.25   0.212    -3.533475    15.95153
    22 2005  |   9.515173   4.999145     1.90   0.057    -.2852288    19.31557
    22 2006  |   10.19375   4.958185     2.06   0.040     .4736486    19.91385
    22 2007  |   10.47423   4.905172     2.14   0.033     .8580547     20.0904
    22 2008  |   11.73363   4.796453     2.45   0.014      2.33059    21.13667
    22 2009  |   11.41217   4.992243     2.29   0.022     1.625305    21.19904
    23 1997  |          0  (omitted)
    23 1998  |  -7.407133   4.173309    -1.77   0.076    -15.58855     .774287
    23 1999  |  -4.759758    4.23732    -1.12   0.261    -13.06666    3.547149
    23 2000  |  -5.726715   4.489302    -1.28   0.202    -14.52761    3.074182
    23 2001  |  -4.085882   4.608575    -0.89   0.375     -13.1206     4.94884
    23 2002  |  -1.373838   4.311511    -0.32   0.750     -9.82619    7.078515
    23 2003  |   .7745962   4.307888     0.18   0.857    -7.670654    9.219846
    23 2004  |  -2.043351   4.813171    -0.42   0.671    -11.47917    7.392463
    23 2005  |   -1.25997   4.454927    -0.28   0.777    -9.993478    7.473538
    23 2006  |  -.4422934   4.744527    -0.09   0.926    -9.743538    8.858951
    23 2007  |  -1.578593   4.811013    -0.33   0.743    -11.01018    7.852991
    23 2008  |     .46658    4.99686     0.09   0.926    -9.329342     10.2625
    23 2009  |   .9061433   4.939961     0.18   0.854    -8.778233    10.59052
    24 1997  |   3.885282   4.458517     0.87   0.384    -4.855265    12.62583
    24 1998  |   -3.10974   1.126713    -2.76   0.006    -5.318566    -.900913
    24 1999  |  -2.807733   .9465918    -2.97   0.003    -4.663446   -.9520199
    24 2000  |   -1.93815   .8399568    -2.31   0.021    -3.584815   -.2914862
    24 2001  |  -1.294309   .7919427    -1.63   0.102    -2.846846    .2582272
    24 2002  |   .2309328   .5870946     0.39   0.694    -.9200165    1.381882
    24 2003  |  -1.023861   .5531628    -1.85   0.064     -2.10829    .0605683
    24 2004  |          0  (omitted)
    24 2005  |   .1211957   .9535313     0.13   0.899    -1.748122    1.990513
    24 2006  |  -1.434321   .6611264    -2.17   0.030    -2.730404    -.138239
    24 2007  |   .4368261   .7935313     0.55   0.582    -1.118825    1.992477
    24 2008  |   2.650431   .7291629     3.63   0.000     1.220969    4.079893
    24 2009  |   3.654544   .7430541     4.92   0.000      2.19785    5.111239
    25 1997  |          0  (omitted)
    25 1998  |  -6.116105   4.568274    -1.34   0.181    -15.07182    2.839611
    25 1999  |   -9.66241   6.422006    -1.50   0.132    -22.25221     2.92739
    25 2000  |  -5.596388   4.506001    -1.24   0.214    -14.43002    3.237247
    25 2001  |  -4.528873   4.667945    -0.97   0.332    -13.67998    4.622239
    25 2002  |  -3.294323   4.778384    -0.69   0.491    -12.66194    6.073295
    25 2003  |  -1.838978   4.747092    -0.39   0.698    -11.14525    7.467295
    25 2004  |  -1.076072   4.914441    -0.22   0.827    -10.71042    8.558273
    25 2005  |  -.9276597   4.798225    -0.19   0.847    -10.33417    8.478854
    25 2006  |  -1.503703   4.908204    -0.31   0.759    -11.12582    8.118416
    25 2007  |  -.3714513   4.691546    -0.08   0.937    -9.568831    8.825928
    25 2008  |   1.804955   4.767549     0.38   0.705    -7.541421    11.15133
    25 2009  |   1.756845   4.677591     0.38   0.707    -7.413176    10.92687
    26 1997  |          0  (omitted)
    26 1998  |  -5.583782   4.174239    -1.34   0.181    -13.76702     2.59946
    26 1999  |  -6.378778   4.262826    -1.50   0.135    -14.73569    1.978132
    26 2000  |  -6.238381   4.225879    -1.48   0.140    -14.52286    2.046097
    26 2001  |  -7.379963   4.254552    -1.73   0.083    -15.72065    .9607251
    26 2002  |  -7.940096   4.240667    -1.87   0.061    -16.25356    .3733729
    26 2003  |  -7.159665   4.306931    -1.66   0.097    -15.60304    1.283709
    26 2004  |  -8.048686   4.333847    -1.86   0.063    -16.54483    .4474541
    26 2005  |  -8.224013   4.283056    -1.92   0.055    -16.62058    .1725569
    26 2006  |  -8.775364   4.258463    -2.06   0.039    -17.12372   -.4270074
    26 2007  |  -8.196968   4.311983    -1.90   0.057    -16.65025    .2563104
    26 2008  |  -8.070584   4.339743    -1.86   0.063    -16.57828    .4371145
    26 2009  |  -8.179456   4.284047    -1.91   0.056    -16.57797    .2190568
    27 1997  |    6.03121   4.673092     1.29   0.197    -3.129991    15.19241
    27 1998  |   4.559029   1.088972     4.19   0.000     2.424192    6.693866
    27 1999  |  -2.883006   1.274439    -2.26   0.024    -5.381436   -.3845764
    27 2000  |  -2.630816   .7535313    -3.49   0.000    -4.108051   -1.153582
    27 2001  |   .1529503   .7106672     0.22   0.830    -1.240253    1.546153
    27 2002  |   .2957668   1.036425     0.29   0.775    -1.736056     2.32759
    27 2003  |  -1.313427   .9874663    -1.33   0.184    -3.249272    .6224166
    27 2004  |  -1.545683   .9514433    -1.62   0.104    -3.410907    .3195414
    27 2005  |  -1.591775   .8141642    -1.96   0.051    -3.187875    .0043255
    27 2006  |  -1.253339   .9829375    -1.28   0.202    -3.180305    .6736271
    27 2007  |   1.089856   .8488444     1.28   0.199    -.5742314    2.753944
    27 2008  |          0  (omitted)
    27 2009  |   1.174968   .5974646     1.97   0.049     .0036888    2.346246
    28 1997  |   3.601238    4.61539     0.78   0.435    -5.446844    12.64932
    28 1998  |  -.6036494   2.019173    -0.30   0.765    -4.562068    3.354769
    28 1999  |   .8551068   1.848336     0.46   0.644    -2.768399    4.478613
    28 2000  |    1.12234   .9689284     1.16   0.247    -.7771627    3.021842
    28 2001  |   1.471953   1.035203     1.42   0.155    -.5574748    3.501381
    28 2002  |   .8235519   .7630162     1.08   0.280    -.6722769    2.319381
    28 2003  |          0  (omitted)
    28 2004  |  -2.176689   .7895027    -2.76   0.006    -3.724443    -.628936
    28 2005  |  -.3275308    .798386    -0.41   0.682    -1.892699    1.237638
    28 2006  |  -1.353693   .8305383    -1.63   0.103    -2.981893    .2745068
    28 2007  |  -.8794082   .7980813    -1.10   0.271    -2.443979    .6851627
    28 2008  |   .9475201   1.102095     0.86   0.390    -1.213044    3.108085
    28 2009  |   2.223481   1.008154     2.21   0.027      .247081    4.199881
    29 1997  |   .2175523   4.573075     0.05   0.962    -8.747574    9.182679
    29 1998  |  -6.024759   2.009581    -3.00   0.003    -9.964371   -2.085146
    29 1999  |  -3.895337   1.367295    -2.85   0.004    -6.575802   -1.214871
    29 2000  |  -2.158579   .7307885    -2.95   0.003    -3.591228     -.72593
    29 2001  |  -1.831524    .714691    -2.56   0.010    -3.232615   -.4304326
    29 2002  |  -1.188375   .6799665    -1.75   0.081    -2.521392    .1446413
    29 2003  |  -.4481659   .3693772    -1.21   0.225    -1.172299    .2759669
    29 2004  |  -1.320123   .3708793    -3.56   0.000    -2.047201   -.5930455
    29 2005  |          0  (omitted)
    29 2006  |   1.781276     .40029     4.45   0.000     .9965416    2.566011
    29 2007  |   .7972067   .3619073     2.20   0.028      .087718    1.506695
    29 2008  |    1.60724   .5919088     2.72   0.007     .4468533    2.767628
    29 2009  |   2.356933   .5556091     4.24   0.000     1.267709    3.446158
    31 1997  |   5.355967   4.224216     1.27   0.205    -2.925252    13.63719
    31 1998  |  -2.886118   .7904673    -3.65   0.000    -4.435762   -1.336473
    31 1999  |  -3.161671   .8104166    -3.90   0.000    -4.750425   -1.572918
    31 2000  |  -4.669563   .5053563    -9.24   0.000    -5.660272   -3.678855
    31 2001  |  -3.875262   .4030231    -9.62   0.000    -4.665355   -3.085169
    31 2002  |  -4.738826   .4043447   -11.72   0.000     -5.53151   -3.946142
    31 2003  |  -1.565721   .3515723    -4.45   0.000    -2.254949   -.8764932
    31 2004  |  -2.519743   .3462473    -7.28   0.000    -3.198532   -1.840955
    31 2005  |  -1.702321   .2786293    -6.11   0.000     -2.24855   -1.156092
    31 2006  |   .5042598   .2508249     2.01   0.044     .0125387    .9959809
    31 2007  |          0  (omitted)
    31 2008  |  -.0774779   .2402814    -0.32   0.747    -.5485292    .3935734
    31 2009  |   .0048345   .3547856     0.01   0.989    -.6906928    .7003617
    32 1997  |          0  (omitted)
    32 1998  |  -3.190565   4.271459    -0.75   0.455     -11.5644     5.18327
    32 1999  |   -3.70584   4.339739    -0.85   0.393    -12.21353    4.801852
    32 2000  |  -3.241881   4.384605    -0.74   0.460    -11.83753    5.353767
    32 2001  |  -3.735842   4.316558    -0.87   0.387    -12.19809    4.726406
    32 2002  |  -5.017601    4.39974    -1.14   0.254    -13.64292    3.607718
    32 2003  |  -3.012037   4.338942    -0.69   0.488    -11.51817    5.494093
    32 2004  |  -4.724467    4.29753    -1.10   0.272    -13.14941    3.700476
    32 2005  |  -3.659085   4.357755    -0.84   0.401     -12.2021    4.883925
    32 2006  |   -1.69562   4.345556    -0.39   0.696    -10.21471    6.823475
    32 2007  |  -1.704652   4.357109    -0.39   0.696     -10.2464    6.837091
    32 2008  |   .3048245   4.454754     0.07   0.945    -8.428344    9.037993
    32 2009  |  -.4204071   4.380948    -0.10   0.924    -9.008886    8.168071
    33 1997  |   11.82628   4.375282     2.70   0.007     3.248914    20.40366
    33 1998  |   4.093292   1.321171     3.10   0.002     1.503248    6.683337
    33 1999  |    1.63873   .6634984     2.47   0.014     .3379972    2.939462
    33 2000  |  -.0255761   .5750246    -0.04   0.965    -1.152863    1.101711
    33 2001  |   1.274296     .31448     4.05   0.000     .6577847    1.890807
    33 2002  |   2.077484   .4060887     5.12   0.000     1.281382    2.873587
    33 2003  |   1.779775   .2515024     7.08   0.000     1.286726    2.272825
    33 2004  |   .1804538   .2553823     0.71   0.480    -.3202016    .6811092
    33 2005  |          0  (omitted)
    33 2006  |   1.317416   .4166925     3.16   0.002     .5005259    2.134307
    33 2007  |   1.873635   .4115041     4.55   0.000     1.066916    2.680354
    33 2008  |   2.348825   .4011106     5.86   0.000     1.562482    3.135169
    33 2009  |   2.452534   .5597485     4.38   0.000     1.355194    3.549873
    35 1997  |   9.742767    4.13464     2.36   0.018     1.637155    17.84838
    35 1998  |  -.0574929   .1925707    -0.30   0.765    -.4350115    .3200257
    35 1999  |          0  (omitted)
    35 2000  |  -.3811347   .4224971    -0.90   0.367    -1.209405    .4471352
    35 2001  |  -1.205357   .3620356    -3.33   0.001    -1.915097   -.4956166
    35 2002  |  -1.335992   .4215164    -3.17   0.002    -2.162339   -.5096444
    35 2003  |  -1.346998   .4763834    -2.83   0.005    -2.280908    -.413089
    35 2004  |  -2.745381   .5361042    -5.12   0.000    -3.796368   -1.694394
    35 2005  |  -2.911683   .6554359    -4.44   0.000    -4.196609   -1.626756
    35 2006  |  -1.747234   .6685034    -2.61   0.009    -3.057778   -.4366894
    35 2007  |  -1.491339   .6119925    -2.44   0.015    -2.691098    -.291579
    35 2008  |  -.7032969   .7788147    -0.90   0.367    -2.230097    .8235035
    35 2009  |    .069754   .7797773     0.09   0.929    -1.458933    1.598442
    41 1997  |          0  (omitted)
    41 1998  |    -7.2493   4.177508    -1.74   0.083    -15.43895     .940351
    41 1999  |  -9.113819   4.168131    -2.19   0.029    -17.28509   -.9425506
    41 2000  |  -7.644065   4.179652    -1.83   0.067    -15.83792    .5497896
    41 2001  |  -8.159649   4.194645    -1.95   0.052     -16.3829    .0635976
    41 2002  |  -7.156037   4.208141    -1.70   0.089    -15.40574    1.093667
    41 2003  |  -6.913272   4.199052    -1.65   0.100    -15.14516    1.318614
    41 2004  |  -6.593249   4.217624    -1.56   0.118    -14.86154    1.675045
    41 2005  |  -6.139874    4.21431    -1.46   0.145    -14.40167    2.121924
    41 2006  |  -4.671579   4.222773    -1.11   0.269    -12.94997    3.606811
    41 2007  |  -4.945376   4.239072    -1.17   0.243    -13.25572    3.364966
    41 2008  |  -4.115152   4.246668    -0.97   0.333    -12.44038     4.21008
    41 2009  |  -3.983153   4.447435    -0.90   0.371    -12.70197    4.735667
    42 1997  |   10.13048   4.185652     2.42   0.016     1.924867     18.3361
    42 1998  |   .9924423   .6519637     1.52   0.128    -.2856775    2.270562
    42 1999  |  -.6440796    .510478    -1.26   0.207    -1.644829    .3566693
    42 2000  |          0  (omitted)
    42 2001  |   .6548696   .3870206     1.69   0.091    -.1038516    1.413591
    42 2002  |     .32382   .4426556     0.73   0.464    -.5439688    1.191609
    42 2003  |   1.044837   .5223625     2.00   0.046     .0207898    2.068885
    42 2004  |   .3849747    .535743     0.72   0.472    -.6653042    1.435254
    42 2005  |   1.169962   .5740924     2.04   0.042     .0445029    2.295422
    42 2006  |   1.407406   .5983381     2.35   0.019      .234415    2.580398
    42 2007  |   2.559714   .5259146     4.87   0.000     1.528703    3.590725
    42 2008  |   2.162368   .6227569     3.47   0.001     .9415052     3.38323
    42 2009  |   3.854301   .6781504     5.68   0.000     2.524845    5.183758
    43 1997  |   3.202798   4.149568     0.77   0.440    -4.932078    11.33768
    43 1998  |   -1.51086   .4671961    -3.23   0.001    -2.426759   -.5949619
    43 1999  |  -4.648113    .447688   -10.38   0.000    -5.525767   -3.770458
    43 2000  |  -3.438589   .4010249    -8.57   0.000    -4.224765   -2.652414
    43 2001  |  -2.021309   .3781696    -5.34   0.000    -2.762678   -1.279939
    43 2002  |   -3.01823   .3354095    -9.00   0.000    -3.675772   -2.360688
    43 2003  |  -1.800893   .3411517    -5.28   0.000    -2.469692   -1.132094
    43 2004  |  -2.764977   .4002847    -6.91   0.000    -3.549702   -1.980253
    43 2005  |  -1.689336   .3532563    -4.78   0.000    -2.381865   -.9968069
    43 2006  |  -.9978935   .3729377    -2.68   0.007    -1.729006   -.2667807
    43 2007  |          0  (omitted)
    43 2008  |  -.1060272   .3789361    -0.28   0.780    -.8488992    .6368449
    43 2009  |   .9528486   .4235898     2.25   0.025     .1224366    1.783261
    50 1997  |          0  (omitted)
    50 1998  |  -9.473467   4.226572    -2.24   0.025     -17.7593   -1.187631
    50 1999  |  -7.517403   4.164417    -1.81   0.071    -15.68139     .646585
    50 2000  |  -9.390989   4.236393    -2.22   0.027    -17.69608   -1.085899
    50 2001  |   -9.20334   4.205221    -2.19   0.029    -17.44732   -.9593593
    50 2002  |  -9.561207    4.19234    -2.28   0.023    -17.77994   -1.342479
    50 2003  |   -6.24895   4.291843    -1.46   0.145    -14.66275    2.164845
    50 2004  |  -6.971273   4.416597    -1.58   0.115    -15.62964    1.687093
    50 2005  |  -6.197908   4.330485    -1.43   0.152    -14.68746    2.291642
    50 2006  |  -4.798108    4.39306    -1.09   0.275    -13.41033    3.814114
    50 2007  |  -4.154015   4.239374    -0.98   0.327    -12.46495     4.15692
    50 2008  |  -4.256444   4.260509    -1.00   0.318    -12.60881    4.095924
    50 2009  |  -3.610994   4.212849    -0.86   0.391    -11.86993    4.647939
    51 1997  |   .6529542   4.277961     0.15   0.879    -7.733627    9.039536
    51 1998  |  -3.872481   1.289983    -3.00   0.003    -6.401384   -1.343579
    51 1999  |  -2.075219   .8196295    -2.53   0.011    -3.682033   -.4684047
    51 2000  |   .2356512   .5516871     0.43   0.669    -.8458848    1.317187
    51 2001  |          0  (omitted)
    51 2002  |    .360152   .7879275     0.46   0.648    -1.184513    1.904817
    51 2003  |    .775742   1.005657     0.77   0.441    -1.195764    2.747248
    51 2004  |   .9595553    .964362     1.00   0.320    -.9309949    2.850105
    51 2005  |   1.828635   1.056954     1.73   0.084    -.2434343    3.900704
    51 2006  |   2.023544   1.480135     1.37   0.172    -.8781358    4.925224
    51 2007  |   .5208689   1.082861     0.48   0.631    -1.601989    2.643727
    51 2008  |   3.204849   .9008759     3.56   0.000     1.438758     4.97094
    51 2009  |   3.589251   .9331152     3.85   0.000     1.759957    5.418544
    52 1997  |          0  (omitted)
    52 1998  |  -8.750107   4.223537    -2.07   0.038    -17.02999   -.4702206
    52 1999  |  -7.515459   4.230146    -1.78   0.076     -15.8083    .7773842
    52 2000  |  -8.046163   4.279983    -1.88   0.060    -16.43671    .3443815
    52 2001  |  -7.422238   4.270926    -1.74   0.082    -15.79503    .9505507
    52 2002  |   -5.80903   4.253097    -1.37   0.172    -14.14687    2.528806
    52 2003  |  -5.633632   4.253996    -1.32   0.185    -13.97323    2.705967
    52 2004  |  -4.780103   4.299456    -1.11   0.266    -13.20882    3.648616
    52 2005  |  -5.040544   4.266939    -1.18   0.238    -13.40552    3.324429
    52 2006  |  -4.758885    4.33149    -1.10   0.272    -13.25041    3.732635
    52 2007  |  -4.066087    4.31345    -0.94   0.346    -12.52224    4.390067
    52 2008  |  -1.791588   4.355561    -0.41   0.681     -10.3303    6.747121
    52 2009  |  -2.009928   4.416161    -0.46   0.649    -10.66744    6.647581
    53 1997  |   8.314714   4.122465     2.02   0.044     .2329691    16.39646
    53 1998  |          0  (omitted)
    53 1999  |          0  (omitted)
    53 2000  |          0  (omitted)
    53 2001  |          0  (omitted)
    53 2002  |          0  (omitted)
    53 2003  |          0  (omitted)
    53 2004  |          0  (omitted)
    53 2005  |          0  (omitted)
    53 2006  |          0  (omitted)
    53 2007  |          0  (omitted)
    53 2008  |          0  (omitted)
    53 2009  |          0  (omitted)
             |
       _cons |   46.24306   .7689472    60.14   0.000      44.7356    47.75051
-------------+----------------------------------------------------------------
  fips_month |   absorbed                                   (63084 categories)

. //
. local holder

. lincom tavg_bin_0C_10C_ + l1_tavg_bin_0C_10C_ + l2_tavg_bin_0C_10C_ + l3_tavg
> _bin_0C_10C_

 ( 1)  tavg_bin_0C_10C_ + l1_tavg_bin_0C_10C_ + l2_tavg_bin_0C_10C_ +
       l3_tavg_bin_0C_10C_ = 0

------------------------------------------------------------------------------
   mrate_tot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.14225   .0969563    11.78   0.000     .9521757    1.332325
------------------------------------------------------------------------------

. local reg_c_010_cont = r(estimate)

. local reg_se_010_cont = r(se)

. local reg_se_010_left = `reg_c_010_cont' - 1.96 * `reg_se_010_cont'

. local reg_se_010_right = `reg_c_010_cont'+ 1.96 * `reg_se_010_cont'

. local holder "`holder' `reg_c_010_cont' , `reg_se_010_cont' , `reg_se_010_lef
> t' , `reg_se_010_right'"

. 
. local bins 10C_13C_ 13C_16C_ 16C_19C_ 19C_22C_   

. foreach i of local bins{
  2. lincom tavg_bin_`i' + l1_tavg_bin_`i' + l2_tavg_bin_`i' + l3_tavg_bin_`i'
  3. local reg_c_010_cont = r(estimate)
  4. local reg_se_010_cont = r(se)
  5. local reg_se_010_left = `reg_c_010_cont' - 1.96 * `reg_se_010_cont'
  6. local reg_se_010_right = `reg_c_010_cont'+ 1.96 * `reg_se_010_cont'
  7. local holder "`holder' \  `reg_c_010_cont' , `reg_se_010_cont' , `reg_se_0
> 10_left' , `reg_se_010_right'"
  8. di "`holder'"
  9. }

 ( 1)  tavg_bin_10C_13C_ + l1_tavg_bin_10C_13C_ + l2_tavg_bin_10C_13C_ +
       l3_tavg_bin_10C_13C_ = 0

------------------------------------------------------------------------------
   mrate_tot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7037228   .0584436    12.04   0.000     .5891491    .8182965
------------------------------------------------------------------------------
 1.142250249038203 , .0969562824332026 , .9522159354691259 , 1.33228456260728 \
>   .7037228142105489 , .0584435964384097 , .589173365191266 , .818272263229831
> 9

 ( 1)  tavg_bin_13C_16C_ + l1_tavg_bin_13C_16C_ + l2_tavg_bin_13C_16C_ +
       l3_tavg_bin_13C_16C_ = 0

------------------------------------------------------------------------------
   mrate_tot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .3531569   .0436442     8.09   0.000     .2675962    .4387176
------------------------------------------------------------------------------
 1.142250249038203 , .0969562824332026 , .9522159354691259 , 1.33228456260728 \
>   .7037228142105489 , .0584435964384097 , .589173365191266 , .818272263229831
> 9 \  .3531569184767115 , .0436441737815493 , .2676143378648749 , .43869949908
> 85481

 ( 1)  tavg_bin_16C_19C_ + l1_tavg_bin_16C_19C_ + l2_tavg_bin_16C_19C_ +
       l3_tavg_bin_16C_19C_ = 0

------------------------------------------------------------------------------
   mrate_tot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .2084642   .0312801     6.66   0.000     .1471422    .2697861
------------------------------------------------------------------------------
 1.142250249038203 , .0969562824332026 , .9522159354691259 , 1.33228456260728 \
>   .7037228142105489 , .0584435964384097 , .589173365191266 , .818272263229831
> 9 \  .3531569184767115 , .0436441737815493 , .2676143378648749 , .43869949908
> 85481 \  .2084641642793301 , .0312800921336937 , .1471551836972904 , .2697731
> 448613697

 ( 1)  tavg_bin_19C_22C_ + l1_tavg_bin_19C_22C_ + l2_tavg_bin_19C_22C_ +
       l3_tavg_bin_19C_22C_ = 0

------------------------------------------------------------------------------
   mrate_tot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0357235    .021965     1.63   0.104    -.0073369     .078784
------------------------------------------------------------------------------
 1.142250249038203 , .0969562824332026 , .9522159354691259 , 1.33228456260728 \
>   .7037228142105489 , .0584435964384097 , .589173365191266 , .818272263229831
> 9 \  .3531569184767115 , .0436441737815493 , .2676143378648749 , .43869949908
> 85481 \  .2084641642793301 , .0312800921336937 , .1471551836972904 , .2697731
> 448613697 \  .0357235461888385 , .0219649781382534 , -.0073278109621382 , .07
> 87749033398152

. 
. local holder "`holder' \  0 , 0 , 0 , 0 "

. 
. local bins 25C_28C_ 28C_31C_ 31C_Inf_  

. foreach i of local bins{
  2. lincom tavg_bin_`i' + l1_tavg_bin_`i' + l2_tavg_bin_`i' + l3_tavg_bin_`i'
  3. local reg_c_010_cont = r(estimate)
  4. local reg_se_010_cont = r(se)
  5. local reg_se_010_left = `reg_c_010_cont' - 1.96 * `reg_se_010_cont'
  6. local reg_se_010_right = `reg_c_010_cont'+ 1.96 * `reg_se_010_cont'
  7. local holder "`holder' \  `reg_c_010_cont' , `reg_se_010_cont' , `reg_se_0
> 10_left' , `reg_se_010_right'"
  8. di "`holder'"
  9. }

 ( 1)  tavg_bin_25C_28C_ + l1_tavg_bin_25C_28C_ + l2_tavg_bin_25C_28C_ +
       l3_tavg_bin_25C_28C_ = 0

------------------------------------------------------------------------------
   mrate_tot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0163973   .0170889     0.96   0.337     -.017104    .0498986
------------------------------------------------------------------------------
 1.142250249038203 , .0969562824332026 , .9522159354691259 , 1.33228456260728 \
>   .7037228142105489 , .0584435964384097 , .589173365191266 , .818272263229831
> 9 \  .3531569184767115 , .0436441737815493 , .2676143378648749 , .43869949908
> 85481 \  .2084641642793301 , .0312800921336937 , .1471551836972904 , .2697731
> 448613697 \  .0357235461888385 , .0219649781382534 , -.0073278109621382 , .07
> 87749033398152 \  0 , 0 , 0 , 0  \  .0163972955113821 , .017088885571291 , -.
> 0170969202083483 , .0498915112311125

 ( 1)  tavg_bin_28C_31C_ + l1_tavg_bin_28C_31C_ + l2_tavg_bin_28C_31C_ +
       l3_tavg_bin_28C_31C_ = 0

------------------------------------------------------------------------------
   mrate_tot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0288738   .0295843     0.98   0.329    -.0291237    .0868713
------------------------------------------------------------------------------
 1.142250249038203 , .0969562824332026 , .9522159354691259 , 1.33228456260728 \
>   .7037228142105489 , .0584435964384097 , .589173365191266 , .818272263229831
> 9 \  .3531569184767115 , .0436441737815493 , .2676143378648749 , .43869949908
> 85481 \  .2084641642793301 , .0312800921336937 , .1471551836972904 , .2697731
> 448613697 \  .0357235461888385 , .0219649781382534 , -.0073278109621382 , .07
> 87749033398152 \  0 , 0 , 0 , 0  \  .0163972955113821 , .017088885571291 , -.
> 0170969202083483 , .0498915112311125 \  .0288738040543252 , .0295843042319111
>  , -.0291114322402206 , .086859040348871

 ( 1)  tavg_bin_31C_Inf_ + l1_tavg_bin_31C_Inf_ + l2_tavg_bin_31C_Inf_ +
       l3_tavg_bin_31C_Inf_ = 0

------------------------------------------------------------------------------
   mrate_tot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6842347   .3285487     2.08   0.037     .0401428    1.328327
------------------------------------------------------------------------------
 1.142250249038203 , .0969562824332026 , .9522159354691259 , 1.33228456260728 \
>   .7037228142105489 , .0584435964384097 , .589173365191266 , .818272263229831
> 9 \  .3531569184767115 , .0436441737815493 , .2676143378648749 , .43869949908
> 85481 \  .2084641642793301 , .0312800921336937 , .1471551836972904 , .2697731
> 448613697 \  .0357235461888385 , .0219649781382534 , -.0073278109621382 , .07
> 87749033398152 \  0 , 0 , 0 , 0  \  .0163972955113821 , .017088885571291 , -.
> 0170969202083483 , .0498915112311125 \  .0288738040543252 , .0295843042319111
>  , -.0291114322402206 , .086859040348871 \  .684234700572903 , .3285486596557
> 247 , .0402793276476826 , 1.328190073498123

. 
. timer off 2

. timer list 2
   2:   1826.95 /        1 =    1826.9550

. 
. matrix b3 = (`holder')

. matrix list b3

b3[9,4]
            c1          c2          c3          c4
r1   1.1422502   .09695628   .95221594   1.3322846
r2   .70372281    .0584436   .58917337   .81827226
r3   .35315692   .04364417   .26761434    .4386995
r4   .20846416   .03128009   .14715518   .26977314
r5   .03572355   .02196498  -.00732781    .0787749
r6           0           0           0           0
r7    .0163973   .01708889  -.01709692   .04989151
r8    .0288738    .0295843  -.02911143   .08685904
r9    .6842347   .32854866   .04027933   1.3281901

. 
. 
. **********************************************
. ** Combining matrices and saving it as dta ***
. **********************************************
. matrix b = b, b1, b2, b3

. matrix list b

b[9,16]
            c1          c2          c3          c4          c1          c2
r1   .68768473   .04130021   .60673632   .76863314   .99065487   .05744652
r2   .47977293    .0268062   .42723278   .53231308   .65987588   .03905172
r3   .20571815   .01917186    .1681413     .243295   .34009216   .02705947
r4   .13133628    .0122549   .10731668   .15535589   .17453721   .01847711
r5    .0019285   .00886943  -.01545558   .01931259   .00920487   .01177267
r6           0           0           0           0           0           0
r7   .03171753   .00640578   .01916219   .04427286   .00706317   .00923058
r8   .09232629   .01385789   .06516484   .11948775   .01620773   .01839396
r9   .59509023   .14269415   .31540968   .87477077   .66922266   .18963822

            c3          c4          c1          c2          c3          c4
r1   .87805969   1.1032501   1.1047115   .07778495   .95225298     1.25717
r2   .58333451   .73641724    .7261866   .04629394   .63545047   .81692272
r3   .28705561   .39312871   .35512652   .03225455    .2919076   .41834544
r4   .13832207   .21075235   .17278873   .02619157   .12145326    .2241242
r5  -.01386956    .0322793   .00907491   .01771565  -.02564776   .04379759
r6           0           0           0           0           0           0
r7  -.01102876    .0251551    .0136689   .01253891  -.01090736   .03824517
r8  -.01984443   .05225989   .01449275   .02383375   -.0322214    .0612069
r9   .29753174   1.0409136    .6893044   .24903122   .20120321   1.1774056

            c1          c2          c3          c4
r1   1.1422502   .09695628   .95221594   1.3322846
r2   .70372281    .0584436   .58917337   .81827226
r3   .35315692   .04364417   .26761434    .4386995
r4   .20846416   .03128009   .14715518   .26977314
r5   .03572355   .02196498  -.00732781    .0787749
r6           0           0           0           0
r7    .0163973   .01708889  -.01709692   .04989151
r8    .0288738    .0295843  -.02911143   .08685904
r9    .6842347   .32854866   .04027933   1.3281901

. svmat b

. 
. gen x1 = _n 

. replace x1 = . if x1 >10
(826,166 real changes made, 826,166 to missing)

. 
. keep b1-b16 x1

. 
. local path_int /home/aviaene/Viaene_MortalityHospAdmBrazil/Data/Intermediate/

. saveold "`path_int'figures_lags", replace version(12)
(saving in Stata 12 format, which can be read by Stata 11 or 12)
(note: file /home/aviaene/Viaene_MortalityHospAdmBrazil/Data/Intermediate/figur
> es_lags.dta not found)
file /home/aviaene/Viaene_MortalityHospAdmBrazil/Data/Intermediate/figures_lags
> .dta saved

. 
. log off
      name:  <unnamed>
       log:  /home/solomon/Dropbox/GCP/WORKSHOP_STUDENT_FOLDERS/Viaene_Mortalit
> yHospAdmBrazil/Analysis/table_lags_fun.smcl
  log type:  smcl
 paused on:  11 Aug 2015, 21:55:15
-------------------------------------------------------------------------------

. 
. 
. 
end of do-file
